RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
/**
 * @file reg_stm32h7xx.h
 * @brief STM32H7xx Dual-Core Cortex-M7/M4 Peripheral Registers
 * @copyright Clean-room proprietary implementation. Zero GPL/Apache code.
 */

#ifndef REG_STM32H7XX_H
#define REG_STM32H7XX_H

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_1_TypeDef;
#define H7_PERIPH_1 ((H7_PERIPH_1_TypeDef *)(0x58000000UL + 1 * 0x400UL))

#define H7_PERIPH_1_BIT_0 (1UL << 0)
#define H7_PERIPH_1_BIT_1 (1UL << 1)
#define H7_PERIPH_1_BIT_2 (1UL << 2)
#define H7_PERIPH_1_BIT_3 (1UL << 3)
#define H7_PERIPH_1_BIT_4 (1UL << 4)
#define H7_PERIPH_1_BIT_5 (1UL << 5)
#define H7_PERIPH_1_BIT_6 (1UL << 6)
#define H7_PERIPH_1_BIT_7 (1UL << 7)
#define H7_PERIPH_1_BIT_8 (1UL << 8)
#define H7_PERIPH_1_BIT_9 (1UL << 9)
#define H7_PERIPH_1_BIT_10 (1UL << 10)
#define H7_PERIPH_1_BIT_11 (1UL << 11)
#define H7_PERIPH_1_BIT_12 (1UL << 12)
#define H7_PERIPH_1_BIT_13 (1UL << 13)
#define H7_PERIPH_1_BIT_14 (1UL << 14)
#define H7_PERIPH_1_BIT_15 (1UL << 15)
#define H7_PERIPH_1_BIT_16 (1UL << 16)
#define H7_PERIPH_1_BIT_17 (1UL << 17)
#define H7_PERIPH_1_BIT_18 (1UL << 18)
#define H7_PERIPH_1_BIT_19 (1UL << 19)
#define H7_PERIPH_1_BIT_20 (1UL << 20)
#define H7_PERIPH_1_BIT_21 (1UL << 21)
#define H7_PERIPH_1_BIT_22 (1UL << 22)
#define H7_PERIPH_1_BIT_23 (1UL << 23)
#define H7_PERIPH_1_BIT_24 (1UL << 24)
#define H7_PERIPH_1_BIT_25 (1UL << 25)
#define H7_PERIPH_1_BIT_26 (1UL << 26)
#define H7_PERIPH_1_BIT_27 (1UL << 27)
#define H7_PERIPH_1_BIT_28 (1UL << 28)
#define H7_PERIPH_1_BIT_29 (1UL << 29)
#define H7_PERIPH_1_BIT_30 (1UL << 30)
#define H7_PERIPH_1_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_2_TypeDef;
#define H7_PERIPH_2 ((H7_PERIPH_2_TypeDef *)(0x58000000UL + 2 * 0x400UL))

#define H7_PERIPH_2_BIT_0 (1UL << 0)
#define H7_PERIPH_2_BIT_1 (1UL << 1)
#define H7_PERIPH_2_BIT_2 (1UL << 2)
#define H7_PERIPH_2_BIT_3 (1UL << 3)
#define H7_PERIPH_2_BIT_4 (1UL << 4)
#define H7_PERIPH_2_BIT_5 (1UL << 5)
#define H7_PERIPH_2_BIT_6 (1UL << 6)
#define H7_PERIPH_2_BIT_7 (1UL << 7)
#define H7_PERIPH_2_BIT_8 (1UL << 8)
#define H7_PERIPH_2_BIT_9 (1UL << 9)
#define H7_PERIPH_2_BIT_10 (1UL << 10)
#define H7_PERIPH_2_BIT_11 (1UL << 11)
#define H7_PERIPH_2_BIT_12 (1UL << 12)
#define H7_PERIPH_2_BIT_13 (1UL << 13)
#define H7_PERIPH_2_BIT_14 (1UL << 14)
#define H7_PERIPH_2_BIT_15 (1UL << 15)
#define H7_PERIPH_2_BIT_16 (1UL << 16)
#define H7_PERIPH_2_BIT_17 (1UL << 17)
#define H7_PERIPH_2_BIT_18 (1UL << 18)
#define H7_PERIPH_2_BIT_19 (1UL << 19)
#define H7_PERIPH_2_BIT_20 (1UL << 20)
#define H7_PERIPH_2_BIT_21 (1UL << 21)
#define H7_PERIPH_2_BIT_22 (1UL << 22)
#define H7_PERIPH_2_BIT_23 (1UL << 23)
#define H7_PERIPH_2_BIT_24 (1UL << 24)
#define H7_PERIPH_2_BIT_25 (1UL << 25)
#define H7_PERIPH_2_BIT_26 (1UL << 26)
#define H7_PERIPH_2_BIT_27 (1UL << 27)
#define H7_PERIPH_2_BIT_28 (1UL << 28)
#define H7_PERIPH_2_BIT_29 (1UL << 29)
#define H7_PERIPH_2_BIT_30 (1UL << 30)
#define H7_PERIPH_2_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_3_TypeDef;
#define H7_PERIPH_3 ((H7_PERIPH_3_TypeDef *)(0x58000000UL + 3 * 0x400UL))

#define H7_PERIPH_3_BIT_0 (1UL << 0)
#define H7_PERIPH_3_BIT_1 (1UL << 1)
#define H7_PERIPH_3_BIT_2 (1UL << 2)
#define H7_PERIPH_3_BIT_3 (1UL << 3)
#define H7_PERIPH_3_BIT_4 (1UL << 4)
#define H7_PERIPH_3_BIT_5 (1UL << 5)
#define H7_PERIPH_3_BIT_6 (1UL << 6)
#define H7_PERIPH_3_BIT_7 (1UL << 7)
#define H7_PERIPH_3_BIT_8 (1UL << 8)
#define H7_PERIPH_3_BIT_9 (1UL << 9)
#define H7_PERIPH_3_BIT_10 (1UL << 10)
#define H7_PERIPH_3_BIT_11 (1UL << 11)
#define H7_PERIPH_3_BIT_12 (1UL << 12)
#define H7_PERIPH_3_BIT_13 (1UL << 13)
#define H7_PERIPH_3_BIT_14 (1UL << 14)
#define H7_PERIPH_3_BIT_15 (1UL << 15)
#define H7_PERIPH_3_BIT_16 (1UL << 16)
#define H7_PERIPH_3_BIT_17 (1UL << 17)
#define H7_PERIPH_3_BIT_18 (1UL << 18)
#define H7_PERIPH_3_BIT_19 (1UL << 19)
#define H7_PERIPH_3_BIT_20 (1UL << 20)
#define H7_PERIPH_3_BIT_21 (1UL << 21)
#define H7_PERIPH_3_BIT_22 (1UL << 22)
#define H7_PERIPH_3_BIT_23 (1UL << 23)
#define H7_PERIPH_3_BIT_24 (1UL << 24)
#define H7_PERIPH_3_BIT_25 (1UL << 25)
#define H7_PERIPH_3_BIT_26 (1UL << 26)
#define H7_PERIPH_3_BIT_27 (1UL << 27)
#define H7_PERIPH_3_BIT_28 (1UL << 28)
#define H7_PERIPH_3_BIT_29 (1UL << 29)
#define H7_PERIPH_3_BIT_30 (1UL << 30)
#define H7_PERIPH_3_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_4_TypeDef;
#define H7_PERIPH_4 ((H7_PERIPH_4_TypeDef *)(0x58000000UL + 4 * 0x400UL))

#define H7_PERIPH_4_BIT_0 (1UL << 0)
#define H7_PERIPH_4_BIT_1 (1UL << 1)
#define H7_PERIPH_4_BIT_2 (1UL << 2)
#define H7_PERIPH_4_BIT_3 (1UL << 3)
#define H7_PERIPH_4_BIT_4 (1UL << 4)
#define H7_PERIPH_4_BIT_5 (1UL << 5)
#define H7_PERIPH_4_BIT_6 (1UL << 6)
#define H7_PERIPH_4_BIT_7 (1UL << 7)
#define H7_PERIPH_4_BIT_8 (1UL << 8)
#define H7_PERIPH_4_BIT_9 (1UL << 9)
#define H7_PERIPH_4_BIT_10 (1UL << 10)
#define H7_PERIPH_4_BIT_11 (1UL << 11)
#define H7_PERIPH_4_BIT_12 (1UL << 12)
#define H7_PERIPH_4_BIT_13 (1UL << 13)
#define H7_PERIPH_4_BIT_14 (1UL << 14)
#define H7_PERIPH_4_BIT_15 (1UL << 15)
#define H7_PERIPH_4_BIT_16 (1UL << 16)
#define H7_PERIPH_4_BIT_17 (1UL << 17)
#define H7_PERIPH_4_BIT_18 (1UL << 18)
#define H7_PERIPH_4_BIT_19 (1UL << 19)
#define H7_PERIPH_4_BIT_20 (1UL << 20)
#define H7_PERIPH_4_BIT_21 (1UL << 21)
#define H7_PERIPH_4_BIT_22 (1UL << 22)
#define H7_PERIPH_4_BIT_23 (1UL << 23)
#define H7_PERIPH_4_BIT_24 (1UL << 24)
#define H7_PERIPH_4_BIT_25 (1UL << 25)
#define H7_PERIPH_4_BIT_26 (1UL << 26)
#define H7_PERIPH_4_BIT_27 (1UL << 27)
#define H7_PERIPH_4_BIT_28 (1UL << 28)
#define H7_PERIPH_4_BIT_29 (1UL << 29)
#define H7_PERIPH_4_BIT_30 (1UL << 30)
#define H7_PERIPH_4_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_5_TypeDef;
#define H7_PERIPH_5 ((H7_PERIPH_5_TypeDef *)(0x58000000UL + 5 * 0x400UL))

