RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_5_BIT_0 (1UL << 0)
#define H7_PERIPH_5_BIT_1 (1UL << 1)
#define H7_PERIPH_5_BIT_2 (1UL << 2)
#define H7_PERIPH_5_BIT_3 (1UL << 3)
#define H7_PERIPH_5_BIT_4 (1UL << 4)
#define H7_PERIPH_5_BIT_5 (1UL << 5)
#define H7_PERIPH_5_BIT_6 (1UL << 6)
#define H7_PERIPH_5_BIT_7 (1UL << 7)
#define H7_PERIPH_5_BIT_8 (1UL << 8)
#define H7_PERIPH_5_BIT_9 (1UL << 9)
#define H7_PERIPH_5_BIT_10 (1UL << 10)
#define H7_PERIPH_5_BIT_11 (1UL << 11)
#define H7_PERIPH_5_BIT_12 (1UL << 12)
#define H7_PERIPH_5_BIT_13 (1UL << 13)
#define H7_PERIPH_5_BIT_14 (1UL << 14)
#define H7_PERIPH_5_BIT_15 (1UL << 15)
#define H7_PERIPH_5_BIT_16 (1UL << 16)
#define H7_PERIPH_5_BIT_17 (1UL << 17)
#define H7_PERIPH_5_BIT_18 (1UL << 18)
#define H7_PERIPH_5_BIT_19 (1UL << 19)
#define H7_PERIPH_5_BIT_20 (1UL << 20)
#define H7_PERIPH_5_BIT_21 (1UL << 21)
#define H7_PERIPH_5_BIT_22 (1UL << 22)
#define H7_PERIPH_5_BIT_23 (1UL << 23)
#define H7_PERIPH_5_BIT_24 (1UL << 24)
#define H7_PERIPH_5_BIT_25 (1UL << 25)
#define H7_PERIPH_5_BIT_26 (1UL << 26)
#define H7_PERIPH_5_BIT_27 (1UL << 27)
#define H7_PERIPH_5_BIT_28 (1UL << 28)
#define H7_PERIPH_5_BIT_29 (1UL << 29)
#define H7_PERIPH_5_BIT_30 (1UL << 30)
#define H7_PERIPH_5_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_6_TypeDef;
#define H7_PERIPH_6 ((H7_PERIPH_6_TypeDef *)(0x58000000UL + 6 * 0x400UL))

#define H7_PERIPH_6_BIT_0 (1UL << 0)
#define H7_PERIPH_6_BIT_1 (1UL << 1)
#define H7_PERIPH_6_BIT_2 (1UL << 2)
#define H7_PERIPH_6_BIT_3 (1UL << 3)
#define H7_PERIPH_6_BIT_4 (1UL << 4)
#define H7_PERIPH_6_BIT_5 (1UL << 5)
#define H7_PERIPH_6_BIT_6 (1UL << 6)
#define H7_PERIPH_6_BIT_7 (1UL << 7)
#define H7_PERIPH_6_BIT_8 (1UL << 8)
#define H7_PERIPH_6_BIT_9 (1UL << 9)
#define H7_PERIPH_6_BIT_10 (1UL << 10)
#define H7_PERIPH_6_BIT_11 (1UL << 11)
#define H7_PERIPH_6_BIT_12 (1UL << 12)
#define H7_PERIPH_6_BIT_13 (1UL << 13)
#define H7_PERIPH_6_BIT_14 (1UL << 14)
#define H7_PERIPH_6_BIT_15 (1UL << 15)
#define H7_PERIPH_6_BIT_16 (1UL << 16)
#define H7_PERIPH_6_BIT_17 (1UL << 17)
#define H7_PERIPH_6_BIT_18 (1UL << 18)
#define H7_PERIPH_6_BIT_19 (1UL << 19)
#define H7_PERIPH_6_BIT_20 (1UL << 20)
#define H7_PERIPH_6_BIT_21 (1UL << 21)
#define H7_PERIPH_6_BIT_22 (1UL << 22)
#define H7_PERIPH_6_BIT_23 (1UL << 23)
#define H7_PERIPH_6_BIT_24 (1UL << 24)
#define H7_PERIPH_6_BIT_25 (1UL << 25)
#define H7_PERIPH_6_BIT_26 (1UL << 26)
#define H7_PERIPH_6_BIT_27 (1UL << 27)
#define H7_PERIPH_6_BIT_28 (1UL << 28)
#define H7_PERIPH_6_BIT_29 (1UL << 29)
#define H7_PERIPH_6_BIT_30 (1UL << 30)
#define H7_PERIPH_6_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_7_TypeDef;
#define H7_PERIPH_7 ((H7_PERIPH_7_TypeDef *)(0x58000000UL + 7 * 0x400UL))

#define H7_PERIPH_7_BIT_0 (1UL << 0)
#define H7_PERIPH_7_BIT_1 (1UL << 1)
#define H7_PERIPH_7_BIT_2 (1UL << 2)
#define H7_PERIPH_7_BIT_3 (1UL << 3)
#define H7_PERIPH_7_BIT_4 (1UL << 4)
#define H7_PERIPH_7_BIT_5 (1UL << 5)
#define H7_PERIPH_7_BIT_6 (1UL << 6)
#define H7_PERIPH_7_BIT_7 (1UL << 7)
#define H7_PERIPH_7_BIT_8 (1UL << 8)
#define H7_PERIPH_7_BIT_9 (1UL << 9)
#define H7_PERIPH_7_BIT_10 (1UL << 10)
#define H7_PERIPH_7_BIT_11 (1UL << 11)
#define H7_PERIPH_7_BIT_12 (1UL << 12)
#define H7_PERIPH_7_BIT_13 (1UL << 13)
#define H7_PERIPH_7_BIT_14 (1UL << 14)
#define H7_PERIPH_7_BIT_15 (1UL << 15)
#define H7_PERIPH_7_BIT_16 (1UL << 16)
#define H7_PERIPH_7_BIT_17 (1UL << 17)
#define H7_PERIPH_7_BIT_18 (1UL << 18)
#define H7_PERIPH_7_BIT_19 (1UL << 19)
#define H7_PERIPH_7_BIT_20 (1UL << 20)
#define H7_PERIPH_7_BIT_21 (1UL << 21)
#define H7_PERIPH_7_BIT_22 (1UL << 22)
#define H7_PERIPH_7_BIT_23 (1UL << 23)
#define H7_PERIPH_7_BIT_24 (1UL << 24)
#define H7_PERIPH_7_BIT_25 (1UL << 25)
#define H7_PERIPH_7_BIT_26 (1UL << 26)
#define H7_PERIPH_7_BIT_27 (1UL << 27)
#define H7_PERIPH_7_BIT_28 (1UL << 28)
#define H7_PERIPH_7_BIT_29 (1UL << 29)
#define H7_PERIPH_7_BIT_30 (1UL << 30)
#define H7_PERIPH_7_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_8_TypeDef;
#define H7_PERIPH_8 ((H7_PERIPH_8_TypeDef *)(0x58000000UL + 8 * 0x400UL))

#define H7_PERIPH_8_BIT_0 (1UL << 0)
#define H7_PERIPH_8_BIT_1 (1UL << 1)
#define H7_PERIPH_8_BIT_2 (1UL << 2)
#define H7_PERIPH_8_BIT_3 (1UL << 3)
#define H7_PERIPH_8_BIT_4 (1UL << 4)
#define H7_PERIPH_8_BIT_5 (1UL << 5)
#define H7_PERIPH_8_BIT_6 (1UL << 6)
#define H7_PERIPH_8_BIT_7 (1UL << 7)
#define H7_PERIPH_8_BIT_8 (1UL << 8)
#define H7_PERIPH_8_BIT_9 (1UL << 9)
#define H7_PERIPH_8_BIT_10 (1UL << 10)
#define H7_PERIPH_8_BIT_11 (1UL << 11)
#define H7_PERIPH_8_BIT_12 (1UL << 12)
#define H7_PERIPH_8_BIT_13 (1UL << 13)
#define H7_PERIPH_8_BIT_14 (1UL << 14)
#define H7_PERIPH_8_BIT_15 (1UL << 15)
#define H7_PERIPH_8_BIT_16 (1UL << 16)
#define H7_PERIPH_8_BIT_17 (1UL << 17)
#define H7_PERIPH_8_BIT_18 (1UL << 18)
#define H7_PERIPH_8_BIT_19 (1UL << 19)
#define H7_PERIPH_8_BIT_20 (1UL << 20)
#define H7_PERIPH_8_BIT_21 (1UL << 21)
#define H7_PERIPH_8_BIT_22 (1UL << 22)
#define H7_PERIPH_8_BIT_23 (1UL << 23)
#define H7_PERIPH_8_BIT_24 (1UL << 24)
#define H7_PERIPH_8_BIT_25 (1UL << 25)
#define H7_PERIPH_8_BIT_26 (1UL << 26)
#define H7_PERIPH_8_BIT_27 (1UL << 27)
#define H7_PERIPH_8_BIT_28 (1UL << 28)
#define H7_PERIPH_8_BIT_29 (1UL << 29)
#define H7_PERIPH_8_BIT_30 (1UL << 30)
#define H7_PERIPH_8_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_9_TypeDef;
#define H7_PERIPH_9 ((H7_PERIPH_9_TypeDef *)(0x58000000UL + 9 * 0x400UL))

#define H7_PERIPH_9_BIT_0 (1UL << 0)
#define H7_PERIPH_9_BIT_1 (1UL << 1)
#define H7_PERIPH_9_BIT_2 (1UL << 2)
#define H7_PERIPH_9_BIT_3 (1UL << 3)
#define H7_PERIPH_9_BIT_4 (1UL << 4)
#define H7_PERIPH_9_BIT_5 (1UL << 5)
#define H7_PERIPH_9_BIT_6 (1UL << 6)
#define H7_PERIPH_9_BIT_7 (1UL << 7)
#define H7_PERIPH_9_BIT_8 (1UL << 8)
#define H7_PERIPH_9_BIT_9 (1UL << 9)
#define H7_PERIPH_9_BIT_10 (1UL << 10)
#define H7_PERIPH_9_BIT_11 (1UL << 11)
#define H7_PERIPH_9_BIT_12 (1UL << 12)
#define H7_PERIPH_9_BIT_13 (1UL << 13)
#define H7_PERIPH_9_BIT_14 (1UL << 14)
#define H7_PERIPH_9_BIT_15 (1UL << 15)
#define H7_PERIPH_9_BIT_16 (1UL << 16)
#define H7_PERIPH_9_BIT_17 (1UL << 17)
#define H7_PERIPH_9_BIT_18 (1UL << 18)
#define H7_PERIPH_9_BIT_19 (1UL << 19)
#define H7_PERIPH_9_BIT_20 (1UL << 20)
#define H7_PERIPH_9_BIT_21 (1UL << 21)
#define H7_PERIPH_9_BIT_22 (1UL << 22)
#define H7_PERIPH_9_BIT_23 (1UL << 23)
#define H7_PERIPH_9_BIT_24 (1UL << 24)
#define H7_PERIPH_9_BIT_25 (1UL << 25)
#define H7_PERIPH_9_BIT_26 (1UL << 26)
#define H7_PERIPH_9_BIT_27 (1UL << 27)
#define H7_PERIPH_9_BIT_28 (1UL << 28)
#define H7_PERIPH_9_BIT_29 (1UL << 29)
#define H7_PERIPH_9_BIT_30 (1UL << 30)
#define H7_PERIPH_9_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_10_TypeDef;
#define H7_PERIPH_10 ((H7_PERIPH_10_TypeDef *)(0x58000000UL + 10 * 0x400UL))

#define H7_PERIPH_10_BIT_0 (1UL << 0)
#define H7_PERIPH_10_BIT_1 (1UL << 1)
#define H7_PERIPH_10_BIT_2 (1UL << 2)
#define H7_PERIPH_10_BIT_3 (1UL << 3)
#define H7_PERIPH_10_BIT_4 (1UL << 4)
#define H7_PERIPH_10_BIT_5 (1UL << 5)
#define H7_PERIPH_10_BIT_6 (1UL << 6)
#define H7_PERIPH_10_BIT_7 (1UL << 7)
#define H7_PERIPH_10_BIT_8 (1UL << 8)
#define H7_PERIPH_10_BIT_9 (1UL << 9)
#define H7_PERIPH_10_BIT_10 (1UL << 10)
#define H7_PERIPH_10_BIT_11 (1UL << 11)
#define H7_PERIPH_10_BIT_12 (1UL << 12)
#define H7_PERIPH_10_BIT_13 (1UL << 13)
#define H7_PERIPH_10_BIT_14 (1UL << 14)
#define H7_PERIPH_10_BIT_15 (1UL << 15)
#define H7_PERIPH_10_BIT_16 (1UL << 16)
#define H7_PERIPH_10_BIT_17 (1UL << 17)
#define H7_PERIPH_10_BIT_18 (1UL << 18)
#define H7_PERIPH_10_BIT_19 (1UL << 19)
#define H7_PERIPH_10_BIT_20 (1UL << 20)
#define H7_PERIPH_10_BIT_21 (1UL << 21)
#define H7_PERIPH_10_BIT_22 (1UL << 22)
#define H7_PERIPH_10_BIT_23 (1UL << 23)
#define H7_PERIPH_10_BIT_24 (1UL << 24)
#define H7_PERIPH_10_BIT_25 (1UL << 25)
#define H7_PERIPH_10_BIT_26 (1UL << 26)
#define H7_PERIPH_10_BIT_27 (1UL << 27)
#define H7_PERIPH_10_BIT_28 (1UL << 28)
#define H7_PERIPH_10_BIT_29 (1UL << 29)
#define H7_PERIPH_10_BIT_30 (1UL << 30)
#define H7_PERIPH_10_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_11_TypeDef;
#define H7_PERIPH_11 ((H7_PERIPH_11_TypeDef *)(0x58000000UL + 11 * 0x400UL))

