RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_11_BIT_0 (1UL << 0)
#define H7_PERIPH_11_BIT_1 (1UL << 1)
#define H7_PERIPH_11_BIT_2 (1UL << 2)
#define H7_PERIPH_11_BIT_3 (1UL << 3)
#define H7_PERIPH_11_BIT_4 (1UL << 4)
#define H7_PERIPH_11_BIT_5 (1UL << 5)
#define H7_PERIPH_11_BIT_6 (1UL << 6)
#define H7_PERIPH_11_BIT_7 (1UL << 7)
#define H7_PERIPH_11_BIT_8 (1UL << 8)
#define H7_PERIPH_11_BIT_9 (1UL << 9)
#define H7_PERIPH_11_BIT_10 (1UL << 10)
#define H7_PERIPH_11_BIT_11 (1UL << 11)
#define H7_PERIPH_11_BIT_12 (1UL << 12)
#define H7_PERIPH_11_BIT_13 (1UL << 13)
#define H7_PERIPH_11_BIT_14 (1UL << 14)
#define H7_PERIPH_11_BIT_15 (1UL << 15)
#define H7_PERIPH_11_BIT_16 (1UL << 16)
#define H7_PERIPH_11_BIT_17 (1UL << 17)
#define H7_PERIPH_11_BIT_18 (1UL << 18)
#define H7_PERIPH_11_BIT_19 (1UL << 19)
#define H7_PERIPH_11_BIT_20 (1UL << 20)
#define H7_PERIPH_11_BIT_21 (1UL << 21)
#define H7_PERIPH_11_BIT_22 (1UL << 22)
#define H7_PERIPH_11_BIT_23 (1UL << 23)
#define H7_PERIPH_11_BIT_24 (1UL << 24)
#define H7_PERIPH_11_BIT_25 (1UL << 25)
#define H7_PERIPH_11_BIT_26 (1UL << 26)
#define H7_PERIPH_11_BIT_27 (1UL << 27)
#define H7_PERIPH_11_BIT_28 (1UL << 28)
#define H7_PERIPH_11_BIT_29 (1UL << 29)
#define H7_PERIPH_11_BIT_30 (1UL << 30)
#define H7_PERIPH_11_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_12_TypeDef;
#define H7_PERIPH_12 ((H7_PERIPH_12_TypeDef *)(0x58000000UL + 12 * 0x400UL))

#define H7_PERIPH_12_BIT_0 (1UL << 0)
#define H7_PERIPH_12_BIT_1 (1UL << 1)
#define H7_PERIPH_12_BIT_2 (1UL << 2)
#define H7_PERIPH_12_BIT_3 (1UL << 3)
#define H7_PERIPH_12_BIT_4 (1UL << 4)
#define H7_PERIPH_12_BIT_5 (1UL << 5)
#define H7_PERIPH_12_BIT_6 (1UL << 6)
#define H7_PERIPH_12_BIT_7 (1UL << 7)
#define H7_PERIPH_12_BIT_8 (1UL << 8)
#define H7_PERIPH_12_BIT_9 (1UL << 9)
#define H7_PERIPH_12_BIT_10 (1UL << 10)
#define H7_PERIPH_12_BIT_11 (1UL << 11)
#define H7_PERIPH_12_BIT_12 (1UL << 12)
#define H7_PERIPH_12_BIT_13 (1UL << 13)
#define H7_PERIPH_12_BIT_14 (1UL << 14)
#define H7_PERIPH_12_BIT_15 (1UL << 15)
#define H7_PERIPH_12_BIT_16 (1UL << 16)
#define H7_PERIPH_12_BIT_17 (1UL << 17)
#define H7_PERIPH_12_BIT_18 (1UL << 18)
#define H7_PERIPH_12_BIT_19 (1UL << 19)
#define H7_PERIPH_12_BIT_20 (1UL << 20)
#define H7_PERIPH_12_BIT_21 (1UL << 21)
#define H7_PERIPH_12_BIT_22 (1UL << 22)
#define H7_PERIPH_12_BIT_23 (1UL << 23)
#define H7_PERIPH_12_BIT_24 (1UL << 24)
#define H7_PERIPH_12_BIT_25 (1UL << 25)
#define H7_PERIPH_12_BIT_26 (1UL << 26)
#define H7_PERIPH_12_BIT_27 (1UL << 27)
#define H7_PERIPH_12_BIT_28 (1UL << 28)
#define H7_PERIPH_12_BIT_29 (1UL << 29)
#define H7_PERIPH_12_BIT_30 (1UL << 30)
#define H7_PERIPH_12_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_13_TypeDef;
#define H7_PERIPH_13 ((H7_PERIPH_13_TypeDef *)(0x58000000UL + 13 * 0x400UL))

#define H7_PERIPH_13_BIT_0 (1UL << 0)
#define H7_PERIPH_13_BIT_1 (1UL << 1)
#define H7_PERIPH_13_BIT_2 (1UL << 2)
#define H7_PERIPH_13_BIT_3 (1UL << 3)
#define H7_PERIPH_13_BIT_4 (1UL << 4)
#define H7_PERIPH_13_BIT_5 (1UL << 5)
#define H7_PERIPH_13_BIT_6 (1UL << 6)
#define H7_PERIPH_13_BIT_7 (1UL << 7)
#define H7_PERIPH_13_BIT_8 (1UL << 8)
#define H7_PERIPH_13_BIT_9 (1UL << 9)
#define H7_PERIPH_13_BIT_10 (1UL << 10)
#define H7_PERIPH_13_BIT_11 (1UL << 11)
#define H7_PERIPH_13_BIT_12 (1UL << 12)
#define H7_PERIPH_13_BIT_13 (1UL << 13)
#define H7_PERIPH_13_BIT_14 (1UL << 14)
#define H7_PERIPH_13_BIT_15 (1UL << 15)
#define H7_PERIPH_13_BIT_16 (1UL << 16)
#define H7_PERIPH_13_BIT_17 (1UL << 17)
#define H7_PERIPH_13_BIT_18 (1UL << 18)
#define H7_PERIPH_13_BIT_19 (1UL << 19)
#define H7_PERIPH_13_BIT_20 (1UL << 20)
#define H7_PERIPH_13_BIT_21 (1UL << 21)
#define H7_PERIPH_13_BIT_22 (1UL << 22)
#define H7_PERIPH_13_BIT_23 (1UL << 23)
#define H7_PERIPH_13_BIT_24 (1UL << 24)
#define H7_PERIPH_13_BIT_25 (1UL << 25)
#define H7_PERIPH_13_BIT_26 (1UL << 26)
#define H7_PERIPH_13_BIT_27 (1UL << 27)
#define H7_PERIPH_13_BIT_28 (1UL << 28)
#define H7_PERIPH_13_BIT_29 (1UL << 29)
#define H7_PERIPH_13_BIT_30 (1UL << 30)
#define H7_PERIPH_13_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_14_TypeDef;
#define H7_PERIPH_14 ((H7_PERIPH_14_TypeDef *)(0x58000000UL + 14 * 0x400UL))

#define H7_PERIPH_14_BIT_0 (1UL << 0)
#define H7_PERIPH_14_BIT_1 (1UL << 1)
#define H7_PERIPH_14_BIT_2 (1UL << 2)
#define H7_PERIPH_14_BIT_3 (1UL << 3)
#define H7_PERIPH_14_BIT_4 (1UL << 4)
#define H7_PERIPH_14_BIT_5 (1UL << 5)
#define H7_PERIPH_14_BIT_6 (1UL << 6)
#define H7_PERIPH_14_BIT_7 (1UL << 7)
#define H7_PERIPH_14_BIT_8 (1UL << 8)
#define H7_PERIPH_14_BIT_9 (1UL << 9)
#define H7_PERIPH_14_BIT_10 (1UL << 10)
#define H7_PERIPH_14_BIT_11 (1UL << 11)
#define H7_PERIPH_14_BIT_12 (1UL << 12)
#define H7_PERIPH_14_BIT_13 (1UL << 13)
#define H7_PERIPH_14_BIT_14 (1UL << 14)
#define H7_PERIPH_14_BIT_15 (1UL << 15)
#define H7_PERIPH_14_BIT_16 (1UL << 16)
#define H7_PERIPH_14_BIT_17 (1UL << 17)
#define H7_PERIPH_14_BIT_18 (1UL << 18)
#define H7_PERIPH_14_BIT_19 (1UL << 19)
#define H7_PERIPH_14_BIT_20 (1UL << 20)
#define H7_PERIPH_14_BIT_21 (1UL << 21)
#define H7_PERIPH_14_BIT_22 (1UL << 22)
#define H7_PERIPH_14_BIT_23 (1UL << 23)
#define H7_PERIPH_14_BIT_24 (1UL << 24)
#define H7_PERIPH_14_BIT_25 (1UL << 25)
#define H7_PERIPH_14_BIT_26 (1UL << 26)
#define H7_PERIPH_14_BIT_27 (1UL << 27)
#define H7_PERIPH_14_BIT_28 (1UL << 28)
#define H7_PERIPH_14_BIT_29 (1UL << 29)
#define H7_PERIPH_14_BIT_30 (1UL << 30)
#define H7_PERIPH_14_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_15_TypeDef;
#define H7_PERIPH_15 ((H7_PERIPH_15_TypeDef *)(0x58000000UL + 15 * 0x400UL))

#define H7_PERIPH_15_BIT_0 (1UL << 0)
#define H7_PERIPH_15_BIT_1 (1UL << 1)
#define H7_PERIPH_15_BIT_2 (1UL << 2)
#define H7_PERIPH_15_BIT_3 (1UL << 3)
#define H7_PERIPH_15_BIT_4 (1UL << 4)
#define H7_PERIPH_15_BIT_5 (1UL << 5)
#define H7_PERIPH_15_BIT_6 (1UL << 6)
#define H7_PERIPH_15_BIT_7 (1UL << 7)
#define H7_PERIPH_15_BIT_8 (1UL << 8)
#define H7_PERIPH_15_BIT_9 (1UL << 9)
#define H7_PERIPH_15_BIT_10 (1UL << 10)
#define H7_PERIPH_15_BIT_11 (1UL << 11)
#define H7_PERIPH_15_BIT_12 (1UL << 12)
#define H7_PERIPH_15_BIT_13 (1UL << 13)
#define H7_PERIPH_15_BIT_14 (1UL << 14)
#define H7_PERIPH_15_BIT_15 (1UL << 15)
#define H7_PERIPH_15_BIT_16 (1UL << 16)
#define H7_PERIPH_15_BIT_17 (1UL << 17)
#define H7_PERIPH_15_BIT_18 (1UL << 18)
#define H7_PERIPH_15_BIT_19 (1UL << 19)
#define H7_PERIPH_15_BIT_20 (1UL << 20)
#define H7_PERIPH_15_BIT_21 (1UL << 21)
#define H7_PERIPH_15_BIT_22 (1UL << 22)
#define H7_PERIPH_15_BIT_23 (1UL << 23)
#define H7_PERIPH_15_BIT_24 (1UL << 24)
#define H7_PERIPH_15_BIT_25 (1UL << 25)
#define H7_PERIPH_15_BIT_26 (1UL << 26)
#define H7_PERIPH_15_BIT_27 (1UL << 27)
#define H7_PERIPH_15_BIT_28 (1UL << 28)
#define H7_PERIPH_15_BIT_29 (1UL << 29)
#define H7_PERIPH_15_BIT_30 (1UL << 30)
#define H7_PERIPH_15_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_16_TypeDef;
#define H7_PERIPH_16 ((H7_PERIPH_16_TypeDef *)(0x58000000UL + 16 * 0x400UL))

