RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_16_BIT_0 (1UL << 0)
#define H7_PERIPH_16_BIT_1 (1UL << 1)
#define H7_PERIPH_16_BIT_2 (1UL << 2)
#define H7_PERIPH_16_BIT_3 (1UL << 3)
#define H7_PERIPH_16_BIT_4 (1UL << 4)
#define H7_PERIPH_16_BIT_5 (1UL << 5)
#define H7_PERIPH_16_BIT_6 (1UL << 6)
#define H7_PERIPH_16_BIT_7 (1UL << 7)
#define H7_PERIPH_16_BIT_8 (1UL << 8)
#define H7_PERIPH_16_BIT_9 (1UL << 9)
#define H7_PERIPH_16_BIT_10 (1UL << 10)
#define H7_PERIPH_16_BIT_11 (1UL << 11)
#define H7_PERIPH_16_BIT_12 (1UL << 12)
#define H7_PERIPH_16_BIT_13 (1UL << 13)
#define H7_PERIPH_16_BIT_14 (1UL << 14)
#define H7_PERIPH_16_BIT_15 (1UL << 15)
#define H7_PERIPH_16_BIT_16 (1UL << 16)
#define H7_PERIPH_16_BIT_17 (1UL << 17)
#define H7_PERIPH_16_BIT_18 (1UL << 18)
#define H7_PERIPH_16_BIT_19 (1UL << 19)
#define H7_PERIPH_16_BIT_20 (1UL << 20)
#define H7_PERIPH_16_BIT_21 (1UL << 21)
#define H7_PERIPH_16_BIT_22 (1UL << 22)
#define H7_PERIPH_16_BIT_23 (1UL << 23)
#define H7_PERIPH_16_BIT_24 (1UL << 24)
#define H7_PERIPH_16_BIT_25 (1UL << 25)
#define H7_PERIPH_16_BIT_26 (1UL << 26)
#define H7_PERIPH_16_BIT_27 (1UL << 27)
#define H7_PERIPH_16_BIT_28 (1UL << 28)
#define H7_PERIPH_16_BIT_29 (1UL << 29)
#define H7_PERIPH_16_BIT_30 (1UL << 30)
#define H7_PERIPH_16_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_17_TypeDef;
#define H7_PERIPH_17 ((H7_PERIPH_17_TypeDef *)(0x58000000UL + 17 * 0x400UL))

#define H7_PERIPH_17_BIT_0 (1UL << 0)
#define H7_PERIPH_17_BIT_1 (1UL << 1)
#define H7_PERIPH_17_BIT_2 (1UL << 2)
#define H7_PERIPH_17_BIT_3 (1UL << 3)
#define H7_PERIPH_17_BIT_4 (1UL << 4)
#define H7_PERIPH_17_BIT_5 (1UL << 5)
#define H7_PERIPH_17_BIT_6 (1UL << 6)
#define H7_PERIPH_17_BIT_7 (1UL << 7)
#define H7_PERIPH_17_BIT_8 (1UL << 8)
#define H7_PERIPH_17_BIT_9 (1UL << 9)
#define H7_PERIPH_17_BIT_10 (1UL << 10)
#define H7_PERIPH_17_BIT_11 (1UL << 11)
#define H7_PERIPH_17_BIT_12 (1UL << 12)
#define H7_PERIPH_17_BIT_13 (1UL << 13)
#define H7_PERIPH_17_BIT_14 (1UL << 14)
#define H7_PERIPH_17_BIT_15 (1UL << 15)
#define H7_PERIPH_17_BIT_16 (1UL << 16)
#define H7_PERIPH_17_BIT_17 (1UL << 17)
#define H7_PERIPH_17_BIT_18 (1UL << 18)
#define H7_PERIPH_17_BIT_19 (1UL << 19)
#define H7_PERIPH_17_BIT_20 (1UL << 20)
#define H7_PERIPH_17_BIT_21 (1UL << 21)
#define H7_PERIPH_17_BIT_22 (1UL << 22)
#define H7_PERIPH_17_BIT_23 (1UL << 23)
#define H7_PERIPH_17_BIT_24 (1UL << 24)
#define H7_PERIPH_17_BIT_25 (1UL << 25)
#define H7_PERIPH_17_BIT_26 (1UL << 26)
#define H7_PERIPH_17_BIT_27 (1UL << 27)
#define H7_PERIPH_17_BIT_28 (1UL << 28)
#define H7_PERIPH_17_BIT_29 (1UL << 29)
#define H7_PERIPH_17_BIT_30 (1UL << 30)
#define H7_PERIPH_17_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_18_TypeDef;
#define H7_PERIPH_18 ((H7_PERIPH_18_TypeDef *)(0x58000000UL + 18 * 0x400UL))

#define H7_PERIPH_18_BIT_0 (1UL << 0)
#define H7_PERIPH_18_BIT_1 (1UL << 1)
#define H7_PERIPH_18_BIT_2 (1UL << 2)
#define H7_PERIPH_18_BIT_3 (1UL << 3)
#define H7_PERIPH_18_BIT_4 (1UL << 4)
#define H7_PERIPH_18_BIT_5 (1UL << 5)
#define H7_PERIPH_18_BIT_6 (1UL << 6)
#define H7_PERIPH_18_BIT_7 (1UL << 7)
#define H7_PERIPH_18_BIT_8 (1UL << 8)
#define H7_PERIPH_18_BIT_9 (1UL << 9)
#define H7_PERIPH_18_BIT_10 (1UL << 10)
#define H7_PERIPH_18_BIT_11 (1UL << 11)
#define H7_PERIPH_18_BIT_12 (1UL << 12)
#define H7_PERIPH_18_BIT_13 (1UL << 13)
#define H7_PERIPH_18_BIT_14 (1UL << 14)
#define H7_PERIPH_18_BIT_15 (1UL << 15)
#define H7_PERIPH_18_BIT_16 (1UL << 16)
#define H7_PERIPH_18_BIT_17 (1UL << 17)
#define H7_PERIPH_18_BIT_18 (1UL << 18)
#define H7_PERIPH_18_BIT_19 (1UL << 19)
#define H7_PERIPH_18_BIT_20 (1UL << 20)
#define H7_PERIPH_18_BIT_21 (1UL << 21)
#define H7_PERIPH_18_BIT_22 (1UL << 22)
#define H7_PERIPH_18_BIT_23 (1UL << 23)
#define H7_PERIPH_18_BIT_24 (1UL << 24)
#define H7_PERIPH_18_BIT_25 (1UL << 25)
#define H7_PERIPH_18_BIT_26 (1UL << 26)
#define H7_PERIPH_18_BIT_27 (1UL << 27)
#define H7_PERIPH_18_BIT_28 (1UL << 28)
#define H7_PERIPH_18_BIT_29 (1UL << 29)
#define H7_PERIPH_18_BIT_30 (1UL << 30)
#define H7_PERIPH_18_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_19_TypeDef;
#define H7_PERIPH_19 ((H7_PERIPH_19_TypeDef *)(0x58000000UL + 19 * 0x400UL))

#define H7_PERIPH_19_BIT_0 (1UL << 0)
#define H7_PERIPH_19_BIT_1 (1UL << 1)
#define H7_PERIPH_19_BIT_2 (1UL << 2)
#define H7_PERIPH_19_BIT_3 (1UL << 3)
#define H7_PERIPH_19_BIT_4 (1UL << 4)
#define H7_PERIPH_19_BIT_5 (1UL << 5)
#define H7_PERIPH_19_BIT_6 (1UL << 6)
#define H7_PERIPH_19_BIT_7 (1UL << 7)
#define H7_PERIPH_19_BIT_8 (1UL << 8)
#define H7_PERIPH_19_BIT_9 (1UL << 9)
#define H7_PERIPH_19_BIT_10 (1UL << 10)
#define H7_PERIPH_19_BIT_11 (1UL << 11)
#define H7_PERIPH_19_BIT_12 (1UL << 12)
#define H7_PERIPH_19_BIT_13 (1UL << 13)
#define H7_PERIPH_19_BIT_14 (1UL << 14)
#define H7_PERIPH_19_BIT_15 (1UL << 15)
#define H7_PERIPH_19_BIT_16 (1UL << 16)
#define H7_PERIPH_19_BIT_17 (1UL << 17)
#define H7_PERIPH_19_BIT_18 (1UL << 18)
#define H7_PERIPH_19_BIT_19 (1UL << 19)
#define H7_PERIPH_19_BIT_20 (1UL << 20)
#define H7_PERIPH_19_BIT_21 (1UL << 21)
#define H7_PERIPH_19_BIT_22 (1UL << 22)
#define H7_PERIPH_19_BIT_23 (1UL << 23)
#define H7_PERIPH_19_BIT_24 (1UL << 24)
#define H7_PERIPH_19_BIT_25 (1UL << 25)
#define H7_PERIPH_19_BIT_26 (1UL << 26)
#define H7_PERIPH_19_BIT_27 (1UL << 27)
#define H7_PERIPH_19_BIT_28 (1UL << 28)
#define H7_PERIPH_19_BIT_29 (1UL << 29)
#define H7_PERIPH_19_BIT_30 (1UL << 30)
#define H7_PERIPH_19_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_20_TypeDef;
#define H7_PERIPH_20 ((H7_PERIPH_20_TypeDef *)(0x58000000UL + 20 * 0x400UL))

