RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_20_BIT_0 (1UL << 0)
#define H7_PERIPH_20_BIT_1 (1UL << 1)
#define H7_PERIPH_20_BIT_2 (1UL << 2)
#define H7_PERIPH_20_BIT_3 (1UL << 3)
#define H7_PERIPH_20_BIT_4 (1UL << 4)
#define H7_PERIPH_20_BIT_5 (1UL << 5)
#define H7_PERIPH_20_BIT_6 (1UL << 6)
#define H7_PERIPH_20_BIT_7 (1UL << 7)
#define H7_PERIPH_20_BIT_8 (1UL << 8)
#define H7_PERIPH_20_BIT_9 (1UL << 9)
#define H7_PERIPH_20_BIT_10 (1UL << 10)
#define H7_PERIPH_20_BIT_11 (1UL << 11)
#define H7_PERIPH_20_BIT_12 (1UL << 12)
#define H7_PERIPH_20_BIT_13 (1UL << 13)
#define H7_PERIPH_20_BIT_14 (1UL << 14)
#define H7_PERIPH_20_BIT_15 (1UL << 15)
#define H7_PERIPH_20_BIT_16 (1UL << 16)
#define H7_PERIPH_20_BIT_17 (1UL << 17)
#define H7_PERIPH_20_BIT_18 (1UL << 18)
#define H7_PERIPH_20_BIT_19 (1UL << 19)
#define H7_PERIPH_20_BIT_20 (1UL << 20)
#define H7_PERIPH_20_BIT_21 (1UL << 21)
#define H7_PERIPH_20_BIT_22 (1UL << 22)
#define H7_PERIPH_20_BIT_23 (1UL << 23)
#define H7_PERIPH_20_BIT_24 (1UL << 24)
#define H7_PERIPH_20_BIT_25 (1UL << 25)
#define H7_PERIPH_20_BIT_26 (1UL << 26)
#define H7_PERIPH_20_BIT_27 (1UL << 27)
#define H7_PERIPH_20_BIT_28 (1UL << 28)
#define H7_PERIPH_20_BIT_29 (1UL << 29)
#define H7_PERIPH_20_BIT_30 (1UL << 30)
#define H7_PERIPH_20_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_21_TypeDef;
#define H7_PERIPH_21 ((H7_PERIPH_21_TypeDef *)(0x58000000UL + 21 * 0x400UL))

#define H7_PERIPH_21_BIT_0 (1UL << 0)
#define H7_PERIPH_21_BIT_1 (1UL << 1)
#define H7_PERIPH_21_BIT_2 (1UL << 2)
#define H7_PERIPH_21_BIT_3 (1UL << 3)
#define H7_PERIPH_21_BIT_4 (1UL << 4)
#define H7_PERIPH_21_BIT_5 (1UL << 5)
#define H7_PERIPH_21_BIT_6 (1UL << 6)
#define H7_PERIPH_21_BIT_7 (1UL << 7)
#define H7_PERIPH_21_BIT_8 (1UL << 8)
#define H7_PERIPH_21_BIT_9 (1UL << 9)
#define H7_PERIPH_21_BIT_10 (1UL << 10)
#define H7_PERIPH_21_BIT_11 (1UL << 11)
#define H7_PERIPH_21_BIT_12 (1UL << 12)
#define H7_PERIPH_21_BIT_13 (1UL << 13)
#define H7_PERIPH_21_BIT_14 (1UL << 14)
#define H7_PERIPH_21_BIT_15 (1UL << 15)
#define H7_PERIPH_21_BIT_16 (1UL << 16)
#define H7_PERIPH_21_BIT_17 (1UL << 17)
#define H7_PERIPH_21_BIT_18 (1UL << 18)
#define H7_PERIPH_21_BIT_19 (1UL << 19)
#define H7_PERIPH_21_BIT_20 (1UL << 20)
#define H7_PERIPH_21_BIT_21 (1UL << 21)
#define H7_PERIPH_21_BIT_22 (1UL << 22)
#define H7_PERIPH_21_BIT_23 (1UL << 23)
#define H7_PERIPH_21_BIT_24 (1UL << 24)
#define H7_PERIPH_21_BIT_25 (1UL << 25)
#define H7_PERIPH_21_BIT_26 (1UL << 26)
#define H7_PERIPH_21_BIT_27 (1UL << 27)
#define H7_PERIPH_21_BIT_28 (1UL << 28)
#define H7_PERIPH_21_BIT_29 (1UL << 29)
#define H7_PERIPH_21_BIT_30 (1UL << 30)
#define H7_PERIPH_21_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_22_TypeDef;
#define H7_PERIPH_22 ((H7_PERIPH_22_TypeDef *)(0x58000000UL + 22 * 0x400UL))

#define H7_PERIPH_22_BIT_0 (1UL << 0)
#define H7_PERIPH_22_BIT_1 (1UL << 1)
#define H7_PERIPH_22_BIT_2 (1UL << 2)
#define H7_PERIPH_22_BIT_3 (1UL << 3)
#define H7_PERIPH_22_BIT_4 (1UL << 4)
#define H7_PERIPH_22_BIT_5 (1UL << 5)
#define H7_PERIPH_22_BIT_6 (1UL << 6)
#define H7_PERIPH_22_BIT_7 (1UL << 7)
#define H7_PERIPH_22_BIT_8 (1UL << 8)
#define H7_PERIPH_22_BIT_9 (1UL << 9)
#define H7_PERIPH_22_BIT_10 (1UL << 10)
#define H7_PERIPH_22_BIT_11 (1UL << 11)
#define H7_PERIPH_22_BIT_12 (1UL << 12)
#define H7_PERIPH_22_BIT_13 (1UL << 13)
#define H7_PERIPH_22_BIT_14 (1UL << 14)
#define H7_PERIPH_22_BIT_15 (1UL << 15)
#define H7_PERIPH_22_BIT_16 (1UL << 16)
#define H7_PERIPH_22_BIT_17 (1UL << 17)
#define H7_PERIPH_22_BIT_18 (1UL << 18)
#define H7_PERIPH_22_BIT_19 (1UL << 19)
#define H7_PERIPH_22_BIT_20 (1UL << 20)
#define H7_PERIPH_22_BIT_21 (1UL << 21)
#define H7_PERIPH_22_BIT_22 (1UL << 22)
#define H7_PERIPH_22_BIT_23 (1UL << 23)
#define H7_PERIPH_22_BIT_24 (1UL << 24)
#define H7_PERIPH_22_BIT_25 (1UL << 25)
#define H7_PERIPH_22_BIT_26 (1UL << 26)
#define H7_PERIPH_22_BIT_27 (1UL << 27)
#define H7_PERIPH_22_BIT_28 (1UL << 28)
#define H7_PERIPH_22_BIT_29 (1UL << 29)
#define H7_PERIPH_22_BIT_30 (1UL << 30)
#define H7_PERIPH_22_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_23_TypeDef;
#define H7_PERIPH_23 ((H7_PERIPH_23_TypeDef *)(0x58000000UL + 23 * 0x400UL))

#define H7_PERIPH_23_BIT_0 (1UL << 0)
#define H7_PERIPH_23_BIT_1 (1UL << 1)
#define H7_PERIPH_23_BIT_2 (1UL << 2)
#define H7_PERIPH_23_BIT_3 (1UL << 3)
#define H7_PERIPH_23_BIT_4 (1UL << 4)
#define H7_PERIPH_23_BIT_5 (1UL << 5)
#define H7_PERIPH_23_BIT_6 (1UL << 6)
#define H7_PERIPH_23_BIT_7 (1UL << 7)
#define H7_PERIPH_23_BIT_8 (1UL << 8)
#define H7_PERIPH_23_BIT_9 (1UL << 9)
#define H7_PERIPH_23_BIT_10 (1UL << 10)
#define H7_PERIPH_23_BIT_11 (1UL << 11)
#define H7_PERIPH_23_BIT_12 (1UL << 12)
#define H7_PERIPH_23_BIT_13 (1UL << 13)
#define H7_PERIPH_23_BIT_14 (1UL << 14)
#define H7_PERIPH_23_BIT_15 (1UL << 15)
#define H7_PERIPH_23_BIT_16 (1UL << 16)
#define H7_PERIPH_23_BIT_17 (1UL << 17)
#define H7_PERIPH_23_BIT_18 (1UL << 18)
#define H7_PERIPH_23_BIT_19 (1UL << 19)
#define H7_PERIPH_23_BIT_20 (1UL << 20)
#define H7_PERIPH_23_BIT_21 (1UL << 21)
#define H7_PERIPH_23_BIT_22 (1UL << 22)
#define H7_PERIPH_23_BIT_23 (1UL << 23)
#define H7_PERIPH_23_BIT_24 (1UL << 24)
#define H7_PERIPH_23_BIT_25 (1UL << 25)
#define H7_PERIPH_23_BIT_26 (1UL << 26)
#define H7_PERIPH_23_BIT_27 (1UL << 27)
#define H7_PERIPH_23_BIT_28 (1UL << 28)
#define H7_PERIPH_23_BIT_29 (1UL << 29)
#define H7_PERIPH_23_BIT_30 (1UL << 30)
#define H7_PERIPH_23_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_24_TypeDef;
#define H7_PERIPH_24 ((H7_PERIPH_24_TypeDef *)(0x58000000UL + 24 * 0x400UL))

#define H7_PERIPH_24_BIT_0 (1UL << 0)
#define H7_PERIPH_24_BIT_1 (1UL << 1)
#define H7_PERIPH_24_BIT_2 (1UL << 2)
#define H7_PERIPH_24_BIT_3 (1UL << 3)
#define H7_PERIPH_24_BIT_4 (1UL << 4)
#define H7_PERIPH_24_BIT_5 (1UL << 5)
#define H7_PERIPH_24_BIT_6 (1UL << 6)
#define H7_PERIPH_24_BIT_7 (1UL << 7)
#define H7_PERIPH_24_BIT_8 (1UL << 8)
#define H7_PERIPH_24_BIT_9 (1UL << 9)
#define H7_PERIPH_24_BIT_10 (1UL << 10)
#define H7_PERIPH_24_BIT_11 (1UL << 11)
#define H7_PERIPH_24_BIT_12 (1UL << 12)
#define H7_PERIPH_24_BIT_13 (1UL << 13)
#define H7_PERIPH_24_BIT_14 (1UL << 14)
#define H7_PERIPH_24_BIT_15 (1UL << 15)
#define H7_PERIPH_24_BIT_16 (1UL << 16)
#define H7_PERIPH_24_BIT_17 (1UL << 17)
#define H7_PERIPH_24_BIT_18 (1UL << 18)
#define H7_PERIPH_24_BIT_19 (1UL << 19)
#define H7_PERIPH_24_BIT_20 (1UL << 20)
#define H7_PERIPH_24_BIT_21 (1UL << 21)
#define H7_PERIPH_24_BIT_22 (1UL << 22)
#define H7_PERIPH_24_BIT_23 (1UL << 23)
#define H7_PERIPH_24_BIT_24 (1UL << 24)
#define H7_PERIPH_24_BIT_25 (1UL << 25)
#define H7_PERIPH_24_BIT_26 (1UL << 26)
#define H7_PERIPH_24_BIT_27 (1UL << 27)
#define H7_PERIPH_24_BIT_28 (1UL << 28)
#define H7_PERIPH_24_BIT_29 (1UL << 29)
#define H7_PERIPH_24_BIT_30 (1UL << 30)
#define H7_PERIPH_24_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_25_TypeDef;
#define H7_PERIPH_25 ((H7_PERIPH_25_TypeDef *)(0x58000000UL + 25 * 0x400UL))

#define H7_PERIPH_25_BIT_0 (1UL << 0)
#define H7_PERIPH_25_BIT_1 (1UL << 1)
#define H7_PERIPH_25_BIT_2 (1UL << 2)
#define H7_PERIPH_25_BIT_3 (1UL << 3)
#define H7_PERIPH_25_BIT_4 (1UL << 4)
#define H7_PERIPH_25_BIT_5 (1UL << 5)
#define H7_PERIPH_25_BIT_6 (1UL << 6)
#define H7_PERIPH_25_BIT_7 (1UL << 7)
#define H7_PERIPH_25_BIT_8 (1UL << 8)
#define H7_PERIPH_25_BIT_9 (1UL << 9)
#define H7_PERIPH_25_BIT_10 (1UL << 10)
#define H7_PERIPH_25_BIT_11 (1UL << 11)
#define H7_PERIPH_25_BIT_12 (1UL << 12)
#define H7_PERIPH_25_BIT_13 (1UL << 13)
#define H7_PERIPH_25_BIT_14 (1UL << 14)
#define H7_PERIPH_25_BIT_15 (1UL << 15)
#define H7_PERIPH_25_BIT_16 (1UL << 16)
#define H7_PERIPH_25_BIT_17 (1UL << 17)
#define H7_PERIPH_25_BIT_18 (1UL << 18)
#define H7_PERIPH_25_BIT_19 (1UL << 19)
#define H7_PERIPH_25_BIT_20 (1UL << 20)
#define H7_PERIPH_25_BIT_21 (1UL << 21)
#define H7_PERIPH_25_BIT_22 (1UL << 22)
#define H7_PERIPH_25_BIT_23 (1UL << 23)
#define H7_PERIPH_25_BIT_24 (1UL << 24)
#define H7_PERIPH_25_BIT_25 (1UL << 25)
#define H7_PERIPH_25_BIT_26 (1UL << 26)
#define H7_PERIPH_25_BIT_27 (1UL << 27)
#define H7_PERIPH_25_BIT_28 (1UL << 28)
#define H7_PERIPH_25_BIT_29 (1UL << 29)
#define H7_PERIPH_25_BIT_30 (1UL << 30)
#define H7_PERIPH_25_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_26_TypeDef;
#define H7_PERIPH_26 ((H7_PERIPH_26_TypeDef *)(0x58000000UL + 26 * 0x400UL))

#define H7_PERIPH_26_BIT_0 (1UL << 0)
#define H7_PERIPH_26_BIT_1 (1UL << 1)
#define H7_PERIPH_26_BIT_2 (1UL << 2)
#define H7_PERIPH_26_BIT_3 (1UL << 3)
#define H7_PERIPH_26_BIT_4 (1UL << 4)
#define H7_PERIPH_26_BIT_5 (1UL << 5)
#define H7_PERIPH_26_BIT_6 (1UL << 6)
#define H7_PERIPH_26_BIT_7 (1UL << 7)
#define H7_PERIPH_26_BIT_8 (1UL << 8)
#define H7_PERIPH_26_BIT_9 (1UL << 9)
#define H7_PERIPH_26_BIT_10 (1UL << 10)
#define H7_PERIPH_26_BIT_11 (1UL << 11)
#define H7_PERIPH_26_BIT_12 (1UL << 12)
#define H7_PERIPH_26_BIT_13 (1UL << 13)
#define H7_PERIPH_26_BIT_14 (1UL << 14)
#define H7_PERIPH_26_BIT_15 (1UL << 15)
#define H7_PERIPH_26_BIT_16 (1UL << 16)
#define H7_PERIPH_26_BIT_17 (1UL << 17)
#define H7_PERIPH_26_BIT_18 (1UL << 18)
#define H7_PERIPH_26_BIT_19 (1UL << 19)
#define H7_PERIPH_26_BIT_20 (1UL << 20)
#define H7_PERIPH_26_BIT_21 (1UL << 21)
#define H7_PERIPH_26_BIT_22 (1UL << 22)
#define H7_PERIPH_26_BIT_23 (1UL << 23)
#define H7_PERIPH_26_BIT_24 (1UL << 24)
#define H7_PERIPH_26_BIT_25 (1UL << 25)
#define H7_PERIPH_26_BIT_26 (1UL << 26)
#define H7_PERIPH_26_BIT_27 (1UL << 27)
#define H7_PERIPH_26_BIT_28 (1UL << 28)
#define H7_PERIPH_26_BIT_29 (1UL << 29)
#define H7_PERIPH_26_BIT_30 (1UL << 30)
#define H7_PERIPH_26_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_27_TypeDef;
#define H7_PERIPH_27 ((H7_PERIPH_27_TypeDef *)(0x58000000UL + 27 * 0x400UL))

