RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_27_BIT_0 (1UL << 0)
#define H7_PERIPH_27_BIT_1 (1UL << 1)
#define H7_PERIPH_27_BIT_2 (1UL << 2)
#define H7_PERIPH_27_BIT_3 (1UL << 3)
#define H7_PERIPH_27_BIT_4 (1UL << 4)
#define H7_PERIPH_27_BIT_5 (1UL << 5)
#define H7_PERIPH_27_BIT_6 (1UL << 6)
#define H7_PERIPH_27_BIT_7 (1UL << 7)
#define H7_PERIPH_27_BIT_8 (1UL << 8)
#define H7_PERIPH_27_BIT_9 (1UL << 9)
#define H7_PERIPH_27_BIT_10 (1UL << 10)
#define H7_PERIPH_27_BIT_11 (1UL << 11)
#define H7_PERIPH_27_BIT_12 (1UL << 12)
#define H7_PERIPH_27_BIT_13 (1UL << 13)
#define H7_PERIPH_27_BIT_14 (1UL << 14)
#define H7_PERIPH_27_BIT_15 (1UL << 15)
#define H7_PERIPH_27_BIT_16 (1UL << 16)
#define H7_PERIPH_27_BIT_17 (1UL << 17)
#define H7_PERIPH_27_BIT_18 (1UL << 18)
#define H7_PERIPH_27_BIT_19 (1UL << 19)
#define H7_PERIPH_27_BIT_20 (1UL << 20)
#define H7_PERIPH_27_BIT_21 (1UL << 21)
#define H7_PERIPH_27_BIT_22 (1UL << 22)
#define H7_PERIPH_27_BIT_23 (1UL << 23)
#define H7_PERIPH_27_BIT_24 (1UL << 24)
#define H7_PERIPH_27_BIT_25 (1UL << 25)
#define H7_PERIPH_27_BIT_26 (1UL << 26)
#define H7_PERIPH_27_BIT_27 (1UL << 27)
#define H7_PERIPH_27_BIT_28 (1UL << 28)
#define H7_PERIPH_27_BIT_29 (1UL << 29)
#define H7_PERIPH_27_BIT_30 (1UL << 30)
#define H7_PERIPH_27_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_28_TypeDef;
#define H7_PERIPH_28 ((H7_PERIPH_28_TypeDef *)(0x58000000UL + 28 * 0x400UL))

#define H7_PERIPH_28_BIT_0 (1UL << 0)
#define H7_PERIPH_28_BIT_1 (1UL << 1)
#define H7_PERIPH_28_BIT_2 (1UL << 2)
#define H7_PERIPH_28_BIT_3 (1UL << 3)
#define H7_PERIPH_28_BIT_4 (1UL << 4)
#define H7_PERIPH_28_BIT_5 (1UL << 5)
#define H7_PERIPH_28_BIT_6 (1UL << 6)
#define H7_PERIPH_28_BIT_7 (1UL << 7)
#define H7_PERIPH_28_BIT_8 (1UL << 8)
#define H7_PERIPH_28_BIT_9 (1UL << 9)
#define H7_PERIPH_28_BIT_10 (1UL << 10)
#define H7_PERIPH_28_BIT_11 (1UL << 11)
#define H7_PERIPH_28_BIT_12 (1UL << 12)
#define H7_PERIPH_28_BIT_13 (1UL << 13)
#define H7_PERIPH_28_BIT_14 (1UL << 14)
#define H7_PERIPH_28_BIT_15 (1UL << 15)
#define H7_PERIPH_28_BIT_16 (1UL << 16)
#define H7_PERIPH_28_BIT_17 (1UL << 17)
#define H7_PERIPH_28_BIT_18 (1UL << 18)
#define H7_PERIPH_28_BIT_19 (1UL << 19)
#define H7_PERIPH_28_BIT_20 (1UL << 20)
#define H7_PERIPH_28_BIT_21 (1UL << 21)
#define H7_PERIPH_28_BIT_22 (1UL << 22)
#define H7_PERIPH_28_BIT_23 (1UL << 23)
#define H7_PERIPH_28_BIT_24 (1UL << 24)
#define H7_PERIPH_28_BIT_25 (1UL << 25)
#define H7_PERIPH_28_BIT_26 (1UL << 26)
#define H7_PERIPH_28_BIT_27 (1UL << 27)
#define H7_PERIPH_28_BIT_28 (1UL << 28)
#define H7_PERIPH_28_BIT_29 (1UL << 29)
#define H7_PERIPH_28_BIT_30 (1UL << 30)
#define H7_PERIPH_28_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_29_TypeDef;
#define H7_PERIPH_29 ((H7_PERIPH_29_TypeDef *)(0x58000000UL + 29 * 0x400UL))

#define H7_PERIPH_29_BIT_0 (1UL << 0)
#define H7_PERIPH_29_BIT_1 (1UL << 1)
#define H7_PERIPH_29_BIT_2 (1UL << 2)
#define H7_PERIPH_29_BIT_3 (1UL << 3)
#define H7_PERIPH_29_BIT_4 (1UL << 4)
#define H7_PERIPH_29_BIT_5 (1UL << 5)
#define H7_PERIPH_29_BIT_6 (1UL << 6)
#define H7_PERIPH_29_BIT_7 (1UL << 7)
#define H7_PERIPH_29_BIT_8 (1UL << 8)
#define H7_PERIPH_29_BIT_9 (1UL << 9)
#define H7_PERIPH_29_BIT_10 (1UL << 10)
#define H7_PERIPH_29_BIT_11 (1UL << 11)
#define H7_PERIPH_29_BIT_12 (1UL << 12)
#define H7_PERIPH_29_BIT_13 (1UL << 13)
#define H7_PERIPH_29_BIT_14 (1UL << 14)
#define H7_PERIPH_29_BIT_15 (1UL << 15)
#define H7_PERIPH_29_BIT_16 (1UL << 16)
#define H7_PERIPH_29_BIT_17 (1UL << 17)
#define H7_PERIPH_29_BIT_18 (1UL << 18)
#define H7_PERIPH_29_BIT_19 (1UL << 19)
#define H7_PERIPH_29_BIT_20 (1UL << 20)
#define H7_PERIPH_29_BIT_21 (1UL << 21)
#define H7_PERIPH_29_BIT_22 (1UL << 22)
#define H7_PERIPH_29_BIT_23 (1UL << 23)
#define H7_PERIPH_29_BIT_24 (1UL << 24)
#define H7_PERIPH_29_BIT_25 (1UL << 25)
#define H7_PERIPH_29_BIT_26 (1UL << 26)
#define H7_PERIPH_29_BIT_27 (1UL << 27)
#define H7_PERIPH_29_BIT_28 (1UL << 28)
#define H7_PERIPH_29_BIT_29 (1UL << 29)
#define H7_PERIPH_29_BIT_30 (1UL << 30)
#define H7_PERIPH_29_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_30_TypeDef;
#define H7_PERIPH_30 ((H7_PERIPH_30_TypeDef *)(0x58000000UL + 30 * 0x400UL))

#define H7_PERIPH_30_BIT_0 (1UL << 0)
#define H7_PERIPH_30_BIT_1 (1UL << 1)
#define H7_PERIPH_30_BIT_2 (1UL << 2)
#define H7_PERIPH_30_BIT_3 (1UL << 3)
#define H7_PERIPH_30_BIT_4 (1UL << 4)
#define H7_PERIPH_30_BIT_5 (1UL << 5)
#define H7_PERIPH_30_BIT_6 (1UL << 6)
#define H7_PERIPH_30_BIT_7 (1UL << 7)
#define H7_PERIPH_30_BIT_8 (1UL << 8)
#define H7_PERIPH_30_BIT_9 (1UL << 9)
#define H7_PERIPH_30_BIT_10 (1UL << 10)
#define H7_PERIPH_30_BIT_11 (1UL << 11)
#define H7_PERIPH_30_BIT_12 (1UL << 12)
#define H7_PERIPH_30_BIT_13 (1UL << 13)
#define H7_PERIPH_30_BIT_14 (1UL << 14)
#define H7_PERIPH_30_BIT_15 (1UL << 15)
#define H7_PERIPH_30_BIT_16 (1UL << 16)
#define H7_PERIPH_30_BIT_17 (1UL << 17)
#define H7_PERIPH_30_BIT_18 (1UL << 18)
#define H7_PERIPH_30_BIT_19 (1UL << 19)
#define H7_PERIPH_30_BIT_20 (1UL << 20)
#define H7_PERIPH_30_BIT_21 (1UL << 21)
#define H7_PERIPH_30_BIT_22 (1UL << 22)
#define H7_PERIPH_30_BIT_23 (1UL << 23)
#define H7_PERIPH_30_BIT_24 (1UL << 24)
#define H7_PERIPH_30_BIT_25 (1UL << 25)
#define H7_PERIPH_30_BIT_26 (1UL << 26)
#define H7_PERIPH_30_BIT_27 (1UL << 27)
#define H7_PERIPH_30_BIT_28 (1UL << 28)
#define H7_PERIPH_30_BIT_29 (1UL << 29)
#define H7_PERIPH_30_BIT_30 (1UL << 30)
#define H7_PERIPH_30_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_31_TypeDef;
#define H7_PERIPH_31 ((H7_PERIPH_31_TypeDef *)(0x58000000UL + 31 * 0x400UL))

#define H7_PERIPH_31_BIT_0 (1UL << 0)
#define H7_PERIPH_31_BIT_1 (1UL << 1)
#define H7_PERIPH_31_BIT_2 (1UL << 2)
#define H7_PERIPH_31_BIT_3 (1UL << 3)
#define H7_PERIPH_31_BIT_4 (1UL << 4)
#define H7_PERIPH_31_BIT_5 (1UL << 5)
#define H7_PERIPH_31_BIT_6 (1UL << 6)
#define H7_PERIPH_31_BIT_7 (1UL << 7)
#define H7_PERIPH_31_BIT_8 (1UL << 8)
#define H7_PERIPH_31_BIT_9 (1UL << 9)
#define H7_PERIPH_31_BIT_10 (1UL << 10)
#define H7_PERIPH_31_BIT_11 (1UL << 11)
#define H7_PERIPH_31_BIT_12 (1UL << 12)
#define H7_PERIPH_31_BIT_13 (1UL << 13)
#define H7_PERIPH_31_BIT_14 (1UL << 14)
#define H7_PERIPH_31_BIT_15 (1UL << 15)
#define H7_PERIPH_31_BIT_16 (1UL << 16)
#define H7_PERIPH_31_BIT_17 (1UL << 17)
#define H7_PERIPH_31_BIT_18 (1UL << 18)
#define H7_PERIPH_31_BIT_19 (1UL << 19)
#define H7_PERIPH_31_BIT_20 (1UL << 20)
#define H7_PERIPH_31_BIT_21 (1UL << 21)
#define H7_PERIPH_31_BIT_22 (1UL << 22)
#define H7_PERIPH_31_BIT_23 (1UL << 23)
#define H7_PERIPH_31_BIT_24 (1UL << 24)
#define H7_PERIPH_31_BIT_25 (1UL << 25)
#define H7_PERIPH_31_BIT_26 (1UL << 26)
#define H7_PERIPH_31_BIT_27 (1UL << 27)
#define H7_PERIPH_31_BIT_28 (1UL << 28)
#define H7_PERIPH_31_BIT_29 (1UL << 29)
#define H7_PERIPH_31_BIT_30 (1UL << 30)
#define H7_PERIPH_31_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_32_TypeDef;
#define H7_PERIPH_32 ((H7_PERIPH_32_TypeDef *)(0x58000000UL + 32 * 0x400UL))

#define H7_PERIPH_32_BIT_0 (1UL << 0)
#define H7_PERIPH_32_BIT_1 (1UL << 1)
#define H7_PERIPH_32_BIT_2 (1UL << 2)
#define H7_PERIPH_32_BIT_3 (1UL << 3)
#define H7_PERIPH_32_BIT_4 (1UL << 4)
#define H7_PERIPH_32_BIT_5 (1UL << 5)
#define H7_PERIPH_32_BIT_6 (1UL << 6)
#define H7_PERIPH_32_BIT_7 (1UL << 7)
#define H7_PERIPH_32_BIT_8 (1UL << 8)
#define H7_PERIPH_32_BIT_9 (1UL << 9)
#define H7_PERIPH_32_BIT_10 (1UL << 10)
#define H7_PERIPH_32_BIT_11 (1UL << 11)
#define H7_PERIPH_32_BIT_12 (1UL << 12)
#define H7_PERIPH_32_BIT_13 (1UL << 13)
#define H7_PERIPH_32_BIT_14 (1UL << 14)
#define H7_PERIPH_32_BIT_15 (1UL << 15)
#define H7_PERIPH_32_BIT_16 (1UL << 16)
#define H7_PERIPH_32_BIT_17 (1UL << 17)
#define H7_PERIPH_32_BIT_18 (1UL << 18)
#define H7_PERIPH_32_BIT_19 (1UL << 19)
#define H7_PERIPH_32_BIT_20 (1UL << 20)
#define H7_PERIPH_32_BIT_21 (1UL << 21)
#define H7_PERIPH_32_BIT_22 (1UL << 22)
#define H7_PERIPH_32_BIT_23 (1UL << 23)
#define H7_PERIPH_32_BIT_24 (1UL << 24)
#define H7_PERIPH_32_BIT_25 (1UL << 25)
#define H7_PERIPH_32_BIT_26 (1UL << 26)
#define H7_PERIPH_32_BIT_27 (1UL << 27)
#define H7_PERIPH_32_BIT_28 (1UL << 28)
#define H7_PERIPH_32_BIT_29 (1UL << 29)
#define H7_PERIPH_32_BIT_30 (1UL << 30)
#define H7_PERIPH_32_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_33_TypeDef;
#define H7_PERIPH_33 ((H7_PERIPH_33_TypeDef *)(0x58000000UL + 33 * 0x400UL))

#define H7_PERIPH_33_BIT_0 (1UL << 0)
#define H7_PERIPH_33_BIT_1 (1UL << 1)
#define H7_PERIPH_33_BIT_2 (1UL << 2)
#define H7_PERIPH_33_BIT_3 (1UL << 3)
#define H7_PERIPH_33_BIT_4 (1UL << 4)
#define H7_PERIPH_33_BIT_5 (1UL << 5)
#define H7_PERIPH_33_BIT_6 (1UL << 6)
#define H7_PERIPH_33_BIT_7 (1UL << 7)
#define H7_PERIPH_33_BIT_8 (1UL << 8)
#define H7_PERIPH_33_BIT_9 (1UL << 9)
#define H7_PERIPH_33_BIT_10 (1UL << 10)
#define H7_PERIPH_33_BIT_11 (1UL << 11)
#define H7_PERIPH_33_BIT_12 (1UL << 12)
#define H7_PERIPH_33_BIT_13 (1UL << 13)
#define H7_PERIPH_33_BIT_14 (1UL << 14)
#define H7_PERIPH_33_BIT_15 (1UL << 15)
#define H7_PERIPH_33_BIT_16 (1UL << 16)
#define H7_PERIPH_33_BIT_17 (1UL << 17)
#define H7_PERIPH_33_BIT_18 (1UL << 18)
#define H7_PERIPH_33_BIT_19 (1UL << 19)
#define H7_PERIPH_33_BIT_20 (1UL << 20)
#define H7_PERIPH_33_BIT_21 (1UL << 21)
#define H7_PERIPH_33_BIT_22 (1UL << 22)
#define H7_PERIPH_33_BIT_23 (1UL << 23)
#define H7_PERIPH_33_BIT_24 (1UL << 24)
#define H7_PERIPH_33_BIT_25 (1UL << 25)
#define H7_PERIPH_33_BIT_26 (1UL << 26)
#define H7_PERIPH_33_BIT_27 (1UL << 27)
#define H7_PERIPH_33_BIT_28 (1UL << 28)
#define H7_PERIPH_33_BIT_29 (1UL << 29)
#define H7_PERIPH_33_BIT_30 (1UL << 30)
#define H7_PERIPH_33_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_34_TypeDef;
#define H7_PERIPH_34 ((H7_PERIPH_34_TypeDef *)(0x58000000UL + 34 * 0x400UL))

#define H7_PERIPH_34_BIT_0 (1UL << 0)
#define H7_PERIPH_34_BIT_1 (1UL << 1)
#define H7_PERIPH_34_BIT_2 (1UL << 2)
#define H7_PERIPH_34_BIT_3 (1UL << 3)
#define H7_PERIPH_34_BIT_4 (1UL << 4)
#define H7_PERIPH_34_BIT_5 (1UL << 5)
#define H7_PERIPH_34_BIT_6 (1UL << 6)
#define H7_PERIPH_34_BIT_7 (1UL << 7)
#define H7_PERIPH_34_BIT_8 (1UL << 8)
#define H7_PERIPH_34_BIT_9 (1UL << 9)
#define H7_PERIPH_34_BIT_10 (1UL << 10)
#define H7_PERIPH_34_BIT_11 (1UL << 11)
#define H7_PERIPH_34_BIT_12 (1UL << 12)
#define H7_PERIPH_34_BIT_13 (1UL << 13)
#define H7_PERIPH_34_BIT_14 (1UL << 14)
#define H7_PERIPH_34_BIT_15 (1UL << 15)
#define H7_PERIPH_34_BIT_16 (1UL << 16)
#define H7_PERIPH_34_BIT_17 (1UL << 17)
#define H7_PERIPH_34_BIT_18 (1UL << 18)
#define H7_PERIPH_34_BIT_19 (1UL << 19)
#define H7_PERIPH_34_BIT_20 (1UL << 20)
#define H7_PERIPH_34_BIT_21 (1UL << 21)
#define H7_PERIPH_34_BIT_22 (1UL << 22)
#define H7_PERIPH_34_BIT_23 (1UL << 23)
#define H7_PERIPH_34_BIT_24 (1UL << 24)
#define H7_PERIPH_34_BIT_25 (1UL << 25)
#define H7_PERIPH_34_BIT_26 (1UL << 26)
#define H7_PERIPH_34_BIT_27 (1UL << 27)
#define H7_PERIPH_34_BIT_28 (1UL << 28)
#define H7_PERIPH_34_BIT_29 (1UL << 29)
#define H7_PERIPH_34_BIT_30 (1UL << 30)
#define H7_PERIPH_34_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_35_TypeDef;
#define H7_PERIPH_35 ((H7_PERIPH_35_TypeDef *)(0x58000000UL + 35 * 0x400UL))

#define H7_PERIPH_35_BIT_0 (1UL << 0)
#define H7_PERIPH_35_BIT_1 (1UL << 1)
#define H7_PERIPH_35_BIT_2 (1UL << 2)
#define H7_PERIPH_35_BIT_3 (1UL << 3)
#define H7_PERIPH_35_BIT_4 (1UL << 4)
#define H7_PERIPH_35_BIT_5 (1UL << 5)
#define H7_PERIPH_35_BIT_6 (1UL << 6)
#define H7_PERIPH_35_BIT_7 (1UL << 7)
#define H7_PERIPH_35_BIT_8 (1UL << 8)
#define H7_PERIPH_35_BIT_9 (1UL << 9)
#define H7_PERIPH_35_BIT_10 (1UL << 10)
#define H7_PERIPH_35_BIT_11 (1UL << 11)
#define H7_PERIPH_35_BIT_12 (1UL << 12)
#define H7_PERIPH_35_BIT_13 (1UL << 13)
#define H7_PERIPH_35_BIT_14 (1UL << 14)
#define H7_PERIPH_35_BIT_15 (1UL << 15)
#define H7_PERIPH_35_BIT_16 (1UL << 16)
#define H7_PERIPH_35_BIT_17 (1UL << 17)
#define H7_PERIPH_35_BIT_18 (1UL << 18)
#define H7_PERIPH_35_BIT_19 (1UL << 19)
#define H7_PERIPH_35_BIT_20 (1UL << 20)
#define H7_PERIPH_35_BIT_21 (1UL << 21)
#define H7_PERIPH_35_BIT_22 (1UL << 22)
#define H7_PERIPH_35_BIT_23 (1UL << 23)
#define H7_PERIPH_35_BIT_24 (1UL << 24)
#define H7_PERIPH_35_BIT_25 (1UL << 25)
#define H7_PERIPH_35_BIT_26 (1UL << 26)
#define H7_PERIPH_35_BIT_27 (1UL << 27)
#define H7_PERIPH_35_BIT_28 (1UL << 28)
#define H7_PERIPH_35_BIT_29 (1UL << 29)
#define H7_PERIPH_35_BIT_30 (1UL << 30)
#define H7_PERIPH_35_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_36_TypeDef;
#define H7_PERIPH_36 ((H7_PERIPH_36_TypeDef *)(0x58000000UL + 36 * 0x400UL))

#define H7_PERIPH_36_BIT_0 (1UL << 0)
#define H7_PERIPH_36_BIT_1 (1UL << 1)
#define H7_PERIPH_36_BIT_2 (1UL << 2)
#define H7_PERIPH_36_BIT_3 (1UL << 3)
#define H7_PERIPH_36_BIT_4 (1UL << 4)
#define H7_PERIPH_36_BIT_5 (1UL << 5)
#define H7_PERIPH_36_BIT_6 (1UL << 6)
#define H7_PERIPH_36_BIT_7 (1UL << 7)
#define H7_PERIPH_36_BIT_8 (1UL << 8)
#define H7_PERIPH_36_BIT_9 (1UL << 9)
#define H7_PERIPH_36_BIT_10 (1UL << 10)
#define H7_PERIPH_36_BIT_11 (1UL << 11)
#define H7_PERIPH_36_BIT_12 (1UL << 12)
#define H7_PERIPH_36_BIT_13 (1UL << 13)
#define H7_PERIPH_36_BIT_14 (1UL << 14)
#define H7_PERIPH_36_BIT_15 (1UL << 15)
#define H7_PERIPH_36_BIT_16 (1UL << 16)
#define H7_PERIPH_36_BIT_17 (1UL << 17)
#define H7_PERIPH_36_BIT_18 (1UL << 18)
#define H7_PERIPH_36_BIT_19 (1UL << 19)
#define H7_PERIPH_36_BIT_20 (1UL << 20)
#define H7_PERIPH_36_BIT_21 (1UL << 21)
#define H7_PERIPH_36_BIT_22 (1UL << 22)
#define H7_PERIPH_36_BIT_23 (1UL << 23)
#define H7_PERIPH_36_BIT_24 (1UL << 24)
#define H7_PERIPH_36_BIT_25 (1UL << 25)
#define H7_PERIPH_36_BIT_26 (1UL << 26)
#define H7_PERIPH_36_BIT_27 (1UL << 27)
#define H7_PERIPH_36_BIT_28 (1UL << 28)
#define H7_PERIPH_36_BIT_29 (1UL << 29)
#define H7_PERIPH_36_BIT_30 (1UL << 30)
#define H7_PERIPH_36_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_37_TypeDef;
#define H7_PERIPH_37 ((H7_PERIPH_37_TypeDef *)(0x58000000UL + 37 * 0x400UL))

