RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_37_BIT_0 (1UL << 0)
#define H7_PERIPH_37_BIT_1 (1UL << 1)
#define H7_PERIPH_37_BIT_2 (1UL << 2)
#define H7_PERIPH_37_BIT_3 (1UL << 3)
#define H7_PERIPH_37_BIT_4 (1UL << 4)
#define H7_PERIPH_37_BIT_5 (1UL << 5)
#define H7_PERIPH_37_BIT_6 (1UL << 6)
#define H7_PERIPH_37_BIT_7 (1UL << 7)
#define H7_PERIPH_37_BIT_8 (1UL << 8)
#define H7_PERIPH_37_BIT_9 (1UL << 9)
#define H7_PERIPH_37_BIT_10 (1UL << 10)
#define H7_PERIPH_37_BIT_11 (1UL << 11)
#define H7_PERIPH_37_BIT_12 (1UL << 12)
#define H7_PERIPH_37_BIT_13 (1UL << 13)
#define H7_PERIPH_37_BIT_14 (1UL << 14)
#define H7_PERIPH_37_BIT_15 (1UL << 15)
#define H7_PERIPH_37_BIT_16 (1UL << 16)
#define H7_PERIPH_37_BIT_17 (1UL << 17)
#define H7_PERIPH_37_BIT_18 (1UL << 18)
#define H7_PERIPH_37_BIT_19 (1UL << 19)
#define H7_PERIPH_37_BIT_20 (1UL << 20)
#define H7_PERIPH_37_BIT_21 (1UL << 21)
#define H7_PERIPH_37_BIT_22 (1UL << 22)
#define H7_PERIPH_37_BIT_23 (1UL << 23)
#define H7_PERIPH_37_BIT_24 (1UL << 24)
#define H7_PERIPH_37_BIT_25 (1UL << 25)
#define H7_PERIPH_37_BIT_26 (1UL << 26)
#define H7_PERIPH_37_BIT_27 (1UL << 27)
#define H7_PERIPH_37_BIT_28 (1UL << 28)
#define H7_PERIPH_37_BIT_29 (1UL << 29)
#define H7_PERIPH_37_BIT_30 (1UL << 30)
#define H7_PERIPH_37_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_38_TypeDef;
#define H7_PERIPH_38 ((H7_PERIPH_38_TypeDef *)(0x58000000UL + 38 * 0x400UL))

#define H7_PERIPH_38_BIT_0 (1UL << 0)
#define H7_PERIPH_38_BIT_1 (1UL << 1)
#define H7_PERIPH_38_BIT_2 (1UL << 2)
#define H7_PERIPH_38_BIT_3 (1UL << 3)
#define H7_PERIPH_38_BIT_4 (1UL << 4)
#define H7_PERIPH_38_BIT_5 (1UL << 5)
#define H7_PERIPH_38_BIT_6 (1UL << 6)
#define H7_PERIPH_38_BIT_7 (1UL << 7)
#define H7_PERIPH_38_BIT_8 (1UL << 8)
#define H7_PERIPH_38_BIT_9 (1UL << 9)
#define H7_PERIPH_38_BIT_10 (1UL << 10)
#define H7_PERIPH_38_BIT_11 (1UL << 11)
#define H7_PERIPH_38_BIT_12 (1UL << 12)
#define H7_PERIPH_38_BIT_13 (1UL << 13)
#define H7_PERIPH_38_BIT_14 (1UL << 14)
#define H7_PERIPH_38_BIT_15 (1UL << 15)
#define H7_PERIPH_38_BIT_16 (1UL << 16)
#define H7_PERIPH_38_BIT_17 (1UL << 17)
#define H7_PERIPH_38_BIT_18 (1UL << 18)
#define H7_PERIPH_38_BIT_19 (1UL << 19)
#define H7_PERIPH_38_BIT_20 (1UL << 20)
#define H7_PERIPH_38_BIT_21 (1UL << 21)
#define H7_PERIPH_38_BIT_22 (1UL << 22)
#define H7_PERIPH_38_BIT_23 (1UL << 23)
#define H7_PERIPH_38_BIT_24 (1UL << 24)
#define H7_PERIPH_38_BIT_25 (1UL << 25)
#define H7_PERIPH_38_BIT_26 (1UL << 26)
#define H7_PERIPH_38_BIT_27 (1UL << 27)
#define H7_PERIPH_38_BIT_28 (1UL << 28)
#define H7_PERIPH_38_BIT_29 (1UL << 29)
#define H7_PERIPH_38_BIT_30 (1UL << 30)
#define H7_PERIPH_38_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_39_TypeDef;
#define H7_PERIPH_39 ((H7_PERIPH_39_TypeDef *)(0x58000000UL + 39 * 0x400UL))

#define H7_PERIPH_39_BIT_0 (1UL << 0)
#define H7_PERIPH_39_BIT_1 (1UL << 1)
#define H7_PERIPH_39_BIT_2 (1UL << 2)
#define H7_PERIPH_39_BIT_3 (1UL << 3)
#define H7_PERIPH_39_BIT_4 (1UL << 4)
#define H7_PERIPH_39_BIT_5 (1UL << 5)
#define H7_PERIPH_39_BIT_6 (1UL << 6)
#define H7_PERIPH_39_BIT_7 (1UL << 7)
#define H7_PERIPH_39_BIT_8 (1UL << 8)
#define H7_PERIPH_39_BIT_9 (1UL << 9)
#define H7_PERIPH_39_BIT_10 (1UL << 10)
#define H7_PERIPH_39_BIT_11 (1UL << 11)
#define H7_PERIPH_39_BIT_12 (1UL << 12)
#define H7_PERIPH_39_BIT_13 (1UL << 13)
#define H7_PERIPH_39_BIT_14 (1UL << 14)
#define H7_PERIPH_39_BIT_15 (1UL << 15)
#define H7_PERIPH_39_BIT_16 (1UL << 16)
#define H7_PERIPH_39_BIT_17 (1UL << 17)
#define H7_PERIPH_39_BIT_18 (1UL << 18)
#define H7_PERIPH_39_BIT_19 (1UL << 19)
#define H7_PERIPH_39_BIT_20 (1UL << 20)
#define H7_PERIPH_39_BIT_21 (1UL << 21)
#define H7_PERIPH_39_BIT_22 (1UL << 22)
#define H7_PERIPH_39_BIT_23 (1UL << 23)
#define H7_PERIPH_39_BIT_24 (1UL << 24)
#define H7_PERIPH_39_BIT_25 (1UL << 25)
#define H7_PERIPH_39_BIT_26 (1UL << 26)
#define H7_PERIPH_39_BIT_27 (1UL << 27)
#define H7_PERIPH_39_BIT_28 (1UL << 28)
#define H7_PERIPH_39_BIT_29 (1UL << 29)
#define H7_PERIPH_39_BIT_30 (1UL << 30)
#define H7_PERIPH_39_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_40_TypeDef;
#define H7_PERIPH_40 ((H7_PERIPH_40_TypeDef *)(0x58000000UL + 40 * 0x400UL))

#define H7_PERIPH_40_BIT_0 (1UL << 0)
#define H7_PERIPH_40_BIT_1 (1UL << 1)
#define H7_PERIPH_40_BIT_2 (1UL << 2)
#define H7_PERIPH_40_BIT_3 (1UL << 3)
#define H7_PERIPH_40_BIT_4 (1UL << 4)
#define H7_PERIPH_40_BIT_5 (1UL << 5)
#define H7_PERIPH_40_BIT_6 (1UL << 6)
#define H7_PERIPH_40_BIT_7 (1UL << 7)
#define H7_PERIPH_40_BIT_8 (1UL << 8)
#define H7_PERIPH_40_BIT_9 (1UL << 9)
#define H7_PERIPH_40_BIT_10 (1UL << 10)
#define H7_PERIPH_40_BIT_11 (1UL << 11)
#define H7_PERIPH_40_BIT_12 (1UL << 12)
#define H7_PERIPH_40_BIT_13 (1UL << 13)
#define H7_PERIPH_40_BIT_14 (1UL << 14)
#define H7_PERIPH_40_BIT_15 (1UL << 15)
#define H7_PERIPH_40_BIT_16 (1UL << 16)
#define H7_PERIPH_40_BIT_17 (1UL << 17)
#define H7_PERIPH_40_BIT_18 (1UL << 18)
#define H7_PERIPH_40_BIT_19 (1UL << 19)
#define H7_PERIPH_40_BIT_20 (1UL << 20)
#define H7_PERIPH_40_BIT_21 (1UL << 21)
#define H7_PERIPH_40_BIT_22 (1UL << 22)
#define H7_PERIPH_40_BIT_23 (1UL << 23)
#define H7_PERIPH_40_BIT_24 (1UL << 24)
#define H7_PERIPH_40_BIT_25 (1UL << 25)
#define H7_PERIPH_40_BIT_26 (1UL << 26)
#define H7_PERIPH_40_BIT_27 (1UL << 27)
#define H7_PERIPH_40_BIT_28 (1UL << 28)
#define H7_PERIPH_40_BIT_29 (1UL << 29)
#define H7_PERIPH_40_BIT_30 (1UL << 30)
#define H7_PERIPH_40_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_41_TypeDef;
#define H7_PERIPH_41 ((H7_PERIPH_41_TypeDef *)(0x58000000UL + 41 * 0x400UL))

#define H7_PERIPH_41_BIT_0 (1UL << 0)
#define H7_PERIPH_41_BIT_1 (1UL << 1)
#define H7_PERIPH_41_BIT_2 (1UL << 2)
#define H7_PERIPH_41_BIT_3 (1UL << 3)
#define H7_PERIPH_41_BIT_4 (1UL << 4)
#define H7_PERIPH_41_BIT_5 (1UL << 5)
#define H7_PERIPH_41_BIT_6 (1UL << 6)
#define H7_PERIPH_41_BIT_7 (1UL << 7)
#define H7_PERIPH_41_BIT_8 (1UL << 8)
#define H7_PERIPH_41_BIT_9 (1UL << 9)
#define H7_PERIPH_41_BIT_10 (1UL << 10)
#define H7_PERIPH_41_BIT_11 (1UL << 11)
#define H7_PERIPH_41_BIT_12 (1UL << 12)
#define H7_PERIPH_41_BIT_13 (1UL << 13)
#define H7_PERIPH_41_BIT_14 (1UL << 14)
#define H7_PERIPH_41_BIT_15 (1UL << 15)
#define H7_PERIPH_41_BIT_16 (1UL << 16)
#define H7_PERIPH_41_BIT_17 (1UL << 17)
#define H7_PERIPH_41_BIT_18 (1UL << 18)
#define H7_PERIPH_41_BIT_19 (1UL << 19)
#define H7_PERIPH_41_BIT_20 (1UL << 20)
#define H7_PERIPH_41_BIT_21 (1UL << 21)
#define H7_PERIPH_41_BIT_22 (1UL << 22)
#define H7_PERIPH_41_BIT_23 (1UL << 23)
#define H7_PERIPH_41_BIT_24 (1UL << 24)
#define H7_PERIPH_41_BIT_25 (1UL << 25)
#define H7_PERIPH_41_BIT_26 (1UL << 26)
#define H7_PERIPH_41_BIT_27 (1UL << 27)
#define H7_PERIPH_41_BIT_28 (1UL << 28)
#define H7_PERIPH_41_BIT_29 (1UL << 29)
#define H7_PERIPH_41_BIT_30 (1UL << 30)
#define H7_PERIPH_41_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_42_TypeDef;
#define H7_PERIPH_42 ((H7_PERIPH_42_TypeDef *)(0x58000000UL + 42 * 0x400UL))

