RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_42_BIT_0 (1UL << 0)
#define H7_PERIPH_42_BIT_1 (1UL << 1)
#define H7_PERIPH_42_BIT_2 (1UL << 2)
#define H7_PERIPH_42_BIT_3 (1UL << 3)
#define H7_PERIPH_42_BIT_4 (1UL << 4)
#define H7_PERIPH_42_BIT_5 (1UL << 5)
#define H7_PERIPH_42_BIT_6 (1UL << 6)
#define H7_PERIPH_42_BIT_7 (1UL << 7)
#define H7_PERIPH_42_BIT_8 (1UL << 8)
#define H7_PERIPH_42_BIT_9 (1UL << 9)
#define H7_PERIPH_42_BIT_10 (1UL << 10)
#define H7_PERIPH_42_BIT_11 (1UL << 11)
#define H7_PERIPH_42_BIT_12 (1UL << 12)
#define H7_PERIPH_42_BIT_13 (1UL << 13)
#define H7_PERIPH_42_BIT_14 (1UL << 14)
#define H7_PERIPH_42_BIT_15 (1UL << 15)
#define H7_PERIPH_42_BIT_16 (1UL << 16)
#define H7_PERIPH_42_BIT_17 (1UL << 17)
#define H7_PERIPH_42_BIT_18 (1UL << 18)
#define H7_PERIPH_42_BIT_19 (1UL << 19)
#define H7_PERIPH_42_BIT_20 (1UL << 20)
#define H7_PERIPH_42_BIT_21 (1UL << 21)
#define H7_PERIPH_42_BIT_22 (1UL << 22)
#define H7_PERIPH_42_BIT_23 (1UL << 23)
#define H7_PERIPH_42_BIT_24 (1UL << 24)
#define H7_PERIPH_42_BIT_25 (1UL << 25)
#define H7_PERIPH_42_BIT_26 (1UL << 26)
#define H7_PERIPH_42_BIT_27 (1UL << 27)
#define H7_PERIPH_42_BIT_28 (1UL << 28)
#define H7_PERIPH_42_BIT_29 (1UL << 29)
#define H7_PERIPH_42_BIT_30 (1UL << 30)
#define H7_PERIPH_42_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_43_TypeDef;
#define H7_PERIPH_43 ((H7_PERIPH_43_TypeDef *)(0x58000000UL + 43 * 0x400UL))

#define H7_PERIPH_43_BIT_0 (1UL << 0)
#define H7_PERIPH_43_BIT_1 (1UL << 1)
#define H7_PERIPH_43_BIT_2 (1UL << 2)
#define H7_PERIPH_43_BIT_3 (1UL << 3)
#define H7_PERIPH_43_BIT_4 (1UL << 4)
#define H7_PERIPH_43_BIT_5 (1UL << 5)
#define H7_PERIPH_43_BIT_6 (1UL << 6)
#define H7_PERIPH_43_BIT_7 (1UL << 7)
#define H7_PERIPH_43_BIT_8 (1UL << 8)
#define H7_PERIPH_43_BIT_9 (1UL << 9)
#define H7_PERIPH_43_BIT_10 (1UL << 10)
#define H7_PERIPH_43_BIT_11 (1UL << 11)
#define H7_PERIPH_43_BIT_12 (1UL << 12)
#define H7_PERIPH_43_BIT_13 (1UL << 13)
#define H7_PERIPH_43_BIT_14 (1UL << 14)
#define H7_PERIPH_43_BIT_15 (1UL << 15)
#define H7_PERIPH_43_BIT_16 (1UL << 16)
#define H7_PERIPH_43_BIT_17 (1UL << 17)
#define H7_PERIPH_43_BIT_18 (1UL << 18)
#define H7_PERIPH_43_BIT_19 (1UL << 19)
#define H7_PERIPH_43_BIT_20 (1UL << 20)
#define H7_PERIPH_43_BIT_21 (1UL << 21)
#define H7_PERIPH_43_BIT_22 (1UL << 22)
#define H7_PERIPH_43_BIT_23 (1UL << 23)
#define H7_PERIPH_43_BIT_24 (1UL << 24)
#define H7_PERIPH_43_BIT_25 (1UL << 25)
#define H7_PERIPH_43_BIT_26 (1UL << 26)
#define H7_PERIPH_43_BIT_27 (1UL << 27)
#define H7_PERIPH_43_BIT_28 (1UL << 28)
#define H7_PERIPH_43_BIT_29 (1UL << 29)
#define H7_PERIPH_43_BIT_30 (1UL << 30)
#define H7_PERIPH_43_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_44_TypeDef;
#define H7_PERIPH_44 ((H7_PERIPH_44_TypeDef *)(0x58000000UL + 44 * 0x400UL))

#define H7_PERIPH_44_BIT_0 (1UL << 0)
#define H7_PERIPH_44_BIT_1 (1UL << 1)
#define H7_PERIPH_44_BIT_2 (1UL << 2)
#define H7_PERIPH_44_BIT_3 (1UL << 3)
#define H7_PERIPH_44_BIT_4 (1UL << 4)
#define H7_PERIPH_44_BIT_5 (1UL << 5)
#define H7_PERIPH_44_BIT_6 (1UL << 6)
#define H7_PERIPH_44_BIT_7 (1UL << 7)
#define H7_PERIPH_44_BIT_8 (1UL << 8)
#define H7_PERIPH_44_BIT_9 (1UL << 9)
#define H7_PERIPH_44_BIT_10 (1UL << 10)
#define H7_PERIPH_44_BIT_11 (1UL << 11)
#define H7_PERIPH_44_BIT_12 (1UL << 12)
#define H7_PERIPH_44_BIT_13 (1UL << 13)
#define H7_PERIPH_44_BIT_14 (1UL << 14)
#define H7_PERIPH_44_BIT_15 (1UL << 15)
#define H7_PERIPH_44_BIT_16 (1UL << 16)
#define H7_PERIPH_44_BIT_17 (1UL << 17)
#define H7_PERIPH_44_BIT_18 (1UL << 18)
#define H7_PERIPH_44_BIT_19 (1UL << 19)
#define H7_PERIPH_44_BIT_20 (1UL << 20)
#define H7_PERIPH_44_BIT_21 (1UL << 21)
#define H7_PERIPH_44_BIT_22 (1UL << 22)
#define H7_PERIPH_44_BIT_23 (1UL << 23)
#define H7_PERIPH_44_BIT_24 (1UL << 24)
#define H7_PERIPH_44_BIT_25 (1UL << 25)
#define H7_PERIPH_44_BIT_26 (1UL << 26)
#define H7_PERIPH_44_BIT_27 (1UL << 27)
#define H7_PERIPH_44_BIT_28 (1UL << 28)
#define H7_PERIPH_44_BIT_29 (1UL << 29)
#define H7_PERIPH_44_BIT_30 (1UL << 30)
#define H7_PERIPH_44_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_45_TypeDef;
#define H7_PERIPH_45 ((H7_PERIPH_45_TypeDef *)(0x58000000UL + 45 * 0x400UL))

#define H7_PERIPH_45_BIT_0 (1UL << 0)
#define H7_PERIPH_45_BIT_1 (1UL << 1)
#define H7_PERIPH_45_BIT_2 (1UL << 2)
#define H7_PERIPH_45_BIT_3 (1UL << 3)
#define H7_PERIPH_45_BIT_4 (1UL << 4)
#define H7_PERIPH_45_BIT_5 (1UL << 5)
#define H7_PERIPH_45_BIT_6 (1UL << 6)
#define H7_PERIPH_45_BIT_7 (1UL << 7)
#define H7_PERIPH_45_BIT_8 (1UL << 8)
#define H7_PERIPH_45_BIT_9 (1UL << 9)
#define H7_PERIPH_45_BIT_10 (1UL << 10)
#define H7_PERIPH_45_BIT_11 (1UL << 11)
#define H7_PERIPH_45_BIT_12 (1UL << 12)
#define H7_PERIPH_45_BIT_13 (1UL << 13)
#define H7_PERIPH_45_BIT_14 (1UL << 14)
#define H7_PERIPH_45_BIT_15 (1UL << 15)
#define H7_PERIPH_45_BIT_16 (1UL << 16)
#define H7_PERIPH_45_BIT_17 (1UL << 17)
#define H7_PERIPH_45_BIT_18 (1UL << 18)
#define H7_PERIPH_45_BIT_19 (1UL << 19)
#define H7_PERIPH_45_BIT_20 (1UL << 20)
#define H7_PERIPH_45_BIT_21 (1UL << 21)
#define H7_PERIPH_45_BIT_22 (1UL << 22)
#define H7_PERIPH_45_BIT_23 (1UL << 23)
#define H7_PERIPH_45_BIT_24 (1UL << 24)
#define H7_PERIPH_45_BIT_25 (1UL << 25)
#define H7_PERIPH_45_BIT_26 (1UL << 26)
#define H7_PERIPH_45_BIT_27 (1UL << 27)
#define H7_PERIPH_45_BIT_28 (1UL << 28)
#define H7_PERIPH_45_BIT_29 (1UL << 29)
#define H7_PERIPH_45_BIT_30 (1UL << 30)
#define H7_PERIPH_45_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_46_TypeDef;
#define H7_PERIPH_46 ((H7_PERIPH_46_TypeDef *)(0x58000000UL + 46 * 0x400UL))

#define H7_PERIPH_46_BIT_0 (1UL << 0)
#define H7_PERIPH_46_BIT_1 (1UL << 1)
#define H7_PERIPH_46_BIT_2 (1UL << 2)
#define H7_PERIPH_46_BIT_3 (1UL << 3)
#define H7_PERIPH_46_BIT_4 (1UL << 4)
#define H7_PERIPH_46_BIT_5 (1UL << 5)
#define H7_PERIPH_46_BIT_6 (1UL << 6)
#define H7_PERIPH_46_BIT_7 (1UL << 7)
#define H7_PERIPH_46_BIT_8 (1UL << 8)
#define H7_PERIPH_46_BIT_9 (1UL << 9)
#define H7_PERIPH_46_BIT_10 (1UL << 10)
#define H7_PERIPH_46_BIT_11 (1UL << 11)
#define H7_PERIPH_46_BIT_12 (1UL << 12)
#define H7_PERIPH_46_BIT_13 (1UL << 13)
#define H7_PERIPH_46_BIT_14 (1UL << 14)
#define H7_PERIPH_46_BIT_15 (1UL << 15)
#define H7_PERIPH_46_BIT_16 (1UL << 16)
#define H7_PERIPH_46_BIT_17 (1UL << 17)
#define H7_PERIPH_46_BIT_18 (1UL << 18)
#define H7_PERIPH_46_BIT_19 (1UL << 19)
#define H7_PERIPH_46_BIT_20 (1UL << 20)
#define H7_PERIPH_46_BIT_21 (1UL << 21)
#define H7_PERIPH_46_BIT_22 (1UL << 22)
#define H7_PERIPH_46_BIT_23 (1UL << 23)
#define H7_PERIPH_46_BIT_24 (1UL << 24)
#define H7_PERIPH_46_BIT_25 (1UL << 25)
#define H7_PERIPH_46_BIT_26 (1UL << 26)
#define H7_PERIPH_46_BIT_27 (1UL << 27)
#define H7_PERIPH_46_BIT_28 (1UL << 28)
#define H7_PERIPH_46_BIT_29 (1UL << 29)
#define H7_PERIPH_46_BIT_30 (1UL << 30)
#define H7_PERIPH_46_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_47_TypeDef;
#define H7_PERIPH_47 ((H7_PERIPH_47_TypeDef *)(0x58000000UL + 47 * 0x400UL))

#define H7_PERIPH_47_BIT_0 (1UL << 0)
#define H7_PERIPH_47_BIT_1 (1UL << 1)
#define H7_PERIPH_47_BIT_2 (1UL << 2)
#define H7_PERIPH_47_BIT_3 (1UL << 3)
#define H7_PERIPH_47_BIT_4 (1UL << 4)
#define H7_PERIPH_47_BIT_5 (1UL << 5)
#define H7_PERIPH_47_BIT_6 (1UL << 6)
#define H7_PERIPH_47_BIT_7 (1UL << 7)
#define H7_PERIPH_47_BIT_8 (1UL << 8)
#define H7_PERIPH_47_BIT_9 (1UL << 9)
#define H7_PERIPH_47_BIT_10 (1UL << 10)
#define H7_PERIPH_47_BIT_11 (1UL << 11)
#define H7_PERIPH_47_BIT_12 (1UL << 12)
#define H7_PERIPH_47_BIT_13 (1UL << 13)
#define H7_PERIPH_47_BIT_14 (1UL << 14)
#define H7_PERIPH_47_BIT_15 (1UL << 15)
#define H7_PERIPH_47_BIT_16 (1UL << 16)
#define H7_PERIPH_47_BIT_17 (1UL << 17)
#define H7_PERIPH_47_BIT_18 (1UL << 18)
#define H7_PERIPH_47_BIT_19 (1UL << 19)
#define H7_PERIPH_47_BIT_20 (1UL << 20)
#define H7_PERIPH_47_BIT_21 (1UL << 21)
#define H7_PERIPH_47_BIT_22 (1UL << 22)
#define H7_PERIPH_47_BIT_23 (1UL << 23)
#define H7_PERIPH_47_BIT_24 (1UL << 24)
#define H7_PERIPH_47_BIT_25 (1UL << 25)
#define H7_PERIPH_47_BIT_26 (1UL << 26)
#define H7_PERIPH_47_BIT_27 (1UL << 27)
#define H7_PERIPH_47_BIT_28 (1UL << 28)
#define H7_PERIPH_47_BIT_29 (1UL << 29)
#define H7_PERIPH_47_BIT_30 (1UL << 30)
#define H7_PERIPH_47_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_48_TypeDef;
#define H7_PERIPH_48 ((H7_PERIPH_48_TypeDef *)(0x58000000UL + 48 * 0x400UL))

#define H7_PERIPH_48_BIT_0 (1UL << 0)
#define H7_PERIPH_48_BIT_1 (1UL << 1)
#define H7_PERIPH_48_BIT_2 (1UL << 2)
#define H7_PERIPH_48_BIT_3 (1UL << 3)
#define H7_PERIPH_48_BIT_4 (1UL << 4)
#define H7_PERIPH_48_BIT_5 (1UL << 5)
#define H7_PERIPH_48_BIT_6 (1UL << 6)
#define H7_PERIPH_48_BIT_7 (1UL << 7)
#define H7_PERIPH_48_BIT_8 (1UL << 8)
#define H7_PERIPH_48_BIT_9 (1UL << 9)
#define H7_PERIPH_48_BIT_10 (1UL << 10)
#define H7_PERIPH_48_BIT_11 (1UL << 11)
#define H7_PERIPH_48_BIT_12 (1UL << 12)
#define H7_PERIPH_48_BIT_13 (1UL << 13)
#define H7_PERIPH_48_BIT_14 (1UL << 14)
#define H7_PERIPH_48_BIT_15 (1UL << 15)
#define H7_PERIPH_48_BIT_16 (1UL << 16)
#define H7_PERIPH_48_BIT_17 (1UL << 17)
#define H7_PERIPH_48_BIT_18 (1UL << 18)
#define H7_PERIPH_48_BIT_19 (1UL << 19)
#define H7_PERIPH_48_BIT_20 (1UL << 20)
#define H7_PERIPH_48_BIT_21 (1UL << 21)
#define H7_PERIPH_48_BIT_22 (1UL << 22)
#define H7_PERIPH_48_BIT_23 (1UL << 23)
#define H7_PERIPH_48_BIT_24 (1UL << 24)
#define H7_PERIPH_48_BIT_25 (1UL << 25)
#define H7_PERIPH_48_BIT_26 (1UL << 26)
#define H7_PERIPH_48_BIT_27 (1UL << 27)
#define H7_PERIPH_48_BIT_28 (1UL << 28)
#define H7_PERIPH_48_BIT_29 (1UL << 29)
#define H7_PERIPH_48_BIT_30 (1UL << 30)
#define H7_PERIPH_48_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_49_TypeDef;
#define H7_PERIPH_49 ((H7_PERIPH_49_TypeDef *)(0x58000000UL + 49 * 0x400UL))

#define H7_PERIPH_49_BIT_0 (1UL << 0)
#define H7_PERIPH_49_BIT_1 (1UL << 1)
#define H7_PERIPH_49_BIT_2 (1UL << 2)
#define H7_PERIPH_49_BIT_3 (1UL << 3)
#define H7_PERIPH_49_BIT_4 (1UL << 4)
#define H7_PERIPH_49_BIT_5 (1UL << 5)
#define H7_PERIPH_49_BIT_6 (1UL << 6)
#define H7_PERIPH_49_BIT_7 (1UL << 7)
#define H7_PERIPH_49_BIT_8 (1UL << 8)
#define H7_PERIPH_49_BIT_9 (1UL << 9)
#define H7_PERIPH_49_BIT_10 (1UL << 10)
#define H7_PERIPH_49_BIT_11 (1UL << 11)
#define H7_PERIPH_49_BIT_12 (1UL << 12)
#define H7_PERIPH_49_BIT_13 (1UL << 13)
#define H7_PERIPH_49_BIT_14 (1UL << 14)
#define H7_PERIPH_49_BIT_15 (1UL << 15)
#define H7_PERIPH_49_BIT_16 (1UL << 16)
#define H7_PERIPH_49_BIT_17 (1UL << 17)
#define H7_PERIPH_49_BIT_18 (1UL << 18)
#define H7_PERIPH_49_BIT_19 (1UL << 19)
#define H7_PERIPH_49_BIT_20 (1UL << 20)
#define H7_PERIPH_49_BIT_21 (1UL << 21)
#define H7_PERIPH_49_BIT_22 (1UL << 22)
#define H7_PERIPH_49_BIT_23 (1UL << 23)
#define H7_PERIPH_49_BIT_24 (1UL << 24)
#define H7_PERIPH_49_BIT_25 (1UL << 25)
#define H7_PERIPH_49_BIT_26 (1UL << 26)
#define H7_PERIPH_49_BIT_27 (1UL << 27)
#define H7_PERIPH_49_BIT_28 (1UL << 28)
#define H7_PERIPH_49_BIT_29 (1UL << 29)
#define H7_PERIPH_49_BIT_30 (1UL << 30)
#define H7_PERIPH_49_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_50_TypeDef;
#define H7_PERIPH_50 ((H7_PERIPH_50_TypeDef *)(0x58000000UL + 50 * 0x400UL))

#define H7_PERIPH_50_BIT_0 (1UL << 0)
#define H7_PERIPH_50_BIT_1 (1UL << 1)
#define H7_PERIPH_50_BIT_2 (1UL << 2)
#define H7_PERIPH_50_BIT_3 (1UL << 3)
#define H7_PERIPH_50_BIT_4 (1UL << 4)
#define H7_PERIPH_50_BIT_5 (1UL << 5)
#define H7_PERIPH_50_BIT_6 (1UL << 6)
#define H7_PERIPH_50_BIT_7 (1UL << 7)
#define H7_PERIPH_50_BIT_8 (1UL << 8)
#define H7_PERIPH_50_BIT_9 (1UL << 9)
#define H7_PERIPH_50_BIT_10 (1UL << 10)
#define H7_PERIPH_50_BIT_11 (1UL << 11)
#define H7_PERIPH_50_BIT_12 (1UL << 12)
#define H7_PERIPH_50_BIT_13 (1UL << 13)
#define H7_PERIPH_50_BIT_14 (1UL << 14)
#define H7_PERIPH_50_BIT_15 (1UL << 15)
#define H7_PERIPH_50_BIT_16 (1UL << 16)
#define H7_PERIPH_50_BIT_17 (1UL << 17)
#define H7_PERIPH_50_BIT_18 (1UL << 18)
#define H7_PERIPH_50_BIT_19 (1UL << 19)
#define H7_PERIPH_50_BIT_20 (1UL << 20)
#define H7_PERIPH_50_BIT_21 (1UL << 21)
#define H7_PERIPH_50_BIT_22 (1UL << 22)
#define H7_PERIPH_50_BIT_23 (1UL << 23)
#define H7_PERIPH_50_BIT_24 (1UL << 24)
#define H7_PERIPH_50_BIT_25 (1UL << 25)
#define H7_PERIPH_50_BIT_26 (1UL << 26)
#define H7_PERIPH_50_BIT_27 (1UL << 27)
#define H7_PERIPH_50_BIT_28 (1UL << 28)
#define H7_PERIPH_50_BIT_29 (1UL << 29)
#define H7_PERIPH_50_BIT_30 (1UL << 30)
#define H7_PERIPH_50_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_51_TypeDef;
#define H7_PERIPH_51 ((H7_PERIPH_51_TypeDef *)(0x58000000UL + 51 * 0x400UL))

#define H7_PERIPH_51_BIT_0 (1UL << 0)
#define H7_PERIPH_51_BIT_1 (1UL << 1)
#define H7_PERIPH_51_BIT_2 (1UL << 2)
#define H7_PERIPH_51_BIT_3 (1UL << 3)
#define H7_PERIPH_51_BIT_4 (1UL << 4)
#define H7_PERIPH_51_BIT_5 (1UL << 5)
#define H7_PERIPH_51_BIT_6 (1UL << 6)
#define H7_PERIPH_51_BIT_7 (1UL << 7)
#define H7_PERIPH_51_BIT_8 (1UL << 8)
#define H7_PERIPH_51_BIT_9 (1UL << 9)
#define H7_PERIPH_51_BIT_10 (1UL << 10)
#define H7_PERIPH_51_BIT_11 (1UL << 11)
#define H7_PERIPH_51_BIT_12 (1UL << 12)
#define H7_PERIPH_51_BIT_13 (1UL << 13)
#define H7_PERIPH_51_BIT_14 (1UL << 14)
#define H7_PERIPH_51_BIT_15 (1UL << 15)
#define H7_PERIPH_51_BIT_16 (1UL << 16)
#define H7_PERIPH_51_BIT_17 (1UL << 17)
#define H7_PERIPH_51_BIT_18 (1UL << 18)
#define H7_PERIPH_51_BIT_19 (1UL << 19)
#define H7_PERIPH_51_BIT_20 (1UL << 20)
#define H7_PERIPH_51_BIT_21 (1UL << 21)
#define H7_PERIPH_51_BIT_22 (1UL << 22)
#define H7_PERIPH_51_BIT_23 (1UL << 23)
#define H7_PERIPH_51_BIT_24 (1UL << 24)
#define H7_PERIPH_51_BIT_25 (1UL << 25)
#define H7_PERIPH_51_BIT_26 (1UL << 26)
#define H7_PERIPH_51_BIT_27 (1UL << 27)
#define H7_PERIPH_51_BIT_28 (1UL << 28)
#define H7_PERIPH_51_BIT_29 (1UL << 29)
#define H7_PERIPH_51_BIT_30 (1UL << 30)
#define H7_PERIPH_51_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_52_TypeDef;
#define H7_PERIPH_52 ((H7_PERIPH_52_TypeDef *)(0x58000000UL + 52 * 0x400UL))

