RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_52_BIT_0 (1UL << 0)
#define H7_PERIPH_52_BIT_1 (1UL << 1)
#define H7_PERIPH_52_BIT_2 (1UL << 2)
#define H7_PERIPH_52_BIT_3 (1UL << 3)
#define H7_PERIPH_52_BIT_4 (1UL << 4)
#define H7_PERIPH_52_BIT_5 (1UL << 5)
#define H7_PERIPH_52_BIT_6 (1UL << 6)
#define H7_PERIPH_52_BIT_7 (1UL << 7)
#define H7_PERIPH_52_BIT_8 (1UL << 8)
#define H7_PERIPH_52_BIT_9 (1UL << 9)
#define H7_PERIPH_52_BIT_10 (1UL << 10)
#define H7_PERIPH_52_BIT_11 (1UL << 11)
#define H7_PERIPH_52_BIT_12 (1UL << 12)
#define H7_PERIPH_52_BIT_13 (1UL << 13)
#define H7_PERIPH_52_BIT_14 (1UL << 14)
#define H7_PERIPH_52_BIT_15 (1UL << 15)
#define H7_PERIPH_52_BIT_16 (1UL << 16)
#define H7_PERIPH_52_BIT_17 (1UL << 17)
#define H7_PERIPH_52_BIT_18 (1UL << 18)
#define H7_PERIPH_52_BIT_19 (1UL << 19)
#define H7_PERIPH_52_BIT_20 (1UL << 20)
#define H7_PERIPH_52_BIT_21 (1UL << 21)
#define H7_PERIPH_52_BIT_22 (1UL << 22)
#define H7_PERIPH_52_BIT_23 (1UL << 23)
#define H7_PERIPH_52_BIT_24 (1UL << 24)
#define H7_PERIPH_52_BIT_25 (1UL << 25)
#define H7_PERIPH_52_BIT_26 (1UL << 26)
#define H7_PERIPH_52_BIT_27 (1UL << 27)
#define H7_PERIPH_52_BIT_28 (1UL << 28)
#define H7_PERIPH_52_BIT_29 (1UL << 29)
#define H7_PERIPH_52_BIT_30 (1UL << 30)
#define H7_PERIPH_52_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_53_TypeDef;
#define H7_PERIPH_53 ((H7_PERIPH_53_TypeDef *)(0x58000000UL + 53 * 0x400UL))

#define H7_PERIPH_53_BIT_0 (1UL << 0)
#define H7_PERIPH_53_BIT_1 (1UL << 1)
#define H7_PERIPH_53_BIT_2 (1UL << 2)
#define H7_PERIPH_53_BIT_3 (1UL << 3)
#define H7_PERIPH_53_BIT_4 (1UL << 4)
#define H7_PERIPH_53_BIT_5 (1UL << 5)
#define H7_PERIPH_53_BIT_6 (1UL << 6)
#define H7_PERIPH_53_BIT_7 (1UL << 7)
#define H7_PERIPH_53_BIT_8 (1UL << 8)
#define H7_PERIPH_53_BIT_9 (1UL << 9)
#define H7_PERIPH_53_BIT_10 (1UL << 10)
#define H7_PERIPH_53_BIT_11 (1UL << 11)
#define H7_PERIPH_53_BIT_12 (1UL << 12)
#define H7_PERIPH_53_BIT_13 (1UL << 13)
#define H7_PERIPH_53_BIT_14 (1UL << 14)
#define H7_PERIPH_53_BIT_15 (1UL << 15)
#define H7_PERIPH_53_BIT_16 (1UL << 16)
#define H7_PERIPH_53_BIT_17 (1UL << 17)
#define H7_PERIPH_53_BIT_18 (1UL << 18)
#define H7_PERIPH_53_BIT_19 (1UL << 19)
#define H7_PERIPH_53_BIT_20 (1UL << 20)
#define H7_PERIPH_53_BIT_21 (1UL << 21)
#define H7_PERIPH_53_BIT_22 (1UL << 22)
#define H7_PERIPH_53_BIT_23 (1UL << 23)
#define H7_PERIPH_53_BIT_24 (1UL << 24)
#define H7_PERIPH_53_BIT_25 (1UL << 25)
#define H7_PERIPH_53_BIT_26 (1UL << 26)
#define H7_PERIPH_53_BIT_27 (1UL << 27)
#define H7_PERIPH_53_BIT_28 (1UL << 28)
#define H7_PERIPH_53_BIT_29 (1UL << 29)
#define H7_PERIPH_53_BIT_30 (1UL << 30)
#define H7_PERIPH_53_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_54_TypeDef;
#define H7_PERIPH_54 ((H7_PERIPH_54_TypeDef *)(0x58000000UL + 54 * 0x400UL))

#define H7_PERIPH_54_BIT_0 (1UL << 0)
#define H7_PERIPH_54_BIT_1 (1UL << 1)
#define H7_PERIPH_54_BIT_2 (1UL << 2)
#define H7_PERIPH_54_BIT_3 (1UL << 3)
#define H7_PERIPH_54_BIT_4 (1UL << 4)
#define H7_PERIPH_54_BIT_5 (1UL << 5)
#define H7_PERIPH_54_BIT_6 (1UL << 6)
#define H7_PERIPH_54_BIT_7 (1UL << 7)
#define H7_PERIPH_54_BIT_8 (1UL << 8)
#define H7_PERIPH_54_BIT_9 (1UL << 9)
#define H7_PERIPH_54_BIT_10 (1UL << 10)
#define H7_PERIPH_54_BIT_11 (1UL << 11)
#define H7_PERIPH_54_BIT_12 (1UL << 12)
#define H7_PERIPH_54_BIT_13 (1UL << 13)
#define H7_PERIPH_54_BIT_14 (1UL << 14)
#define H7_PERIPH_54_BIT_15 (1UL << 15)
#define H7_PERIPH_54_BIT_16 (1UL << 16)
#define H7_PERIPH_54_BIT_17 (1UL << 17)
#define H7_PERIPH_54_BIT_18 (1UL << 18)
#define H7_PERIPH_54_BIT_19 (1UL << 19)
#define H7_PERIPH_54_BIT_20 (1UL << 20)
#define H7_PERIPH_54_BIT_21 (1UL << 21)
#define H7_PERIPH_54_BIT_22 (1UL << 22)
#define H7_PERIPH_54_BIT_23 (1UL << 23)
#define H7_PERIPH_54_BIT_24 (1UL << 24)
#define H7_PERIPH_54_BIT_25 (1UL << 25)
#define H7_PERIPH_54_BIT_26 (1UL << 26)
#define H7_PERIPH_54_BIT_27 (1UL << 27)
#define H7_PERIPH_54_BIT_28 (1UL << 28)
#define H7_PERIPH_54_BIT_29 (1UL << 29)
#define H7_PERIPH_54_BIT_30 (1UL << 30)
#define H7_PERIPH_54_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_55_TypeDef;
#define H7_PERIPH_55 ((H7_PERIPH_55_TypeDef *)(0x58000000UL + 55 * 0x400UL))

#define H7_PERIPH_55_BIT_0 (1UL << 0)
#define H7_PERIPH_55_BIT_1 (1UL << 1)
#define H7_PERIPH_55_BIT_2 (1UL << 2)
#define H7_PERIPH_55_BIT_3 (1UL << 3)
#define H7_PERIPH_55_BIT_4 (1UL << 4)
#define H7_PERIPH_55_BIT_5 (1UL << 5)
#define H7_PERIPH_55_BIT_6 (1UL << 6)
#define H7_PERIPH_55_BIT_7 (1UL << 7)
#define H7_PERIPH_55_BIT_8 (1UL << 8)
#define H7_PERIPH_55_BIT_9 (1UL << 9)
#define H7_PERIPH_55_BIT_10 (1UL << 10)
#define H7_PERIPH_55_BIT_11 (1UL << 11)
#define H7_PERIPH_55_BIT_12 (1UL << 12)
#define H7_PERIPH_55_BIT_13 (1UL << 13)
#define H7_PERIPH_55_BIT_14 (1UL << 14)
#define H7_PERIPH_55_BIT_15 (1UL << 15)
#define H7_PERIPH_55_BIT_16 (1UL << 16)
#define H7_PERIPH_55_BIT_17 (1UL << 17)
#define H7_PERIPH_55_BIT_18 (1UL << 18)
#define H7_PERIPH_55_BIT_19 (1UL << 19)
#define H7_PERIPH_55_BIT_20 (1UL << 20)
#define H7_PERIPH_55_BIT_21 (1UL << 21)
#define H7_PERIPH_55_BIT_22 (1UL << 22)
#define H7_PERIPH_55_BIT_23 (1UL << 23)
#define H7_PERIPH_55_BIT_24 (1UL << 24)
#define H7_PERIPH_55_BIT_25 (1UL << 25)
#define H7_PERIPH_55_BIT_26 (1UL << 26)
#define H7_PERIPH_55_BIT_27 (1UL << 27)
#define H7_PERIPH_55_BIT_28 (1UL << 28)
#define H7_PERIPH_55_BIT_29 (1UL << 29)
#define H7_PERIPH_55_BIT_30 (1UL << 30)
#define H7_PERIPH_55_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_56_TypeDef;
#define H7_PERIPH_56 ((H7_PERIPH_56_TypeDef *)(0x58000000UL + 56 * 0x400UL))

#define H7_PERIPH_56_BIT_0 (1UL << 0)
#define H7_PERIPH_56_BIT_1 (1UL << 1)
#define H7_PERIPH_56_BIT_2 (1UL << 2)
#define H7_PERIPH_56_BIT_3 (1UL << 3)
#define H7_PERIPH_56_BIT_4 (1UL << 4)
#define H7_PERIPH_56_BIT_5 (1UL << 5)
#define H7_PERIPH_56_BIT_6 (1UL << 6)
#define H7_PERIPH_56_BIT_7 (1UL << 7)
#define H7_PERIPH_56_BIT_8 (1UL << 8)
#define H7_PERIPH_56_BIT_9 (1UL << 9)
#define H7_PERIPH_56_BIT_10 (1UL << 10)
#define H7_PERIPH_56_BIT_11 (1UL << 11)
#define H7_PERIPH_56_BIT_12 (1UL << 12)
#define H7_PERIPH_56_BIT_13 (1UL << 13)
#define H7_PERIPH_56_BIT_14 (1UL << 14)
#define H7_PERIPH_56_BIT_15 (1UL << 15)
#define H7_PERIPH_56_BIT_16 (1UL << 16)
#define H7_PERIPH_56_BIT_17 (1UL << 17)
#define H7_PERIPH_56_BIT_18 (1UL << 18)
#define H7_PERIPH_56_BIT_19 (1UL << 19)
#define H7_PERIPH_56_BIT_20 (1UL << 20)
#define H7_PERIPH_56_BIT_21 (1UL << 21)
#define H7_PERIPH_56_BIT_22 (1UL << 22)
#define H7_PERIPH_56_BIT_23 (1UL << 23)
#define H7_PERIPH_56_BIT_24 (1UL << 24)
#define H7_PERIPH_56_BIT_25 (1UL << 25)
#define H7_PERIPH_56_BIT_26 (1UL << 26)
#define H7_PERIPH_56_BIT_27 (1UL << 27)
#define H7_PERIPH_56_BIT_28 (1UL << 28)
#define H7_PERIPH_56_BIT_29 (1UL << 29)
#define H7_PERIPH_56_BIT_30 (1UL << 30)
#define H7_PERIPH_56_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_57_TypeDef;
#define H7_PERIPH_57 ((H7_PERIPH_57_TypeDef *)(0x58000000UL + 57 * 0x400UL))

#define H7_PERIPH_57_BIT_0 (1UL << 0)
#define H7_PERIPH_57_BIT_1 (1UL << 1)
#define H7_PERIPH_57_BIT_2 (1UL << 2)
#define H7_PERIPH_57_BIT_3 (1UL << 3)
#define H7_PERIPH_57_BIT_4 (1UL << 4)
#define H7_PERIPH_57_BIT_5 (1UL << 5)
#define H7_PERIPH_57_BIT_6 (1UL << 6)
#define H7_PERIPH_57_BIT_7 (1UL << 7)
#define H7_PERIPH_57_BIT_8 (1UL << 8)
#define H7_PERIPH_57_BIT_9 (1UL << 9)
#define H7_PERIPH_57_BIT_10 (1UL << 10)
#define H7_PERIPH_57_BIT_11 (1UL << 11)
#define H7_PERIPH_57_BIT_12 (1UL << 12)
#define H7_PERIPH_57_BIT_13 (1UL << 13)
#define H7_PERIPH_57_BIT_14 (1UL << 14)
#define H7_PERIPH_57_BIT_15 (1UL << 15)
#define H7_PERIPH_57_BIT_16 (1UL << 16)
#define H7_PERIPH_57_BIT_17 (1UL << 17)
#define H7_PERIPH_57_BIT_18 (1UL << 18)
#define H7_PERIPH_57_BIT_19 (1UL << 19)
#define H7_PERIPH_57_BIT_20 (1UL << 20)
#define H7_PERIPH_57_BIT_21 (1UL << 21)
#define H7_PERIPH_57_BIT_22 (1UL << 22)
#define H7_PERIPH_57_BIT_23 (1UL << 23)
#define H7_PERIPH_57_BIT_24 (1UL << 24)
#define H7_PERIPH_57_BIT_25 (1UL << 25)
#define H7_PERIPH_57_BIT_26 (1UL << 26)
#define H7_PERIPH_57_BIT_27 (1UL << 27)
#define H7_PERIPH_57_BIT_28 (1UL << 28)
#define H7_PERIPH_57_BIT_29 (1UL << 29)
#define H7_PERIPH_57_BIT_30 (1UL << 30)
#define H7_PERIPH_57_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_58_TypeDef;
#define H7_PERIPH_58 ((H7_PERIPH_58_TypeDef *)(0x58000000UL + 58 * 0x400UL))

#define H7_PERIPH_58_BIT_0 (1UL << 0)
#define H7_PERIPH_58_BIT_1 (1UL << 1)
#define H7_PERIPH_58_BIT_2 (1UL << 2)
#define H7_PERIPH_58_BIT_3 (1UL << 3)
#define H7_PERIPH_58_BIT_4 (1UL << 4)
#define H7_PERIPH_58_BIT_5 (1UL << 5)
#define H7_PERIPH_58_BIT_6 (1UL << 6)
#define H7_PERIPH_58_BIT_7 (1UL << 7)
#define H7_PERIPH_58_BIT_8 (1UL << 8)
#define H7_PERIPH_58_BIT_9 (1UL << 9)
#define H7_PERIPH_58_BIT_10 (1UL << 10)
#define H7_PERIPH_58_BIT_11 (1UL << 11)
#define H7_PERIPH_58_BIT_12 (1UL << 12)
#define H7_PERIPH_58_BIT_13 (1UL << 13)
#define H7_PERIPH_58_BIT_14 (1UL << 14)
#define H7_PERIPH_58_BIT_15 (1UL << 15)
#define H7_PERIPH_58_BIT_16 (1UL << 16)
#define H7_PERIPH_58_BIT_17 (1UL << 17)
#define H7_PERIPH_58_BIT_18 (1UL << 18)
#define H7_PERIPH_58_BIT_19 (1UL << 19)
#define H7_PERIPH_58_BIT_20 (1UL << 20)
#define H7_PERIPH_58_BIT_21 (1UL << 21)
#define H7_PERIPH_58_BIT_22 (1UL << 22)
#define H7_PERIPH_58_BIT_23 (1UL << 23)
#define H7_PERIPH_58_BIT_24 (1UL << 24)
#define H7_PERIPH_58_BIT_25 (1UL << 25)
#define H7_PERIPH_58_BIT_26 (1UL << 26)
#define H7_PERIPH_58_BIT_27 (1UL << 27)
#define H7_PERIPH_58_BIT_28 (1UL << 28)
#define H7_PERIPH_58_BIT_29 (1UL << 29)
#define H7_PERIPH_58_BIT_30 (1UL << 30)
#define H7_PERIPH_58_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_59_TypeDef;
#define H7_PERIPH_59 ((H7_PERIPH_59_TypeDef *)(0x58000000UL + 59 * 0x400UL))

#define H7_PERIPH_59_BIT_0 (1UL << 0)
#define H7_PERIPH_59_BIT_1 (1UL << 1)
#define H7_PERIPH_59_BIT_2 (1UL << 2)
#define H7_PERIPH_59_BIT_3 (1UL << 3)
#define H7_PERIPH_59_BIT_4 (1UL << 4)
#define H7_PERIPH_59_BIT_5 (1UL << 5)
#define H7_PERIPH_59_BIT_6 (1UL << 6)
#define H7_PERIPH_59_BIT_7 (1UL << 7)
#define H7_PERIPH_59_BIT_8 (1UL << 8)
#define H7_PERIPH_59_BIT_9 (1UL << 9)
#define H7_PERIPH_59_BIT_10 (1UL << 10)
#define H7_PERIPH_59_BIT_11 (1UL << 11)
#define H7_PERIPH_59_BIT_12 (1UL << 12)
#define H7_PERIPH_59_BIT_13 (1UL << 13)
#define H7_PERIPH_59_BIT_14 (1UL << 14)
#define H7_PERIPH_59_BIT_15 (1UL << 15)
#define H7_PERIPH_59_BIT_16 (1UL << 16)
#define H7_PERIPH_59_BIT_17 (1UL << 17)
#define H7_PERIPH_59_BIT_18 (1UL << 18)
#define H7_PERIPH_59_BIT_19 (1UL << 19)
#define H7_PERIPH_59_BIT_20 (1UL << 20)
#define H7_PERIPH_59_BIT_21 (1UL << 21)
#define H7_PERIPH_59_BIT_22 (1UL << 22)
#define H7_PERIPH_59_BIT_23 (1UL << 23)
#define H7_PERIPH_59_BIT_24 (1UL << 24)
#define H7_PERIPH_59_BIT_25 (1UL << 25)
#define H7_PERIPH_59_BIT_26 (1UL << 26)
#define H7_PERIPH_59_BIT_27 (1UL << 27)
#define H7_PERIPH_59_BIT_28 (1UL << 28)
#define H7_PERIPH_59_BIT_29 (1UL << 29)
#define H7_PERIPH_59_BIT_30 (1UL << 30)
#define H7_PERIPH_59_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_60_TypeDef;
#define H7_PERIPH_60 ((H7_PERIPH_60_TypeDef *)(0x58000000UL + 60 * 0x400UL))

#define H7_PERIPH_60_BIT_0 (1UL << 0)
#define H7_PERIPH_60_BIT_1 (1UL << 1)
#define H7_PERIPH_60_BIT_2 (1UL << 2)
#define H7_PERIPH_60_BIT_3 (1UL << 3)
#define H7_PERIPH_60_BIT_4 (1UL << 4)
#define H7_PERIPH_60_BIT_5 (1UL << 5)
#define H7_PERIPH_60_BIT_6 (1UL << 6)
#define H7_PERIPH_60_BIT_7 (1UL << 7)
#define H7_PERIPH_60_BIT_8 (1UL << 8)
#define H7_PERIPH_60_BIT_9 (1UL << 9)
#define H7_PERIPH_60_BIT_10 (1UL << 10)
#define H7_PERIPH_60_BIT_11 (1UL << 11)
#define H7_PERIPH_60_BIT_12 (1UL << 12)
#define H7_PERIPH_60_BIT_13 (1UL << 13)
#define H7_PERIPH_60_BIT_14 (1UL << 14)
#define H7_PERIPH_60_BIT_15 (1UL << 15)
#define H7_PERIPH_60_BIT_16 (1UL << 16)
#define H7_PERIPH_60_BIT_17 (1UL << 17)
#define H7_PERIPH_60_BIT_18 (1UL << 18)
#define H7_PERIPH_60_BIT_19 (1UL << 19)
#define H7_PERIPH_60_BIT_20 (1UL << 20)
#define H7_PERIPH_60_BIT_21 (1UL << 21)
#define H7_PERIPH_60_BIT_22 (1UL << 22)
#define H7_PERIPH_60_BIT_23 (1UL << 23)
#define H7_PERIPH_60_BIT_24 (1UL << 24)
#define H7_PERIPH_60_BIT_25 (1UL << 25)
#define H7_PERIPH_60_BIT_26 (1UL << 26)
#define H7_PERIPH_60_BIT_27 (1UL << 27)
#define H7_PERIPH_60_BIT_28 (1UL << 28)
#define H7_PERIPH_60_BIT_29 (1UL << 29)
#define H7_PERIPH_60_BIT_30 (1UL << 30)
#define H7_PERIPH_60_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_61_TypeDef;
#define H7_PERIPH_61 ((H7_PERIPH_61_TypeDef *)(0x58000000UL + 61 * 0x400UL))

#define H7_PERIPH_61_BIT_0 (1UL << 0)
#define H7_PERIPH_61_BIT_1 (1UL << 1)
#define H7_PERIPH_61_BIT_2 (1UL << 2)
#define H7_PERIPH_61_BIT_3 (1UL << 3)
#define H7_PERIPH_61_BIT_4 (1UL << 4)
#define H7_PERIPH_61_BIT_5 (1UL << 5)
#define H7_PERIPH_61_BIT_6 (1UL << 6)
#define H7_PERIPH_61_BIT_7 (1UL << 7)
#define H7_PERIPH_61_BIT_8 (1UL << 8)
#define H7_PERIPH_61_BIT_9 (1UL << 9)
#define H7_PERIPH_61_BIT_10 (1UL << 10)
#define H7_PERIPH_61_BIT_11 (1UL << 11)
#define H7_PERIPH_61_BIT_12 (1UL << 12)
#define H7_PERIPH_61_BIT_13 (1UL << 13)
#define H7_PERIPH_61_BIT_14 (1UL << 14)
#define H7_PERIPH_61_BIT_15 (1UL << 15)
#define H7_PERIPH_61_BIT_16 (1UL << 16)
#define H7_PERIPH_61_BIT_17 (1UL << 17)
#define H7_PERIPH_61_BIT_18 (1UL << 18)
#define H7_PERIPH_61_BIT_19 (1UL << 19)
#define H7_PERIPH_61_BIT_20 (1UL << 20)
#define H7_PERIPH_61_BIT_21 (1UL << 21)
#define H7_PERIPH_61_BIT_22 (1UL << 22)
#define H7_PERIPH_61_BIT_23 (1UL << 23)
#define H7_PERIPH_61_BIT_24 (1UL << 24)
#define H7_PERIPH_61_BIT_25 (1UL << 25)
#define H7_PERIPH_61_BIT_26 (1UL << 26)
#define H7_PERIPH_61_BIT_27 (1UL << 27)
#define H7_PERIPH_61_BIT_28 (1UL << 28)
#define H7_PERIPH_61_BIT_29 (1UL << 29)
#define H7_PERIPH_61_BIT_30 (1UL << 30)
#define H7_PERIPH_61_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_62_TypeDef;
#define H7_PERIPH_62 ((H7_PERIPH_62_TypeDef *)(0x58000000UL + 62 * 0x400UL))

#define H7_PERIPH_62_BIT_0 (1UL << 0)
#define H7_PERIPH_62_BIT_1 (1UL << 1)
#define H7_PERIPH_62_BIT_2 (1UL << 2)
#define H7_PERIPH_62_BIT_3 (1UL << 3)
#define H7_PERIPH_62_BIT_4 (1UL << 4)
#define H7_PERIPH_62_BIT_5 (1UL << 5)
#define H7_PERIPH_62_BIT_6 (1UL << 6)
#define H7_PERIPH_62_BIT_7 (1UL << 7)
#define H7_PERIPH_62_BIT_8 (1UL << 8)
#define H7_PERIPH_62_BIT_9 (1UL << 9)
#define H7_PERIPH_62_BIT_10 (1UL << 10)
#define H7_PERIPH_62_BIT_11 (1UL << 11)
#define H7_PERIPH_62_BIT_12 (1UL << 12)
#define H7_PERIPH_62_BIT_13 (1UL << 13)
#define H7_PERIPH_62_BIT_14 (1UL << 14)
#define H7_PERIPH_62_BIT_15 (1UL << 15)
#define H7_PERIPH_62_BIT_16 (1UL << 16)
#define H7_PERIPH_62_BIT_17 (1UL << 17)
#define H7_PERIPH_62_BIT_18 (1UL << 18)
#define H7_PERIPH_62_BIT_19 (1UL << 19)
#define H7_PERIPH_62_BIT_20 (1UL << 20)
#define H7_PERIPH_62_BIT_21 (1UL << 21)
#define H7_PERIPH_62_BIT_22 (1UL << 22)
#define H7_PERIPH_62_BIT_23 (1UL << 23)
#define H7_PERIPH_62_BIT_24 (1UL << 24)
#define H7_PERIPH_62_BIT_25 (1UL << 25)
#define H7_PERIPH_62_BIT_26 (1UL << 26)
#define H7_PERIPH_62_BIT_27 (1UL << 27)
#define H7_PERIPH_62_BIT_28 (1UL << 28)
#define H7_PERIPH_62_BIT_29 (1UL << 29)
#define H7_PERIPH_62_BIT_30 (1UL << 30)
#define H7_PERIPH_62_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_63_TypeDef;
#define H7_PERIPH_63 ((H7_PERIPH_63_TypeDef *)(0x58000000UL + 63 * 0x400UL))

