RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_63_BIT_0 (1UL << 0)
#define H7_PERIPH_63_BIT_1 (1UL << 1)
#define H7_PERIPH_63_BIT_2 (1UL << 2)
#define H7_PERIPH_63_BIT_3 (1UL << 3)
#define H7_PERIPH_63_BIT_4 (1UL << 4)
#define H7_PERIPH_63_BIT_5 (1UL << 5)
#define H7_PERIPH_63_BIT_6 (1UL << 6)
#define H7_PERIPH_63_BIT_7 (1UL << 7)
#define H7_PERIPH_63_BIT_8 (1UL << 8)
#define H7_PERIPH_63_BIT_9 (1UL << 9)
#define H7_PERIPH_63_BIT_10 (1UL << 10)
#define H7_PERIPH_63_BIT_11 (1UL << 11)
#define H7_PERIPH_63_BIT_12 (1UL << 12)
#define H7_PERIPH_63_BIT_13 (1UL << 13)
#define H7_PERIPH_63_BIT_14 (1UL << 14)
#define H7_PERIPH_63_BIT_15 (1UL << 15)
#define H7_PERIPH_63_BIT_16 (1UL << 16)
#define H7_PERIPH_63_BIT_17 (1UL << 17)
#define H7_PERIPH_63_BIT_18 (1UL << 18)
#define H7_PERIPH_63_BIT_19 (1UL << 19)
#define H7_PERIPH_63_BIT_20 (1UL << 20)
#define H7_PERIPH_63_BIT_21 (1UL << 21)
#define H7_PERIPH_63_BIT_22 (1UL << 22)
#define H7_PERIPH_63_BIT_23 (1UL << 23)
#define H7_PERIPH_63_BIT_24 (1UL << 24)
#define H7_PERIPH_63_BIT_25 (1UL << 25)
#define H7_PERIPH_63_BIT_26 (1UL << 26)
#define H7_PERIPH_63_BIT_27 (1UL << 27)
#define H7_PERIPH_63_BIT_28 (1UL << 28)
#define H7_PERIPH_63_BIT_29 (1UL << 29)
#define H7_PERIPH_63_BIT_30 (1UL << 30)
#define H7_PERIPH_63_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_64_TypeDef;
#define H7_PERIPH_64 ((H7_PERIPH_64_TypeDef *)(0x58000000UL + 64 * 0x400UL))

#define H7_PERIPH_64_BIT_0 (1UL << 0)
#define H7_PERIPH_64_BIT_1 (1UL << 1)
#define H7_PERIPH_64_BIT_2 (1UL << 2)
#define H7_PERIPH_64_BIT_3 (1UL << 3)
#define H7_PERIPH_64_BIT_4 (1UL << 4)
#define H7_PERIPH_64_BIT_5 (1UL << 5)
#define H7_PERIPH_64_BIT_6 (1UL << 6)
#define H7_PERIPH_64_BIT_7 (1UL << 7)
#define H7_PERIPH_64_BIT_8 (1UL << 8)
#define H7_PERIPH_64_BIT_9 (1UL << 9)
#define H7_PERIPH_64_BIT_10 (1UL << 10)
#define H7_PERIPH_64_BIT_11 (1UL << 11)
#define H7_PERIPH_64_BIT_12 (1UL << 12)
#define H7_PERIPH_64_BIT_13 (1UL << 13)
#define H7_PERIPH_64_BIT_14 (1UL << 14)
#define H7_PERIPH_64_BIT_15 (1UL << 15)
#define H7_PERIPH_64_BIT_16 (1UL << 16)
#define H7_PERIPH_64_BIT_17 (1UL << 17)
#define H7_PERIPH_64_BIT_18 (1UL << 18)
#define H7_PERIPH_64_BIT_19 (1UL << 19)
#define H7_PERIPH_64_BIT_20 (1UL << 20)
#define H7_PERIPH_64_BIT_21 (1UL << 21)
#define H7_PERIPH_64_BIT_22 (1UL << 22)
#define H7_PERIPH_64_BIT_23 (1UL << 23)
#define H7_PERIPH_64_BIT_24 (1UL << 24)
#define H7_PERIPH_64_BIT_25 (1UL << 25)
#define H7_PERIPH_64_BIT_26 (1UL << 26)
#define H7_PERIPH_64_BIT_27 (1UL << 27)
#define H7_PERIPH_64_BIT_28 (1UL << 28)
#define H7_PERIPH_64_BIT_29 (1UL << 29)
#define H7_PERIPH_64_BIT_30 (1UL << 30)
#define H7_PERIPH_64_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_65_TypeDef;
#define H7_PERIPH_65 ((H7_PERIPH_65_TypeDef *)(0x58000000UL + 65 * 0x400UL))

#define H7_PERIPH_65_BIT_0 (1UL << 0)
#define H7_PERIPH_65_BIT_1 (1UL << 1)
#define H7_PERIPH_65_BIT_2 (1UL << 2)
#define H7_PERIPH_65_BIT_3 (1UL << 3)
#define H7_PERIPH_65_BIT_4 (1UL << 4)
#define H7_PERIPH_65_BIT_5 (1UL << 5)
#define H7_PERIPH_65_BIT_6 (1UL << 6)
#define H7_PERIPH_65_BIT_7 (1UL << 7)
#define H7_PERIPH_65_BIT_8 (1UL << 8)
#define H7_PERIPH_65_BIT_9 (1UL << 9)
#define H7_PERIPH_65_BIT_10 (1UL << 10)
#define H7_PERIPH_65_BIT_11 (1UL << 11)
#define H7_PERIPH_65_BIT_12 (1UL << 12)
#define H7_PERIPH_65_BIT_13 (1UL << 13)
#define H7_PERIPH_65_BIT_14 (1UL << 14)
#define H7_PERIPH_65_BIT_15 (1UL << 15)
#define H7_PERIPH_65_BIT_16 (1UL << 16)
#define H7_PERIPH_65_BIT_17 (1UL << 17)
#define H7_PERIPH_65_BIT_18 (1UL << 18)
#define H7_PERIPH_65_BIT_19 (1UL << 19)
#define H7_PERIPH_65_BIT_20 (1UL << 20)
#define H7_PERIPH_65_BIT_21 (1UL << 21)
#define H7_PERIPH_65_BIT_22 (1UL << 22)
#define H7_PERIPH_65_BIT_23 (1UL << 23)
#define H7_PERIPH_65_BIT_24 (1UL << 24)
#define H7_PERIPH_65_BIT_25 (1UL << 25)
#define H7_PERIPH_65_BIT_26 (1UL << 26)
#define H7_PERIPH_65_BIT_27 (1UL << 27)
#define H7_PERIPH_65_BIT_28 (1UL << 28)
#define H7_PERIPH_65_BIT_29 (1UL << 29)
#define H7_PERIPH_65_BIT_30 (1UL << 30)
#define H7_PERIPH_65_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_66_TypeDef;
#define H7_PERIPH_66 ((H7_PERIPH_66_TypeDef *)(0x58000000UL + 66 * 0x400UL))

#define H7_PERIPH_66_BIT_0 (1UL << 0)
#define H7_PERIPH_66_BIT_1 (1UL << 1)
#define H7_PERIPH_66_BIT_2 (1UL << 2)
#define H7_PERIPH_66_BIT_3 (1UL << 3)
#define H7_PERIPH_66_BIT_4 (1UL << 4)
#define H7_PERIPH_66_BIT_5 (1UL << 5)
#define H7_PERIPH_66_BIT_6 (1UL << 6)
#define H7_PERIPH_66_BIT_7 (1UL << 7)
#define H7_PERIPH_66_BIT_8 (1UL << 8)
#define H7_PERIPH_66_BIT_9 (1UL << 9)
#define H7_PERIPH_66_BIT_10 (1UL << 10)
#define H7_PERIPH_66_BIT_11 (1UL << 11)
#define H7_PERIPH_66_BIT_12 (1UL << 12)
#define H7_PERIPH_66_BIT_13 (1UL << 13)
#define H7_PERIPH_66_BIT_14 (1UL << 14)
#define H7_PERIPH_66_BIT_15 (1UL << 15)
#define H7_PERIPH_66_BIT_16 (1UL << 16)
#define H7_PERIPH_66_BIT_17 (1UL << 17)
#define H7_PERIPH_66_BIT_18 (1UL << 18)
#define H7_PERIPH_66_BIT_19 (1UL << 19)
#define H7_PERIPH_66_BIT_20 (1UL << 20)
#define H7_PERIPH_66_BIT_21 (1UL << 21)
#define H7_PERIPH_66_BIT_22 (1UL << 22)
#define H7_PERIPH_66_BIT_23 (1UL << 23)
#define H7_PERIPH_66_BIT_24 (1UL << 24)
#define H7_PERIPH_66_BIT_25 (1UL << 25)
#define H7_PERIPH_66_BIT_26 (1UL << 26)
#define H7_PERIPH_66_BIT_27 (1UL << 27)
#define H7_PERIPH_66_BIT_28 (1UL << 28)
#define H7_PERIPH_66_BIT_29 (1UL << 29)
#define H7_PERIPH_66_BIT_30 (1UL << 30)
#define H7_PERIPH_66_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_67_TypeDef;
#define H7_PERIPH_67 ((H7_PERIPH_67_TypeDef *)(0x58000000UL + 67 * 0x400UL))

#define H7_PERIPH_67_BIT_0 (1UL << 0)
#define H7_PERIPH_67_BIT_1 (1UL << 1)
#define H7_PERIPH_67_BIT_2 (1UL << 2)
#define H7_PERIPH_67_BIT_3 (1UL << 3)
#define H7_PERIPH_67_BIT_4 (1UL << 4)
#define H7_PERIPH_67_BIT_5 (1UL << 5)
#define H7_PERIPH_67_BIT_6 (1UL << 6)
#define H7_PERIPH_67_BIT_7 (1UL << 7)
#define H7_PERIPH_67_BIT_8 (1UL << 8)
#define H7_PERIPH_67_BIT_9 (1UL << 9)
#define H7_PERIPH_67_BIT_10 (1UL << 10)
#define H7_PERIPH_67_BIT_11 (1UL << 11)
#define H7_PERIPH_67_BIT_12 (1UL << 12)
#define H7_PERIPH_67_BIT_13 (1UL << 13)
#define H7_PERIPH_67_BIT_14 (1UL << 14)
#define H7_PERIPH_67_BIT_15 (1UL << 15)
#define H7_PERIPH_67_BIT_16 (1UL << 16)
#define H7_PERIPH_67_BIT_17 (1UL << 17)
#define H7_PERIPH_67_BIT_18 (1UL << 18)
#define H7_PERIPH_67_BIT_19 (1UL << 19)
#define H7_PERIPH_67_BIT_20 (1UL << 20)
#define H7_PERIPH_67_BIT_21 (1UL << 21)
#define H7_PERIPH_67_BIT_22 (1UL << 22)
#define H7_PERIPH_67_BIT_23 (1UL << 23)
#define H7_PERIPH_67_BIT_24 (1UL << 24)
#define H7_PERIPH_67_BIT_25 (1UL << 25)
#define H7_PERIPH_67_BIT_26 (1UL << 26)
#define H7_PERIPH_67_BIT_27 (1UL << 27)
#define H7_PERIPH_67_BIT_28 (1UL << 28)
#define H7_PERIPH_67_BIT_29 (1UL << 29)
#define H7_PERIPH_67_BIT_30 (1UL << 30)
#define H7_PERIPH_67_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_68_TypeDef;
#define H7_PERIPH_68 ((H7_PERIPH_68_TypeDef *)(0x58000000UL + 68 * 0x400UL))

#define H7_PERIPH_68_BIT_0 (1UL << 0)
#define H7_PERIPH_68_BIT_1 (1UL << 1)
#define H7_PERIPH_68_BIT_2 (1UL << 2)
#define H7_PERIPH_68_BIT_3 (1UL << 3)
#define H7_PERIPH_68_BIT_4 (1UL << 4)
#define H7_PERIPH_68_BIT_5 (1UL << 5)
#define H7_PERIPH_68_BIT_6 (1UL << 6)
#define H7_PERIPH_68_BIT_7 (1UL << 7)
#define H7_PERIPH_68_BIT_8 (1UL << 8)
#define H7_PERIPH_68_BIT_9 (1UL << 9)
#define H7_PERIPH_68_BIT_10 (1UL << 10)
#define H7_PERIPH_68_BIT_11 (1UL << 11)
#define H7_PERIPH_68_BIT_12 (1UL << 12)
#define H7_PERIPH_68_BIT_13 (1UL << 13)
#define H7_PERIPH_68_BIT_14 (1UL << 14)
#define H7_PERIPH_68_BIT_15 (1UL << 15)
#define H7_PERIPH_68_BIT_16 (1UL << 16)
#define H7_PERIPH_68_BIT_17 (1UL << 17)
#define H7_PERIPH_68_BIT_18 (1UL << 18)
#define H7_PERIPH_68_BIT_19 (1UL << 19)
#define H7_PERIPH_68_BIT_20 (1UL << 20)
#define H7_PERIPH_68_BIT_21 (1UL << 21)
#define H7_PERIPH_68_BIT_22 (1UL << 22)
#define H7_PERIPH_68_BIT_23 (1UL << 23)
#define H7_PERIPH_68_BIT_24 (1UL << 24)
#define H7_PERIPH_68_BIT_25 (1UL << 25)
#define H7_PERIPH_68_BIT_26 (1UL << 26)
#define H7_PERIPH_68_BIT_27 (1UL << 27)
#define H7_PERIPH_68_BIT_28 (1UL << 28)
#define H7_PERIPH_68_BIT_29 (1UL << 29)
#define H7_PERIPH_68_BIT_30 (1UL << 30)
#define H7_PERIPH_68_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_69_TypeDef;
#define H7_PERIPH_69 ((H7_PERIPH_69_TypeDef *)(0x58000000UL + 69 * 0x400UL))

#define H7_PERIPH_69_BIT_0 (1UL << 0)
#define H7_PERIPH_69_BIT_1 (1UL << 1)
#define H7_PERIPH_69_BIT_2 (1UL << 2)
#define H7_PERIPH_69_BIT_3 (1UL << 3)
#define H7_PERIPH_69_BIT_4 (1UL << 4)
#define H7_PERIPH_69_BIT_5 (1UL << 5)
#define H7_PERIPH_69_BIT_6 (1UL << 6)
#define H7_PERIPH_69_BIT_7 (1UL << 7)
#define H7_PERIPH_69_BIT_8 (1UL << 8)
#define H7_PERIPH_69_BIT_9 (1UL << 9)
#define H7_PERIPH_69_BIT_10 (1UL << 10)
#define H7_PERIPH_69_BIT_11 (1UL << 11)
#define H7_PERIPH_69_BIT_12 (1UL << 12)
#define H7_PERIPH_69_BIT_13 (1UL << 13)
#define H7_PERIPH_69_BIT_14 (1UL << 14)
#define H7_PERIPH_69_BIT_15 (1UL << 15)
#define H7_PERIPH_69_BIT_16 (1UL << 16)
#define H7_PERIPH_69_BIT_17 (1UL << 17)
#define H7_PERIPH_69_BIT_18 (1UL << 18)
#define H7_PERIPH_69_BIT_19 (1UL << 19)
#define H7_PERIPH_69_BIT_20 (1UL << 20)
#define H7_PERIPH_69_BIT_21 (1UL << 21)
#define H7_PERIPH_69_BIT_22 (1UL << 22)
#define H7_PERIPH_69_BIT_23 (1UL << 23)
#define H7_PERIPH_69_BIT_24 (1UL << 24)
#define H7_PERIPH_69_BIT_25 (1UL << 25)
#define H7_PERIPH_69_BIT_26 (1UL << 26)
#define H7_PERIPH_69_BIT_27 (1UL << 27)
#define H7_PERIPH_69_BIT_28 (1UL << 28)
#define H7_PERIPH_69_BIT_29 (1UL << 29)
#define H7_PERIPH_69_BIT_30 (1UL << 30)
#define H7_PERIPH_69_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_70_TypeDef;
#define H7_PERIPH_70 ((H7_PERIPH_70_TypeDef *)(0x58000000UL + 70 * 0x400UL))

#define H7_PERIPH_70_BIT_0 (1UL << 0)
#define H7_PERIPH_70_BIT_1 (1UL << 1)
#define H7_PERIPH_70_BIT_2 (1UL << 2)
#define H7_PERIPH_70_BIT_3 (1UL << 3)
#define H7_PERIPH_70_BIT_4 (1UL << 4)
#define H7_PERIPH_70_BIT_5 (1UL << 5)
#define H7_PERIPH_70_BIT_6 (1UL << 6)
#define H7_PERIPH_70_BIT_7 (1UL << 7)
#define H7_PERIPH_70_BIT_8 (1UL << 8)
#define H7_PERIPH_70_BIT_9 (1UL << 9)
#define H7_PERIPH_70_BIT_10 (1UL << 10)
#define H7_PERIPH_70_BIT_11 (1UL << 11)
#define H7_PERIPH_70_BIT_12 (1UL << 12)
#define H7_PERIPH_70_BIT_13 (1UL << 13)
#define H7_PERIPH_70_BIT_14 (1UL << 14)
#define H7_PERIPH_70_BIT_15 (1UL << 15)
#define H7_PERIPH_70_BIT_16 (1UL << 16)
#define H7_PERIPH_70_BIT_17 (1UL << 17)
#define H7_PERIPH_70_BIT_18 (1UL << 18)
#define H7_PERIPH_70_BIT_19 (1UL << 19)
#define H7_PERIPH_70_BIT_20 (1UL << 20)
#define H7_PERIPH_70_BIT_21 (1UL << 21)
#define H7_PERIPH_70_BIT_22 (1UL << 22)
#define H7_PERIPH_70_BIT_23 (1UL << 23)
#define H7_PERIPH_70_BIT_24 (1UL << 24)
#define H7_PERIPH_70_BIT_25 (1UL << 25)
#define H7_PERIPH_70_BIT_26 (1UL << 26)
#define H7_PERIPH_70_BIT_27 (1UL << 27)
#define H7_PERIPH_70_BIT_28 (1UL << 28)
#define H7_PERIPH_70_BIT_29 (1UL << 29)
#define H7_PERIPH_70_BIT_30 (1UL << 30)
#define H7_PERIPH_70_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_71_TypeDef;
#define H7_PERIPH_71 ((H7_PERIPH_71_TypeDef *)(0x58000000UL + 71 * 0x400UL))

#define H7_PERIPH_71_BIT_0 (1UL << 0)
#define H7_PERIPH_71_BIT_1 (1UL << 1)
#define H7_PERIPH_71_BIT_2 (1UL << 2)
#define H7_PERIPH_71_BIT_3 (1UL << 3)
#define H7_PERIPH_71_BIT_4 (1UL << 4)
#define H7_PERIPH_71_BIT_5 (1UL << 5)
#define H7_PERIPH_71_BIT_6 (1UL << 6)
#define H7_PERIPH_71_BIT_7 (1UL << 7)
#define H7_PERIPH_71_BIT_8 (1UL << 8)
#define H7_PERIPH_71_BIT_9 (1UL << 9)
#define H7_PERIPH_71_BIT_10 (1UL << 10)
#define H7_PERIPH_71_BIT_11 (1UL << 11)
#define H7_PERIPH_71_BIT_12 (1UL << 12)
#define H7_PERIPH_71_BIT_13 (1UL << 13)
#define H7_PERIPH_71_BIT_14 (1UL << 14)
#define H7_PERIPH_71_BIT_15 (1UL << 15)
#define H7_PERIPH_71_BIT_16 (1UL << 16)
#define H7_PERIPH_71_BIT_17 (1UL << 17)
#define H7_PERIPH_71_BIT_18 (1UL << 18)
#define H7_PERIPH_71_BIT_19 (1UL << 19)
#define H7_PERIPH_71_BIT_20 (1UL << 20)
#define H7_PERIPH_71_BIT_21 (1UL << 21)
#define H7_PERIPH_71_BIT_22 (1UL << 22)
#define H7_PERIPH_71_BIT_23 (1UL << 23)
#define H7_PERIPH_71_BIT_24 (1UL << 24)
#define H7_PERIPH_71_BIT_25 (1UL << 25)
#define H7_PERIPH_71_BIT_26 (1UL << 26)
#define H7_PERIPH_71_BIT_27 (1UL << 27)
#define H7_PERIPH_71_BIT_28 (1UL << 28)
#define H7_PERIPH_71_BIT_29 (1UL << 29)
#define H7_PERIPH_71_BIT_30 (1UL << 30)
#define H7_PERIPH_71_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_72_TypeDef;
#define H7_PERIPH_72 ((H7_PERIPH_72_TypeDef *)(0x58000000UL + 72 * 0x400UL))

#define H7_PERIPH_72_BIT_0 (1UL << 0)
#define H7_PERIPH_72_BIT_1 (1UL << 1)
#define H7_PERIPH_72_BIT_2 (1UL << 2)
#define H7_PERIPH_72_BIT_3 (1UL << 3)
#define H7_PERIPH_72_BIT_4 (1UL << 4)
#define H7_PERIPH_72_BIT_5 (1UL << 5)
#define H7_PERIPH_72_BIT_6 (1UL << 6)
#define H7_PERIPH_72_BIT_7 (1UL << 7)
#define H7_PERIPH_72_BIT_8 (1UL << 8)
#define H7_PERIPH_72_BIT_9 (1UL << 9)
#define H7_PERIPH_72_BIT_10 (1UL << 10)
#define H7_PERIPH_72_BIT_11 (1UL << 11)
#define H7_PERIPH_72_BIT_12 (1UL << 12)
#define H7_PERIPH_72_BIT_13 (1UL << 13)
#define H7_PERIPH_72_BIT_14 (1UL << 14)
#define H7_PERIPH_72_BIT_15 (1UL << 15)
#define H7_PERIPH_72_BIT_16 (1UL << 16)
#define H7_PERIPH_72_BIT_17 (1UL << 17)
#define H7_PERIPH_72_BIT_18 (1UL << 18)
#define H7_PERIPH_72_BIT_19 (1UL << 19)
#define H7_PERIPH_72_BIT_20 (1UL << 20)
#define H7_PERIPH_72_BIT_21 (1UL << 21)
#define H7_PERIPH_72_BIT_22 (1UL << 22)
#define H7_PERIPH_72_BIT_23 (1UL << 23)
#define H7_PERIPH_72_BIT_24 (1UL << 24)
#define H7_PERIPH_72_BIT_25 (1UL << 25)
#define H7_PERIPH_72_BIT_26 (1UL << 26)
#define H7_PERIPH_72_BIT_27 (1UL << 27)
#define H7_PERIPH_72_BIT_28 (1UL << 28)
#define H7_PERIPH_72_BIT_29 (1UL << 29)
#define H7_PERIPH_72_BIT_30 (1UL << 30)
#define H7_PERIPH_72_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_73_TypeDef;
#define H7_PERIPH_73 ((H7_PERIPH_73_TypeDef *)(0x58000000UL + 73 * 0x400UL))

