RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_73_BIT_0 (1UL << 0)
#define H7_PERIPH_73_BIT_1 (1UL << 1)
#define H7_PERIPH_73_BIT_2 (1UL << 2)
#define H7_PERIPH_73_BIT_3 (1UL << 3)
#define H7_PERIPH_73_BIT_4 (1UL << 4)
#define H7_PERIPH_73_BIT_5 (1UL << 5)
#define H7_PERIPH_73_BIT_6 (1UL << 6)
#define H7_PERIPH_73_BIT_7 (1UL << 7)
#define H7_PERIPH_73_BIT_8 (1UL << 8)
#define H7_PERIPH_73_BIT_9 (1UL << 9)
#define H7_PERIPH_73_BIT_10 (1UL << 10)
#define H7_PERIPH_73_BIT_11 (1UL << 11)
#define H7_PERIPH_73_BIT_12 (1UL << 12)
#define H7_PERIPH_73_BIT_13 (1UL << 13)
#define H7_PERIPH_73_BIT_14 (1UL << 14)
#define H7_PERIPH_73_BIT_15 (1UL << 15)
#define H7_PERIPH_73_BIT_16 (1UL << 16)
#define H7_PERIPH_73_BIT_17 (1UL << 17)
#define H7_PERIPH_73_BIT_18 (1UL << 18)
#define H7_PERIPH_73_BIT_19 (1UL << 19)
#define H7_PERIPH_73_BIT_20 (1UL << 20)
#define H7_PERIPH_73_BIT_21 (1UL << 21)
#define H7_PERIPH_73_BIT_22 (1UL << 22)
#define H7_PERIPH_73_BIT_23 (1UL << 23)
#define H7_PERIPH_73_BIT_24 (1UL << 24)
#define H7_PERIPH_73_BIT_25 (1UL << 25)
#define H7_PERIPH_73_BIT_26 (1UL << 26)
#define H7_PERIPH_73_BIT_27 (1UL << 27)
#define H7_PERIPH_73_BIT_28 (1UL << 28)
#define H7_PERIPH_73_BIT_29 (1UL << 29)
#define H7_PERIPH_73_BIT_30 (1UL << 30)
#define H7_PERIPH_73_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_74_TypeDef;
#define H7_PERIPH_74 ((H7_PERIPH_74_TypeDef *)(0x58000000UL + 74 * 0x400UL))

#define H7_PERIPH_74_BIT_0 (1UL << 0)
#define H7_PERIPH_74_BIT_1 (1UL << 1)
#define H7_PERIPH_74_BIT_2 (1UL << 2)
#define H7_PERIPH_74_BIT_3 (1UL << 3)
#define H7_PERIPH_74_BIT_4 (1UL << 4)
#define H7_PERIPH_74_BIT_5 (1UL << 5)
#define H7_PERIPH_74_BIT_6 (1UL << 6)
#define H7_PERIPH_74_BIT_7 (1UL << 7)
#define H7_PERIPH_74_BIT_8 (1UL << 8)
#define H7_PERIPH_74_BIT_9 (1UL << 9)
#define H7_PERIPH_74_BIT_10 (1UL << 10)
#define H7_PERIPH_74_BIT_11 (1UL << 11)
#define H7_PERIPH_74_BIT_12 (1UL << 12)
#define H7_PERIPH_74_BIT_13 (1UL << 13)
#define H7_PERIPH_74_BIT_14 (1UL << 14)
#define H7_PERIPH_74_BIT_15 (1UL << 15)
#define H7_PERIPH_74_BIT_16 (1UL << 16)
#define H7_PERIPH_74_BIT_17 (1UL << 17)
#define H7_PERIPH_74_BIT_18 (1UL << 18)
#define H7_PERIPH_74_BIT_19 (1UL << 19)
#define H7_PERIPH_74_BIT_20 (1UL << 20)
#define H7_PERIPH_74_BIT_21 (1UL << 21)
#define H7_PERIPH_74_BIT_22 (1UL << 22)
#define H7_PERIPH_74_BIT_23 (1UL << 23)
#define H7_PERIPH_74_BIT_24 (1UL << 24)
#define H7_PERIPH_74_BIT_25 (1UL << 25)
#define H7_PERIPH_74_BIT_26 (1UL << 26)
#define H7_PERIPH_74_BIT_27 (1UL << 27)
#define H7_PERIPH_74_BIT_28 (1UL << 28)
#define H7_PERIPH_74_BIT_29 (1UL << 29)
#define H7_PERIPH_74_BIT_30 (1UL << 30)
#define H7_PERIPH_74_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_75_TypeDef;
#define H7_PERIPH_75 ((H7_PERIPH_75_TypeDef *)(0x58000000UL + 75 * 0x400UL))

#define H7_PERIPH_75_BIT_0 (1UL << 0)
#define H7_PERIPH_75_BIT_1 (1UL << 1)
#define H7_PERIPH_75_BIT_2 (1UL << 2)
#define H7_PERIPH_75_BIT_3 (1UL << 3)
#define H7_PERIPH_75_BIT_4 (1UL << 4)
#define H7_PERIPH_75_BIT_5 (1UL << 5)
#define H7_PERIPH_75_BIT_6 (1UL << 6)
#define H7_PERIPH_75_BIT_7 (1UL << 7)
#define H7_PERIPH_75_BIT_8 (1UL << 8)
#define H7_PERIPH_75_BIT_9 (1UL << 9)
#define H7_PERIPH_75_BIT_10 (1UL << 10)
#define H7_PERIPH_75_BIT_11 (1UL << 11)
#define H7_PERIPH_75_BIT_12 (1UL << 12)
#define H7_PERIPH_75_BIT_13 (1UL << 13)
#define H7_PERIPH_75_BIT_14 (1UL << 14)
#define H7_PERIPH_75_BIT_15 (1UL << 15)
#define H7_PERIPH_75_BIT_16 (1UL << 16)
#define H7_PERIPH_75_BIT_17 (1UL << 17)
#define H7_PERIPH_75_BIT_18 (1UL << 18)
#define H7_PERIPH_75_BIT_19 (1UL << 19)
#define H7_PERIPH_75_BIT_20 (1UL << 20)
#define H7_PERIPH_75_BIT_21 (1UL << 21)
#define H7_PERIPH_75_BIT_22 (1UL << 22)
#define H7_PERIPH_75_BIT_23 (1UL << 23)
#define H7_PERIPH_75_BIT_24 (1UL << 24)
#define H7_PERIPH_75_BIT_25 (1UL << 25)
#define H7_PERIPH_75_BIT_26 (1UL << 26)
#define H7_PERIPH_75_BIT_27 (1UL << 27)
#define H7_PERIPH_75_BIT_28 (1UL << 28)
#define H7_PERIPH_75_BIT_29 (1UL << 29)
#define H7_PERIPH_75_BIT_30 (1UL << 30)
#define H7_PERIPH_75_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_76_TypeDef;
#define H7_PERIPH_76 ((H7_PERIPH_76_TypeDef *)(0x58000000UL + 76 * 0x400UL))

#define H7_PERIPH_76_BIT_0 (1UL << 0)
#define H7_PERIPH_76_BIT_1 (1UL << 1)
#define H7_PERIPH_76_BIT_2 (1UL << 2)
#define H7_PERIPH_76_BIT_3 (1UL << 3)
#define H7_PERIPH_76_BIT_4 (1UL << 4)
#define H7_PERIPH_76_BIT_5 (1UL << 5)
#define H7_PERIPH_76_BIT_6 (1UL << 6)
#define H7_PERIPH_76_BIT_7 (1UL << 7)
#define H7_PERIPH_76_BIT_8 (1UL << 8)
#define H7_PERIPH_76_BIT_9 (1UL << 9)
#define H7_PERIPH_76_BIT_10 (1UL << 10)
#define H7_PERIPH_76_BIT_11 (1UL << 11)
#define H7_PERIPH_76_BIT_12 (1UL << 12)
#define H7_PERIPH_76_BIT_13 (1UL << 13)
#define H7_PERIPH_76_BIT_14 (1UL << 14)
#define H7_PERIPH_76_BIT_15 (1UL << 15)
#define H7_PERIPH_76_BIT_16 (1UL << 16)
#define H7_PERIPH_76_BIT_17 (1UL << 17)
#define H7_PERIPH_76_BIT_18 (1UL << 18)
#define H7_PERIPH_76_BIT_19 (1UL << 19)
#define H7_PERIPH_76_BIT_20 (1UL << 20)
#define H7_PERIPH_76_BIT_21 (1UL << 21)
#define H7_PERIPH_76_BIT_22 (1UL << 22)
#define H7_PERIPH_76_BIT_23 (1UL << 23)
#define H7_PERIPH_76_BIT_24 (1UL << 24)
#define H7_PERIPH_76_BIT_25 (1UL << 25)
#define H7_PERIPH_76_BIT_26 (1UL << 26)
#define H7_PERIPH_76_BIT_27 (1UL << 27)
#define H7_PERIPH_76_BIT_28 (1UL << 28)
#define H7_PERIPH_76_BIT_29 (1UL << 29)
#define H7_PERIPH_76_BIT_30 (1UL << 30)
#define H7_PERIPH_76_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_77_TypeDef;
#define H7_PERIPH_77 ((H7_PERIPH_77_TypeDef *)(0x58000000UL + 77 * 0x400UL))

#define H7_PERIPH_77_BIT_0 (1UL << 0)
#define H7_PERIPH_77_BIT_1 (1UL << 1)
#define H7_PERIPH_77_BIT_2 (1UL << 2)
#define H7_PERIPH_77_BIT_3 (1UL << 3)
#define H7_PERIPH_77_BIT_4 (1UL << 4)
#define H7_PERIPH_77_BIT_5 (1UL << 5)
#define H7_PERIPH_77_BIT_6 (1UL << 6)
#define H7_PERIPH_77_BIT_7 (1UL << 7)
#define H7_PERIPH_77_BIT_8 (1UL << 8)
#define H7_PERIPH_77_BIT_9 (1UL << 9)
#define H7_PERIPH_77_BIT_10 (1UL << 10)
#define H7_PERIPH_77_BIT_11 (1UL << 11)
#define H7_PERIPH_77_BIT_12 (1UL << 12)
#define H7_PERIPH_77_BIT_13 (1UL << 13)
#define H7_PERIPH_77_BIT_14 (1UL << 14)
#define H7_PERIPH_77_BIT_15 (1UL << 15)
#define H7_PERIPH_77_BIT_16 (1UL << 16)
#define H7_PERIPH_77_BIT_17 (1UL << 17)
#define H7_PERIPH_77_BIT_18 (1UL << 18)
#define H7_PERIPH_77_BIT_19 (1UL << 19)
#define H7_PERIPH_77_BIT_20 (1UL << 20)
#define H7_PERIPH_77_BIT_21 (1UL << 21)
#define H7_PERIPH_77_BIT_22 (1UL << 22)
#define H7_PERIPH_77_BIT_23 (1UL << 23)
#define H7_PERIPH_77_BIT_24 (1UL << 24)
#define H7_PERIPH_77_BIT_25 (1UL << 25)
#define H7_PERIPH_77_BIT_26 (1UL << 26)
#define H7_PERIPH_77_BIT_27 (1UL << 27)
#define H7_PERIPH_77_BIT_28 (1UL << 28)
#define H7_PERIPH_77_BIT_29 (1UL << 29)
#define H7_PERIPH_77_BIT_30 (1UL << 30)
#define H7_PERIPH_77_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_78_TypeDef;
#define H7_PERIPH_78 ((H7_PERIPH_78_TypeDef *)(0x58000000UL + 78 * 0x400UL))

#define H7_PERIPH_78_BIT_0 (1UL << 0)
#define H7_PERIPH_78_BIT_1 (1UL << 1)
#define H7_PERIPH_78_BIT_2 (1UL << 2)
#define H7_PERIPH_78_BIT_3 (1UL << 3)
#define H7_PERIPH_78_BIT_4 (1UL << 4)
#define H7_PERIPH_78_BIT_5 (1UL << 5)
#define H7_PERIPH_78_BIT_6 (1UL << 6)
#define H7_PERIPH_78_BIT_7 (1UL << 7)
#define H7_PERIPH_78_BIT_8 (1UL << 8)
#define H7_PERIPH_78_BIT_9 (1UL << 9)
#define H7_PERIPH_78_BIT_10 (1UL << 10)
#define H7_PERIPH_78_BIT_11 (1UL << 11)
#define H7_PERIPH_78_BIT_12 (1UL << 12)
#define H7_PERIPH_78_BIT_13 (1UL << 13)
#define H7_PERIPH_78_BIT_14 (1UL << 14)
#define H7_PERIPH_78_BIT_15 (1UL << 15)
#define H7_PERIPH_78_BIT_16 (1UL << 16)
#define H7_PERIPH_78_BIT_17 (1UL << 17)
#define H7_PERIPH_78_BIT_18 (1UL << 18)
#define H7_PERIPH_78_BIT_19 (1UL << 19)
#define H7_PERIPH_78_BIT_20 (1UL << 20)
#define H7_PERIPH_78_BIT_21 (1UL << 21)
#define H7_PERIPH_78_BIT_22 (1UL << 22)
#define H7_PERIPH_78_BIT_23 (1UL << 23)
#define H7_PERIPH_78_BIT_24 (1UL << 24)
#define H7_PERIPH_78_BIT_25 (1UL << 25)
#define H7_PERIPH_78_BIT_26 (1UL << 26)
#define H7_PERIPH_78_BIT_27 (1UL << 27)
#define H7_PERIPH_78_BIT_28 (1UL << 28)
#define H7_PERIPH_78_BIT_29 (1UL << 29)
#define H7_PERIPH_78_BIT_30 (1UL << 30)
#define H7_PERIPH_78_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_79_TypeDef;
#define H7_PERIPH_79 ((H7_PERIPH_79_TypeDef *)(0x58000000UL + 79 * 0x400UL))

#define H7_PERIPH_79_BIT_0 (1UL << 0)
#define H7_PERIPH_79_BIT_1 (1UL << 1)
#define H7_PERIPH_79_BIT_2 (1UL << 2)
#define H7_PERIPH_79_BIT_3 (1UL << 3)
#define H7_PERIPH_79_BIT_4 (1UL << 4)
#define H7_PERIPH_79_BIT_5 (1UL << 5)
#define H7_PERIPH_79_BIT_6 (1UL << 6)
#define H7_PERIPH_79_BIT_7 (1UL << 7)
#define H7_PERIPH_79_BIT_8 (1UL << 8)
#define H7_PERIPH_79_BIT_9 (1UL << 9)
#define H7_PERIPH_79_BIT_10 (1UL << 10)
#define H7_PERIPH_79_BIT_11 (1UL << 11)
#define H7_PERIPH_79_BIT_12 (1UL << 12)
#define H7_PERIPH_79_BIT_13 (1UL << 13)
#define H7_PERIPH_79_BIT_14 (1UL << 14)
#define H7_PERIPH_79_BIT_15 (1UL << 15)
#define H7_PERIPH_79_BIT_16 (1UL << 16)
#define H7_PERIPH_79_BIT_17 (1UL << 17)
#define H7_PERIPH_79_BIT_18 (1UL << 18)
#define H7_PERIPH_79_BIT_19 (1UL << 19)
#define H7_PERIPH_79_BIT_20 (1UL << 20)
#define H7_PERIPH_79_BIT_21 (1UL << 21)
#define H7_PERIPH_79_BIT_22 (1UL << 22)
#define H7_PERIPH_79_BIT_23 (1UL << 23)
#define H7_PERIPH_79_BIT_24 (1UL << 24)
#define H7_PERIPH_79_BIT_25 (1UL << 25)
#define H7_PERIPH_79_BIT_26 (1UL << 26)
#define H7_PERIPH_79_BIT_27 (1UL << 27)
#define H7_PERIPH_79_BIT_28 (1UL << 28)
#define H7_PERIPH_79_BIT_29 (1UL << 29)
#define H7_PERIPH_79_BIT_30 (1UL << 30)
#define H7_PERIPH_79_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_80_TypeDef;
#define H7_PERIPH_80 ((H7_PERIPH_80_TypeDef *)(0x58000000UL + 80 * 0x400UL))

