RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_80_BIT_0 (1UL << 0)
#define H7_PERIPH_80_BIT_1 (1UL << 1)
#define H7_PERIPH_80_BIT_2 (1UL << 2)
#define H7_PERIPH_80_BIT_3 (1UL << 3)
#define H7_PERIPH_80_BIT_4 (1UL << 4)
#define H7_PERIPH_80_BIT_5 (1UL << 5)
#define H7_PERIPH_80_BIT_6 (1UL << 6)
#define H7_PERIPH_80_BIT_7 (1UL << 7)
#define H7_PERIPH_80_BIT_8 (1UL << 8)
#define H7_PERIPH_80_BIT_9 (1UL << 9)
#define H7_PERIPH_80_BIT_10 (1UL << 10)
#define H7_PERIPH_80_BIT_11 (1UL << 11)
#define H7_PERIPH_80_BIT_12 (1UL << 12)
#define H7_PERIPH_80_BIT_13 (1UL << 13)
#define H7_PERIPH_80_BIT_14 (1UL << 14)
#define H7_PERIPH_80_BIT_15 (1UL << 15)
#define H7_PERIPH_80_BIT_16 (1UL << 16)
#define H7_PERIPH_80_BIT_17 (1UL << 17)
#define H7_PERIPH_80_BIT_18 (1UL << 18)
#define H7_PERIPH_80_BIT_19 (1UL << 19)
#define H7_PERIPH_80_BIT_20 (1UL << 20)
#define H7_PERIPH_80_BIT_21 (1UL << 21)
#define H7_PERIPH_80_BIT_22 (1UL << 22)
#define H7_PERIPH_80_BIT_23 (1UL << 23)
#define H7_PERIPH_80_BIT_24 (1UL << 24)
#define H7_PERIPH_80_BIT_25 (1UL << 25)
#define H7_PERIPH_80_BIT_26 (1UL << 26)
#define H7_PERIPH_80_BIT_27 (1UL << 27)
#define H7_PERIPH_80_BIT_28 (1UL << 28)
#define H7_PERIPH_80_BIT_29 (1UL << 29)
#define H7_PERIPH_80_BIT_30 (1UL << 30)
#define H7_PERIPH_80_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_81_TypeDef;
#define H7_PERIPH_81 ((H7_PERIPH_81_TypeDef *)(0x58000000UL + 81 * 0x400UL))

#define H7_PERIPH_81_BIT_0 (1UL << 0)
#define H7_PERIPH_81_BIT_1 (1UL << 1)
#define H7_PERIPH_81_BIT_2 (1UL << 2)
#define H7_PERIPH_81_BIT_3 (1UL << 3)
#define H7_PERIPH_81_BIT_4 (1UL << 4)
#define H7_PERIPH_81_BIT_5 (1UL << 5)
#define H7_PERIPH_81_BIT_6 (1UL << 6)
#define H7_PERIPH_81_BIT_7 (1UL << 7)
#define H7_PERIPH_81_BIT_8 (1UL << 8)
#define H7_PERIPH_81_BIT_9 (1UL << 9)
#define H7_PERIPH_81_BIT_10 (1UL << 10)
#define H7_PERIPH_81_BIT_11 (1UL << 11)
#define H7_PERIPH_81_BIT_12 (1UL << 12)
#define H7_PERIPH_81_BIT_13 (1UL << 13)
#define H7_PERIPH_81_BIT_14 (1UL << 14)
#define H7_PERIPH_81_BIT_15 (1UL << 15)
#define H7_PERIPH_81_BIT_16 (1UL << 16)
#define H7_PERIPH_81_BIT_17 (1UL << 17)
#define H7_PERIPH_81_BIT_18 (1UL << 18)
#define H7_PERIPH_81_BIT_19 (1UL << 19)
#define H7_PERIPH_81_BIT_20 (1UL << 20)
#define H7_PERIPH_81_BIT_21 (1UL << 21)
#define H7_PERIPH_81_BIT_22 (1UL << 22)
#define H7_PERIPH_81_BIT_23 (1UL << 23)
#define H7_PERIPH_81_BIT_24 (1UL << 24)
#define H7_PERIPH_81_BIT_25 (1UL << 25)
#define H7_PERIPH_81_BIT_26 (1UL << 26)
#define H7_PERIPH_81_BIT_27 (1UL << 27)
#define H7_PERIPH_81_BIT_28 (1UL << 28)
#define H7_PERIPH_81_BIT_29 (1UL << 29)
#define H7_PERIPH_81_BIT_30 (1UL << 30)
#define H7_PERIPH_81_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_82_TypeDef;
#define H7_PERIPH_82 ((H7_PERIPH_82_TypeDef *)(0x58000000UL + 82 * 0x400UL))

#define H7_PERIPH_82_BIT_0 (1UL << 0)
#define H7_PERIPH_82_BIT_1 (1UL << 1)
#define H7_PERIPH_82_BIT_2 (1UL << 2)
#define H7_PERIPH_82_BIT_3 (1UL << 3)
#define H7_PERIPH_82_BIT_4 (1UL << 4)
#define H7_PERIPH_82_BIT_5 (1UL << 5)
#define H7_PERIPH_82_BIT_6 (1UL << 6)
#define H7_PERIPH_82_BIT_7 (1UL << 7)
#define H7_PERIPH_82_BIT_8 (1UL << 8)
#define H7_PERIPH_82_BIT_9 (1UL << 9)
#define H7_PERIPH_82_BIT_10 (1UL << 10)
#define H7_PERIPH_82_BIT_11 (1UL << 11)
#define H7_PERIPH_82_BIT_12 (1UL << 12)
#define H7_PERIPH_82_BIT_13 (1UL << 13)
#define H7_PERIPH_82_BIT_14 (1UL << 14)
#define H7_PERIPH_82_BIT_15 (1UL << 15)
#define H7_PERIPH_82_BIT_16 (1UL << 16)
#define H7_PERIPH_82_BIT_17 (1UL << 17)
#define H7_PERIPH_82_BIT_18 (1UL << 18)
#define H7_PERIPH_82_BIT_19 (1UL << 19)
#define H7_PERIPH_82_BIT_20 (1UL << 20)
#define H7_PERIPH_82_BIT_21 (1UL << 21)
#define H7_PERIPH_82_BIT_22 (1UL << 22)
#define H7_PERIPH_82_BIT_23 (1UL << 23)
#define H7_PERIPH_82_BIT_24 (1UL << 24)
#define H7_PERIPH_82_BIT_25 (1UL << 25)
#define H7_PERIPH_82_BIT_26 (1UL << 26)
#define H7_PERIPH_82_BIT_27 (1UL << 27)
#define H7_PERIPH_82_BIT_28 (1UL << 28)
#define H7_PERIPH_82_BIT_29 (1UL << 29)
#define H7_PERIPH_82_BIT_30 (1UL << 30)
#define H7_PERIPH_82_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_83_TypeDef;
#define H7_PERIPH_83 ((H7_PERIPH_83_TypeDef *)(0x58000000UL + 83 * 0x400UL))

#define H7_PERIPH_83_BIT_0 (1UL << 0)
#define H7_PERIPH_83_BIT_1 (1UL << 1)
#define H7_PERIPH_83_BIT_2 (1UL << 2)
#define H7_PERIPH_83_BIT_3 (1UL << 3)
#define H7_PERIPH_83_BIT_4 (1UL << 4)
#define H7_PERIPH_83_BIT_5 (1UL << 5)
#define H7_PERIPH_83_BIT_6 (1UL << 6)
#define H7_PERIPH_83_BIT_7 (1UL << 7)
#define H7_PERIPH_83_BIT_8 (1UL << 8)
#define H7_PERIPH_83_BIT_9 (1UL << 9)
#define H7_PERIPH_83_BIT_10 (1UL << 10)
#define H7_PERIPH_83_BIT_11 (1UL << 11)
#define H7_PERIPH_83_BIT_12 (1UL << 12)
#define H7_PERIPH_83_BIT_13 (1UL << 13)
#define H7_PERIPH_83_BIT_14 (1UL << 14)
#define H7_PERIPH_83_BIT_15 (1UL << 15)
#define H7_PERIPH_83_BIT_16 (1UL << 16)
#define H7_PERIPH_83_BIT_17 (1UL << 17)
#define H7_PERIPH_83_BIT_18 (1UL << 18)
#define H7_PERIPH_83_BIT_19 (1UL << 19)
#define H7_PERIPH_83_BIT_20 (1UL << 20)
#define H7_PERIPH_83_BIT_21 (1UL << 21)
#define H7_PERIPH_83_BIT_22 (1UL << 22)
#define H7_PERIPH_83_BIT_23 (1UL << 23)
#define H7_PERIPH_83_BIT_24 (1UL << 24)
#define H7_PERIPH_83_BIT_25 (1UL << 25)
#define H7_PERIPH_83_BIT_26 (1UL << 26)
#define H7_PERIPH_83_BIT_27 (1UL << 27)
#define H7_PERIPH_83_BIT_28 (1UL << 28)
#define H7_PERIPH_83_BIT_29 (1UL << 29)
#define H7_PERIPH_83_BIT_30 (1UL << 30)
#define H7_PERIPH_83_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_84_TypeDef;
#define H7_PERIPH_84 ((H7_PERIPH_84_TypeDef *)(0x58000000UL + 84 * 0x400UL))

#define H7_PERIPH_84_BIT_0 (1UL << 0)
#define H7_PERIPH_84_BIT_1 (1UL << 1)
#define H7_PERIPH_84_BIT_2 (1UL << 2)
#define H7_PERIPH_84_BIT_3 (1UL << 3)
#define H7_PERIPH_84_BIT_4 (1UL << 4)
#define H7_PERIPH_84_BIT_5 (1UL << 5)
#define H7_PERIPH_84_BIT_6 (1UL << 6)
#define H7_PERIPH_84_BIT_7 (1UL << 7)
#define H7_PERIPH_84_BIT_8 (1UL << 8)
#define H7_PERIPH_84_BIT_9 (1UL << 9)
#define H7_PERIPH_84_BIT_10 (1UL << 10)
#define H7_PERIPH_84_BIT_11 (1UL << 11)
#define H7_PERIPH_84_BIT_12 (1UL << 12)
#define H7_PERIPH_84_BIT_13 (1UL << 13)
#define H7_PERIPH_84_BIT_14 (1UL << 14)
#define H7_PERIPH_84_BIT_15 (1UL << 15)
#define H7_PERIPH_84_BIT_16 (1UL << 16)
#define H7_PERIPH_84_BIT_17 (1UL << 17)
#define H7_PERIPH_84_BIT_18 (1UL << 18)
#define H7_PERIPH_84_BIT_19 (1UL << 19)
#define H7_PERIPH_84_BIT_20 (1UL << 20)
#define H7_PERIPH_84_BIT_21 (1UL << 21)
#define H7_PERIPH_84_BIT_22 (1UL << 22)
#define H7_PERIPH_84_BIT_23 (1UL << 23)
#define H7_PERIPH_84_BIT_24 (1UL << 24)
#define H7_PERIPH_84_BIT_25 (1UL << 25)
#define H7_PERIPH_84_BIT_26 (1UL << 26)
#define H7_PERIPH_84_BIT_27 (1UL << 27)
#define H7_PERIPH_84_BIT_28 (1UL << 28)
#define H7_PERIPH_84_BIT_29 (1UL << 29)
#define H7_PERIPH_84_BIT_30 (1UL << 30)
#define H7_PERIPH_84_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_85_TypeDef;
#define H7_PERIPH_85 ((H7_PERIPH_85_TypeDef *)(0x58000000UL + 85 * 0x400UL))

#define H7_PERIPH_85_BIT_0 (1UL << 0)
#define H7_PERIPH_85_BIT_1 (1UL << 1)
#define H7_PERIPH_85_BIT_2 (1UL << 2)
#define H7_PERIPH_85_BIT_3 (1UL << 3)
#define H7_PERIPH_85_BIT_4 (1UL << 4)
#define H7_PERIPH_85_BIT_5 (1UL << 5)
#define H7_PERIPH_85_BIT_6 (1UL << 6)
#define H7_PERIPH_85_BIT_7 (1UL << 7)
#define H7_PERIPH_85_BIT_8 (1UL << 8)
#define H7_PERIPH_85_BIT_9 (1UL << 9)
#define H7_PERIPH_85_BIT_10 (1UL << 10)
#define H7_PERIPH_85_BIT_11 (1UL << 11)
#define H7_PERIPH_85_BIT_12 (1UL << 12)
#define H7_PERIPH_85_BIT_13 (1UL << 13)
#define H7_PERIPH_85_BIT_14 (1UL << 14)
#define H7_PERIPH_85_BIT_15 (1UL << 15)
#define H7_PERIPH_85_BIT_16 (1UL << 16)
#define H7_PERIPH_85_BIT_17 (1UL << 17)
#define H7_PERIPH_85_BIT_18 (1UL << 18)
#define H7_PERIPH_85_BIT_19 (1UL << 19)
#define H7_PERIPH_85_BIT_20 (1UL << 20)
#define H7_PERIPH_85_BIT_21 (1UL << 21)
#define H7_PERIPH_85_BIT_22 (1UL << 22)
#define H7_PERIPH_85_BIT_23 (1UL << 23)
#define H7_PERIPH_85_BIT_24 (1UL << 24)
#define H7_PERIPH_85_BIT_25 (1UL << 25)
#define H7_PERIPH_85_BIT_26 (1UL << 26)
#define H7_PERIPH_85_BIT_27 (1UL << 27)
#define H7_PERIPH_85_BIT_28 (1UL << 28)
#define H7_PERIPH_85_BIT_29 (1UL << 29)
#define H7_PERIPH_85_BIT_30 (1UL << 30)
#define H7_PERIPH_85_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_86_TypeDef;
#define H7_PERIPH_86 ((H7_PERIPH_86_TypeDef *)(0x58000000UL + 86 * 0x400UL))

#define H7_PERIPH_86_BIT_0 (1UL << 0)
#define H7_PERIPH_86_BIT_1 (1UL << 1)
#define H7_PERIPH_86_BIT_2 (1UL << 2)
#define H7_PERIPH_86_BIT_3 (1UL << 3)
#define H7_PERIPH_86_BIT_4 (1UL << 4)
#define H7_PERIPH_86_BIT_5 (1UL << 5)
#define H7_PERIPH_86_BIT_6 (1UL << 6)
#define H7_PERIPH_86_BIT_7 (1UL << 7)
#define H7_PERIPH_86_BIT_8 (1UL << 8)
#define H7_PERIPH_86_BIT_9 (1UL << 9)
#define H7_PERIPH_86_BIT_10 (1UL << 10)
#define H7_PERIPH_86_BIT_11 (1UL << 11)
#define H7_PERIPH_86_BIT_12 (1UL << 12)
#define H7_PERIPH_86_BIT_13 (1UL << 13)
#define H7_PERIPH_86_BIT_14 (1UL << 14)
#define H7_PERIPH_86_BIT_15 (1UL << 15)
#define H7_PERIPH_86_BIT_16 (1UL << 16)
#define H7_PERIPH_86_BIT_17 (1UL << 17)
#define H7_PERIPH_86_BIT_18 (1UL << 18)
#define H7_PERIPH_86_BIT_19 (1UL << 19)
#define H7_PERIPH_86_BIT_20 (1UL << 20)
#define H7_PERIPH_86_BIT_21 (1UL << 21)
#define H7_PERIPH_86_BIT_22 (1UL << 22)
#define H7_PERIPH_86_BIT_23 (1UL << 23)
#define H7_PERIPH_86_BIT_24 (1UL << 24)
#define H7_PERIPH_86_BIT_25 (1UL << 25)
#define H7_PERIPH_86_BIT_26 (1UL << 26)
#define H7_PERIPH_86_BIT_27 (1UL << 27)
#define H7_PERIPH_86_BIT_28 (1UL << 28)
#define H7_PERIPH_86_BIT_29 (1UL << 29)
#define H7_PERIPH_86_BIT_30 (1UL << 30)
#define H7_PERIPH_86_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_87_TypeDef;
#define H7_PERIPH_87 ((H7_PERIPH_87_TypeDef *)(0x58000000UL + 87 * 0x400UL))

