RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_87_BIT_0 (1UL << 0)
#define H7_PERIPH_87_BIT_1 (1UL << 1)
#define H7_PERIPH_87_BIT_2 (1UL << 2)
#define H7_PERIPH_87_BIT_3 (1UL << 3)
#define H7_PERIPH_87_BIT_4 (1UL << 4)
#define H7_PERIPH_87_BIT_5 (1UL << 5)
#define H7_PERIPH_87_BIT_6 (1UL << 6)
#define H7_PERIPH_87_BIT_7 (1UL << 7)
#define H7_PERIPH_87_BIT_8 (1UL << 8)
#define H7_PERIPH_87_BIT_9 (1UL << 9)
#define H7_PERIPH_87_BIT_10 (1UL << 10)
#define H7_PERIPH_87_BIT_11 (1UL << 11)
#define H7_PERIPH_87_BIT_12 (1UL << 12)
#define H7_PERIPH_87_BIT_13 (1UL << 13)
#define H7_PERIPH_87_BIT_14 (1UL << 14)
#define H7_PERIPH_87_BIT_15 (1UL << 15)
#define H7_PERIPH_87_BIT_16 (1UL << 16)
#define H7_PERIPH_87_BIT_17 (1UL << 17)
#define H7_PERIPH_87_BIT_18 (1UL << 18)
#define H7_PERIPH_87_BIT_19 (1UL << 19)
#define H7_PERIPH_87_BIT_20 (1UL << 20)
#define H7_PERIPH_87_BIT_21 (1UL << 21)
#define H7_PERIPH_87_BIT_22 (1UL << 22)
#define H7_PERIPH_87_BIT_23 (1UL << 23)
#define H7_PERIPH_87_BIT_24 (1UL << 24)
#define H7_PERIPH_87_BIT_25 (1UL << 25)
#define H7_PERIPH_87_BIT_26 (1UL << 26)
#define H7_PERIPH_87_BIT_27 (1UL << 27)
#define H7_PERIPH_87_BIT_28 (1UL << 28)
#define H7_PERIPH_87_BIT_29 (1UL << 29)
#define H7_PERIPH_87_BIT_30 (1UL << 30)
#define H7_PERIPH_87_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_88_TypeDef;
#define H7_PERIPH_88 ((H7_PERIPH_88_TypeDef *)(0x58000000UL + 88 * 0x400UL))

#define H7_PERIPH_88_BIT_0 (1UL << 0)
#define H7_PERIPH_88_BIT_1 (1UL << 1)
#define H7_PERIPH_88_BIT_2 (1UL << 2)
#define H7_PERIPH_88_BIT_3 (1UL << 3)
#define H7_PERIPH_88_BIT_4 (1UL << 4)
#define H7_PERIPH_88_BIT_5 (1UL << 5)
#define H7_PERIPH_88_BIT_6 (1UL << 6)
#define H7_PERIPH_88_BIT_7 (1UL << 7)
#define H7_PERIPH_88_BIT_8 (1UL << 8)
#define H7_PERIPH_88_BIT_9 (1UL << 9)
#define H7_PERIPH_88_BIT_10 (1UL << 10)
#define H7_PERIPH_88_BIT_11 (1UL << 11)
#define H7_PERIPH_88_BIT_12 (1UL << 12)
#define H7_PERIPH_88_BIT_13 (1UL << 13)
#define H7_PERIPH_88_BIT_14 (1UL << 14)
#define H7_PERIPH_88_BIT_15 (1UL << 15)
#define H7_PERIPH_88_BIT_16 (1UL << 16)
#define H7_PERIPH_88_BIT_17 (1UL << 17)
#define H7_PERIPH_88_BIT_18 (1UL << 18)
#define H7_PERIPH_88_BIT_19 (1UL << 19)
#define H7_PERIPH_88_BIT_20 (1UL << 20)
#define H7_PERIPH_88_BIT_21 (1UL << 21)
#define H7_PERIPH_88_BIT_22 (1UL << 22)
#define H7_PERIPH_88_BIT_23 (1UL << 23)
#define H7_PERIPH_88_BIT_24 (1UL << 24)
#define H7_PERIPH_88_BIT_25 (1UL << 25)
#define H7_PERIPH_88_BIT_26 (1UL << 26)
#define H7_PERIPH_88_BIT_27 (1UL << 27)
#define H7_PERIPH_88_BIT_28 (1UL << 28)
#define H7_PERIPH_88_BIT_29 (1UL << 29)
#define H7_PERIPH_88_BIT_30 (1UL << 30)
#define H7_PERIPH_88_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_89_TypeDef;
#define H7_PERIPH_89 ((H7_PERIPH_89_TypeDef *)(0x58000000UL + 89 * 0x400UL))

#define H7_PERIPH_89_BIT_0 (1UL << 0)
#define H7_PERIPH_89_BIT_1 (1UL << 1)
#define H7_PERIPH_89_BIT_2 (1UL << 2)
#define H7_PERIPH_89_BIT_3 (1UL << 3)
#define H7_PERIPH_89_BIT_4 (1UL << 4)
#define H7_PERIPH_89_BIT_5 (1UL << 5)
#define H7_PERIPH_89_BIT_6 (1UL << 6)
#define H7_PERIPH_89_BIT_7 (1UL << 7)
#define H7_PERIPH_89_BIT_8 (1UL << 8)
#define H7_PERIPH_89_BIT_9 (1UL << 9)
#define H7_PERIPH_89_BIT_10 (1UL << 10)
#define H7_PERIPH_89_BIT_11 (1UL << 11)
#define H7_PERIPH_89_BIT_12 (1UL << 12)
#define H7_PERIPH_89_BIT_13 (1UL << 13)
#define H7_PERIPH_89_BIT_14 (1UL << 14)
#define H7_PERIPH_89_BIT_15 (1UL << 15)
#define H7_PERIPH_89_BIT_16 (1UL << 16)
#define H7_PERIPH_89_BIT_17 (1UL << 17)
#define H7_PERIPH_89_BIT_18 (1UL << 18)
#define H7_PERIPH_89_BIT_19 (1UL << 19)
#define H7_PERIPH_89_BIT_20 (1UL << 20)
#define H7_PERIPH_89_BIT_21 (1UL << 21)
#define H7_PERIPH_89_BIT_22 (1UL << 22)
#define H7_PERIPH_89_BIT_23 (1UL << 23)
#define H7_PERIPH_89_BIT_24 (1UL << 24)
#define H7_PERIPH_89_BIT_25 (1UL << 25)
#define H7_PERIPH_89_BIT_26 (1UL << 26)
#define H7_PERIPH_89_BIT_27 (1UL << 27)
#define H7_PERIPH_89_BIT_28 (1UL << 28)
#define H7_PERIPH_89_BIT_29 (1UL << 29)
#define H7_PERIPH_89_BIT_30 (1UL << 30)
#define H7_PERIPH_89_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_90_TypeDef;
#define H7_PERIPH_90 ((H7_PERIPH_90_TypeDef *)(0x58000000UL + 90 * 0x400UL))

#define H7_PERIPH_90_BIT_0 (1UL << 0)
#define H7_PERIPH_90_BIT_1 (1UL << 1)
#define H7_PERIPH_90_BIT_2 (1UL << 2)
#define H7_PERIPH_90_BIT_3 (1UL << 3)
#define H7_PERIPH_90_BIT_4 (1UL << 4)
#define H7_PERIPH_90_BIT_5 (1UL << 5)
#define H7_PERIPH_90_BIT_6 (1UL << 6)
#define H7_PERIPH_90_BIT_7 (1UL << 7)
#define H7_PERIPH_90_BIT_8 (1UL << 8)
#define H7_PERIPH_90_BIT_9 (1UL << 9)
#define H7_PERIPH_90_BIT_10 (1UL << 10)
#define H7_PERIPH_90_BIT_11 (1UL << 11)
#define H7_PERIPH_90_BIT_12 (1UL << 12)
#define H7_PERIPH_90_BIT_13 (1UL << 13)
#define H7_PERIPH_90_BIT_14 (1UL << 14)
#define H7_PERIPH_90_BIT_15 (1UL << 15)
#define H7_PERIPH_90_BIT_16 (1UL << 16)
#define H7_PERIPH_90_BIT_17 (1UL << 17)
#define H7_PERIPH_90_BIT_18 (1UL << 18)
#define H7_PERIPH_90_BIT_19 (1UL << 19)
#define H7_PERIPH_90_BIT_20 (1UL << 20)
#define H7_PERIPH_90_BIT_21 (1UL << 21)
#define H7_PERIPH_90_BIT_22 (1UL << 22)
#define H7_PERIPH_90_BIT_23 (1UL << 23)
#define H7_PERIPH_90_BIT_24 (1UL << 24)
#define H7_PERIPH_90_BIT_25 (1UL << 25)
#define H7_PERIPH_90_BIT_26 (1UL << 26)
#define H7_PERIPH_90_BIT_27 (1UL << 27)
#define H7_PERIPH_90_BIT_28 (1UL << 28)
#define H7_PERIPH_90_BIT_29 (1UL << 29)
#define H7_PERIPH_90_BIT_30 (1UL << 30)
#define H7_PERIPH_90_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_91_TypeDef;
#define H7_PERIPH_91 ((H7_PERIPH_91_TypeDef *)(0x58000000UL + 91 * 0x400UL))

#define H7_PERIPH_91_BIT_0 (1UL << 0)
#define H7_PERIPH_91_BIT_1 (1UL << 1)
#define H7_PERIPH_91_BIT_2 (1UL << 2)
#define H7_PERIPH_91_BIT_3 (1UL << 3)
#define H7_PERIPH_91_BIT_4 (1UL << 4)
#define H7_PERIPH_91_BIT_5 (1UL << 5)
#define H7_PERIPH_91_BIT_6 (1UL << 6)
#define H7_PERIPH_91_BIT_7 (1UL << 7)
#define H7_PERIPH_91_BIT_8 (1UL << 8)
#define H7_PERIPH_91_BIT_9 (1UL << 9)
#define H7_PERIPH_91_BIT_10 (1UL << 10)
#define H7_PERIPH_91_BIT_11 (1UL << 11)
#define H7_PERIPH_91_BIT_12 (1UL << 12)
#define H7_PERIPH_91_BIT_13 (1UL << 13)
#define H7_PERIPH_91_BIT_14 (1UL << 14)
#define H7_PERIPH_91_BIT_15 (1UL << 15)
#define H7_PERIPH_91_BIT_16 (1UL << 16)
#define H7_PERIPH_91_BIT_17 (1UL << 17)
#define H7_PERIPH_91_BIT_18 (1UL << 18)
#define H7_PERIPH_91_BIT_19 (1UL << 19)
#define H7_PERIPH_91_BIT_20 (1UL << 20)
#define H7_PERIPH_91_BIT_21 (1UL << 21)
#define H7_PERIPH_91_BIT_22 (1UL << 22)
#define H7_PERIPH_91_BIT_23 (1UL << 23)
#define H7_PERIPH_91_BIT_24 (1UL << 24)
#define H7_PERIPH_91_BIT_25 (1UL << 25)
#define H7_PERIPH_91_BIT_26 (1UL << 26)
#define H7_PERIPH_91_BIT_27 (1UL << 27)
#define H7_PERIPH_91_BIT_28 (1UL << 28)
#define H7_PERIPH_91_BIT_29 (1UL << 29)
#define H7_PERIPH_91_BIT_30 (1UL << 30)
#define H7_PERIPH_91_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_92_TypeDef;
#define H7_PERIPH_92 ((H7_PERIPH_92_TypeDef *)(0x58000000UL + 92 * 0x400UL))

#define H7_PERIPH_92_BIT_0 (1UL << 0)
#define H7_PERIPH_92_BIT_1 (1UL << 1)
#define H7_PERIPH_92_BIT_2 (1UL << 2)
#define H7_PERIPH_92_BIT_3 (1UL << 3)
#define H7_PERIPH_92_BIT_4 (1UL << 4)
#define H7_PERIPH_92_BIT_5 (1UL << 5)
#define H7_PERIPH_92_BIT_6 (1UL << 6)
#define H7_PERIPH_92_BIT_7 (1UL << 7)
#define H7_PERIPH_92_BIT_8 (1UL << 8)
#define H7_PERIPH_92_BIT_9 (1UL << 9)
#define H7_PERIPH_92_BIT_10 (1UL << 10)
#define H7_PERIPH_92_BIT_11 (1UL << 11)
#define H7_PERIPH_92_BIT_12 (1UL << 12)
#define H7_PERIPH_92_BIT_13 (1UL << 13)
#define H7_PERIPH_92_BIT_14 (1UL << 14)
#define H7_PERIPH_92_BIT_15 (1UL << 15)
#define H7_PERIPH_92_BIT_16 (1UL << 16)
#define H7_PERIPH_92_BIT_17 (1UL << 17)
#define H7_PERIPH_92_BIT_18 (1UL << 18)
#define H7_PERIPH_92_BIT_19 (1UL << 19)
#define H7_PERIPH_92_BIT_20 (1UL << 20)
#define H7_PERIPH_92_BIT_21 (1UL << 21)
#define H7_PERIPH_92_BIT_22 (1UL << 22)
#define H7_PERIPH_92_BIT_23 (1UL << 23)
#define H7_PERIPH_92_BIT_24 (1UL << 24)
#define H7_PERIPH_92_BIT_25 (1UL << 25)
#define H7_PERIPH_92_BIT_26 (1UL << 26)
#define H7_PERIPH_92_BIT_27 (1UL << 27)
#define H7_PERIPH_92_BIT_28 (1UL << 28)
#define H7_PERIPH_92_BIT_29 (1UL << 29)
#define H7_PERIPH_92_BIT_30 (1UL << 30)
#define H7_PERIPH_92_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_93_TypeDef;
#define H7_PERIPH_93 ((H7_PERIPH_93_TypeDef *)(0x58000000UL + 93 * 0x400UL))

#define H7_PERIPH_93_BIT_0 (1UL << 0)
#define H7_PERIPH_93_BIT_1 (1UL << 1)
#define H7_PERIPH_93_BIT_2 (1UL << 2)
#define H7_PERIPH_93_BIT_3 (1UL << 3)
#define H7_PERIPH_93_BIT_4 (1UL << 4)
#define H7_PERIPH_93_BIT_5 (1UL << 5)
#define H7_PERIPH_93_BIT_6 (1UL << 6)
#define H7_PERIPH_93_BIT_7 (1UL << 7)
#define H7_PERIPH_93_BIT_8 (1UL << 8)
#define H7_PERIPH_93_BIT_9 (1UL << 9)
#define H7_PERIPH_93_BIT_10 (1UL << 10)
#define H7_PERIPH_93_BIT_11 (1UL << 11)
#define H7_PERIPH_93_BIT_12 (1UL << 12)
#define H7_PERIPH_93_BIT_13 (1UL << 13)
#define H7_PERIPH_93_BIT_14 (1UL << 14)
#define H7_PERIPH_93_BIT_15 (1UL << 15)
#define H7_PERIPH_93_BIT_16 (1UL << 16)
#define H7_PERIPH_93_BIT_17 (1UL << 17)
#define H7_PERIPH_93_BIT_18 (1UL << 18)
#define H7_PERIPH_93_BIT_19 (1UL << 19)
#define H7_PERIPH_93_BIT_20 (1UL << 20)
#define H7_PERIPH_93_BIT_21 (1UL << 21)
#define H7_PERIPH_93_BIT_22 (1UL << 22)
#define H7_PERIPH_93_BIT_23 (1UL << 23)
#define H7_PERIPH_93_BIT_24 (1UL << 24)
#define H7_PERIPH_93_BIT_25 (1UL << 25)
#define H7_PERIPH_93_BIT_26 (1UL << 26)
#define H7_PERIPH_93_BIT_27 (1UL << 27)
#define H7_PERIPH_93_BIT_28 (1UL << 28)
#define H7_PERIPH_93_BIT_29 (1UL << 29)
#define H7_PERIPH_93_BIT_30 (1UL << 30)
#define H7_PERIPH_93_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_94_TypeDef;
#define H7_PERIPH_94 ((H7_PERIPH_94_TypeDef *)(0x58000000UL + 94 * 0x400UL))

#define H7_PERIPH_94_BIT_0 (1UL << 0)
#define H7_PERIPH_94_BIT_1 (1UL << 1)
#define H7_PERIPH_94_BIT_2 (1UL << 2)
#define H7_PERIPH_94_BIT_3 (1UL << 3)
#define H7_PERIPH_94_BIT_4 (1UL << 4)
#define H7_PERIPH_94_BIT_5 (1UL << 5)
#define H7_PERIPH_94_BIT_6 (1UL << 6)
#define H7_PERIPH_94_BIT_7 (1UL << 7)
#define H7_PERIPH_94_BIT_8 (1UL << 8)
#define H7_PERIPH_94_BIT_9 (1UL << 9)
#define H7_PERIPH_94_BIT_10 (1UL << 10)
#define H7_PERIPH_94_BIT_11 (1UL << 11)
#define H7_PERIPH_94_BIT_12 (1UL << 12)
#define H7_PERIPH_94_BIT_13 (1UL << 13)
#define H7_PERIPH_94_BIT_14 (1UL << 14)
#define H7_PERIPH_94_BIT_15 (1UL << 15)
#define H7_PERIPH_94_BIT_16 (1UL << 16)
#define H7_PERIPH_94_BIT_17 (1UL << 17)
#define H7_PERIPH_94_BIT_18 (1UL << 18)
#define H7_PERIPH_94_BIT_19 (1UL << 19)
#define H7_PERIPH_94_BIT_20 (1UL << 20)
#define H7_PERIPH_94_BIT_21 (1UL << 21)
#define H7_PERIPH_94_BIT_22 (1UL << 22)
#define H7_PERIPH_94_BIT_23 (1UL << 23)
#define H7_PERIPH_94_BIT_24 (1UL << 24)
#define H7_PERIPH_94_BIT_25 (1UL << 25)
#define H7_PERIPH_94_BIT_26 (1UL << 26)
#define H7_PERIPH_94_BIT_27 (1UL << 27)
#define H7_PERIPH_94_BIT_28 (1UL << 28)
#define H7_PERIPH_94_BIT_29 (1UL << 29)
#define H7_PERIPH_94_BIT_30 (1UL << 30)
#define H7_PERIPH_94_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_95_TypeDef;
#define H7_PERIPH_95 ((H7_PERIPH_95_TypeDef *)(0x58000000UL + 95 * 0x400UL))

#define H7_PERIPH_95_BIT_0 (1UL << 0)
#define H7_PERIPH_95_BIT_1 (1UL << 1)
#define H7_PERIPH_95_BIT_2 (1UL << 2)
#define H7_PERIPH_95_BIT_3 (1UL << 3)
#define H7_PERIPH_95_BIT_4 (1UL << 4)
#define H7_PERIPH_95_BIT_5 (1UL << 5)
#define H7_PERIPH_95_BIT_6 (1UL << 6)
#define H7_PERIPH_95_BIT_7 (1UL << 7)
#define H7_PERIPH_95_BIT_8 (1UL << 8)
#define H7_PERIPH_95_BIT_9 (1UL << 9)
#define H7_PERIPH_95_BIT_10 (1UL << 10)
#define H7_PERIPH_95_BIT_11 (1UL << 11)
#define H7_PERIPH_95_BIT_12 (1UL << 12)
#define H7_PERIPH_95_BIT_13 (1UL << 13)
#define H7_PERIPH_95_BIT_14 (1UL << 14)
#define H7_PERIPH_95_BIT_15 (1UL << 15)
#define H7_PERIPH_95_BIT_16 (1UL << 16)
#define H7_PERIPH_95_BIT_17 (1UL << 17)
#define H7_PERIPH_95_BIT_18 (1UL << 18)
#define H7_PERIPH_95_BIT_19 (1UL << 19)
#define H7_PERIPH_95_BIT_20 (1UL << 20)
#define H7_PERIPH_95_BIT_21 (1UL << 21)
#define H7_PERIPH_95_BIT_22 (1UL << 22)
#define H7_PERIPH_95_BIT_23 (1UL << 23)
#define H7_PERIPH_95_BIT_24 (1UL << 24)
#define H7_PERIPH_95_BIT_25 (1UL << 25)
#define H7_PERIPH_95_BIT_26 (1UL << 26)
#define H7_PERIPH_95_BIT_27 (1UL << 27)
#define H7_PERIPH_95_BIT_28 (1UL << 28)
#define H7_PERIPH_95_BIT_29 (1UL << 29)
#define H7_PERIPH_95_BIT_30 (1UL << 30)
#define H7_PERIPH_95_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_96_TypeDef;
#define H7_PERIPH_96 ((H7_PERIPH_96_TypeDef *)(0x58000000UL + 96 * 0x400UL))

#define H7_PERIPH_96_BIT_0 (1UL << 0)
#define H7_PERIPH_96_BIT_1 (1UL << 1)
#define H7_PERIPH_96_BIT_2 (1UL << 2)
#define H7_PERIPH_96_BIT_3 (1UL << 3)
#define H7_PERIPH_96_BIT_4 (1UL << 4)
#define H7_PERIPH_96_BIT_5 (1UL << 5)
#define H7_PERIPH_96_BIT_6 (1UL << 6)
#define H7_PERIPH_96_BIT_7 (1UL << 7)
#define H7_PERIPH_96_BIT_8 (1UL << 8)
#define H7_PERIPH_96_BIT_9 (1UL << 9)
#define H7_PERIPH_96_BIT_10 (1UL << 10)
#define H7_PERIPH_96_BIT_11 (1UL << 11)
#define H7_PERIPH_96_BIT_12 (1UL << 12)
#define H7_PERIPH_96_BIT_13 (1UL << 13)
#define H7_PERIPH_96_BIT_14 (1UL << 14)
#define H7_PERIPH_96_BIT_15 (1UL << 15)
#define H7_PERIPH_96_BIT_16 (1UL << 16)
#define H7_PERIPH_96_BIT_17 (1UL << 17)
#define H7_PERIPH_96_BIT_18 (1UL << 18)
#define H7_PERIPH_96_BIT_19 (1UL << 19)
#define H7_PERIPH_96_BIT_20 (1UL << 20)
#define H7_PERIPH_96_BIT_21 (1UL << 21)
#define H7_PERIPH_96_BIT_22 (1UL << 22)
#define H7_PERIPH_96_BIT_23 (1UL << 23)
#define H7_PERIPH_96_BIT_24 (1UL << 24)
#define H7_PERIPH_96_BIT_25 (1UL << 25)
#define H7_PERIPH_96_BIT_26 (1UL << 26)
#define H7_PERIPH_96_BIT_27 (1UL << 27)
#define H7_PERIPH_96_BIT_28 (1UL << 28)
#define H7_PERIPH_96_BIT_29 (1UL << 29)
#define H7_PERIPH_96_BIT_30 (1UL << 30)
#define H7_PERIPH_96_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_97_TypeDef;
#define H7_PERIPH_97 ((H7_PERIPH_97_TypeDef *)(0x58000000UL + 97 * 0x400UL))

