RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_97_BIT_0 (1UL << 0)
#define H7_PERIPH_97_BIT_1 (1UL << 1)
#define H7_PERIPH_97_BIT_2 (1UL << 2)
#define H7_PERIPH_97_BIT_3 (1UL << 3)
#define H7_PERIPH_97_BIT_4 (1UL << 4)
#define H7_PERIPH_97_BIT_5 (1UL << 5)
#define H7_PERIPH_97_BIT_6 (1UL << 6)
#define H7_PERIPH_97_BIT_7 (1UL << 7)
#define H7_PERIPH_97_BIT_8 (1UL << 8)
#define H7_PERIPH_97_BIT_9 (1UL << 9)
#define H7_PERIPH_97_BIT_10 (1UL << 10)
#define H7_PERIPH_97_BIT_11 (1UL << 11)
#define H7_PERIPH_97_BIT_12 (1UL << 12)
#define H7_PERIPH_97_BIT_13 (1UL << 13)
#define H7_PERIPH_97_BIT_14 (1UL << 14)
#define H7_PERIPH_97_BIT_15 (1UL << 15)
#define H7_PERIPH_97_BIT_16 (1UL << 16)
#define H7_PERIPH_97_BIT_17 (1UL << 17)
#define H7_PERIPH_97_BIT_18 (1UL << 18)
#define H7_PERIPH_97_BIT_19 (1UL << 19)
#define H7_PERIPH_97_BIT_20 (1UL << 20)
#define H7_PERIPH_97_BIT_21 (1UL << 21)
#define H7_PERIPH_97_BIT_22 (1UL << 22)
#define H7_PERIPH_97_BIT_23 (1UL << 23)
#define H7_PERIPH_97_BIT_24 (1UL << 24)
#define H7_PERIPH_97_BIT_25 (1UL << 25)
#define H7_PERIPH_97_BIT_26 (1UL << 26)
#define H7_PERIPH_97_BIT_27 (1UL << 27)
#define H7_PERIPH_97_BIT_28 (1UL << 28)
#define H7_PERIPH_97_BIT_29 (1UL << 29)
#define H7_PERIPH_97_BIT_30 (1UL << 30)
#define H7_PERIPH_97_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_98_TypeDef;
#define H7_PERIPH_98 ((H7_PERIPH_98_TypeDef *)(0x58000000UL + 98 * 0x400UL))

#define H7_PERIPH_98_BIT_0 (1UL << 0)
#define H7_PERIPH_98_BIT_1 (1UL << 1)
#define H7_PERIPH_98_BIT_2 (1UL << 2)
#define H7_PERIPH_98_BIT_3 (1UL << 3)
#define H7_PERIPH_98_BIT_4 (1UL << 4)
#define H7_PERIPH_98_BIT_5 (1UL << 5)
#define H7_PERIPH_98_BIT_6 (1UL << 6)
#define H7_PERIPH_98_BIT_7 (1UL << 7)
#define H7_PERIPH_98_BIT_8 (1UL << 8)
#define H7_PERIPH_98_BIT_9 (1UL << 9)
#define H7_PERIPH_98_BIT_10 (1UL << 10)
#define H7_PERIPH_98_BIT_11 (1UL << 11)
#define H7_PERIPH_98_BIT_12 (1UL << 12)
#define H7_PERIPH_98_BIT_13 (1UL << 13)
#define H7_PERIPH_98_BIT_14 (1UL << 14)
#define H7_PERIPH_98_BIT_15 (1UL << 15)
#define H7_PERIPH_98_BIT_16 (1UL << 16)
#define H7_PERIPH_98_BIT_17 (1UL << 17)
#define H7_PERIPH_98_BIT_18 (1UL << 18)
#define H7_PERIPH_98_BIT_19 (1UL << 19)
#define H7_PERIPH_98_BIT_20 (1UL << 20)
#define H7_PERIPH_98_BIT_21 (1UL << 21)
#define H7_PERIPH_98_BIT_22 (1UL << 22)
#define H7_PERIPH_98_BIT_23 (1UL << 23)
#define H7_PERIPH_98_BIT_24 (1UL << 24)
#define H7_PERIPH_98_BIT_25 (1UL << 25)
#define H7_PERIPH_98_BIT_26 (1UL << 26)
#define H7_PERIPH_98_BIT_27 (1UL << 27)
#define H7_PERIPH_98_BIT_28 (1UL << 28)
#define H7_PERIPH_98_BIT_29 (1UL << 29)
#define H7_PERIPH_98_BIT_30 (1UL << 30)
#define H7_PERIPH_98_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_99_TypeDef;
#define H7_PERIPH_99 ((H7_PERIPH_99_TypeDef *)(0x58000000UL + 99 * 0x400UL))

#define H7_PERIPH_99_BIT_0 (1UL << 0)
#define H7_PERIPH_99_BIT_1 (1UL << 1)
#define H7_PERIPH_99_BIT_2 (1UL << 2)
#define H7_PERIPH_99_BIT_3 (1UL << 3)
#define H7_PERIPH_99_BIT_4 (1UL << 4)
#define H7_PERIPH_99_BIT_5 (1UL << 5)
#define H7_PERIPH_99_BIT_6 (1UL << 6)
#define H7_PERIPH_99_BIT_7 (1UL << 7)
#define H7_PERIPH_99_BIT_8 (1UL << 8)
#define H7_PERIPH_99_BIT_9 (1UL << 9)
#define H7_PERIPH_99_BIT_10 (1UL << 10)
#define H7_PERIPH_99_BIT_11 (1UL << 11)
#define H7_PERIPH_99_BIT_12 (1UL << 12)
#define H7_PERIPH_99_BIT_13 (1UL << 13)
#define H7_PERIPH_99_BIT_14 (1UL << 14)
#define H7_PERIPH_99_BIT_15 (1UL << 15)
#define H7_PERIPH_99_BIT_16 (1UL << 16)
#define H7_PERIPH_99_BIT_17 (1UL << 17)
#define H7_PERIPH_99_BIT_18 (1UL << 18)
#define H7_PERIPH_99_BIT_19 (1UL << 19)
#define H7_PERIPH_99_BIT_20 (1UL << 20)
#define H7_PERIPH_99_BIT_21 (1UL << 21)
#define H7_PERIPH_99_BIT_22 (1UL << 22)
#define H7_PERIPH_99_BIT_23 (1UL << 23)
#define H7_PERIPH_99_BIT_24 (1UL << 24)
#define H7_PERIPH_99_BIT_25 (1UL << 25)
#define H7_PERIPH_99_BIT_26 (1UL << 26)
#define H7_PERIPH_99_BIT_27 (1UL << 27)
#define H7_PERIPH_99_BIT_28 (1UL << 28)
#define H7_PERIPH_99_BIT_29 (1UL << 29)
#define H7_PERIPH_99_BIT_30 (1UL << 30)
#define H7_PERIPH_99_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_100_TypeDef;
#define H7_PERIPH_100 ((H7_PERIPH_100_TypeDef *)(0x58000000UL + 100 * 0x400UL))

#define H7_PERIPH_100_BIT_0 (1UL << 0)
#define H7_PERIPH_100_BIT_1 (1UL << 1)
#define H7_PERIPH_100_BIT_2 (1UL << 2)
#define H7_PERIPH_100_BIT_3 (1UL << 3)
#define H7_PERIPH_100_BIT_4 (1UL << 4)
#define H7_PERIPH_100_BIT_5 (1UL << 5)
#define H7_PERIPH_100_BIT_6 (1UL << 6)
#define H7_PERIPH_100_BIT_7 (1UL << 7)
#define H7_PERIPH_100_BIT_8 (1UL << 8)
#define H7_PERIPH_100_BIT_9 (1UL << 9)
#define H7_PERIPH_100_BIT_10 (1UL << 10)
#define H7_PERIPH_100_BIT_11 (1UL << 11)
#define H7_PERIPH_100_BIT_12 (1UL << 12)
#define H7_PERIPH_100_BIT_13 (1UL << 13)
#define H7_PERIPH_100_BIT_14 (1UL << 14)
#define H7_PERIPH_100_BIT_15 (1UL << 15)
#define H7_PERIPH_100_BIT_16 (1UL << 16)
#define H7_PERIPH_100_BIT_17 (1UL << 17)
#define H7_PERIPH_100_BIT_18 (1UL << 18)
#define H7_PERIPH_100_BIT_19 (1UL << 19)
#define H7_PERIPH_100_BIT_20 (1UL << 20)
#define H7_PERIPH_100_BIT_21 (1UL << 21)
#define H7_PERIPH_100_BIT_22 (1UL << 22)
#define H7_PERIPH_100_BIT_23 (1UL << 23)
#define H7_PERIPH_100_BIT_24 (1UL << 24)
#define H7_PERIPH_100_BIT_25 (1UL << 25)
#define H7_PERIPH_100_BIT_26 (1UL << 26)
#define H7_PERIPH_100_BIT_27 (1UL << 27)
#define H7_PERIPH_100_BIT_28 (1UL << 28)
#define H7_PERIPH_100_BIT_29 (1UL << 29)
#define H7_PERIPH_100_BIT_30 (1UL << 30)
#define H7_PERIPH_100_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_101_TypeDef;
#define H7_PERIPH_101 ((H7_PERIPH_101_TypeDef *)(0x58000000UL + 101 * 0x400UL))

