RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_101_BIT_0 (1UL << 0)
#define H7_PERIPH_101_BIT_1 (1UL << 1)
#define H7_PERIPH_101_BIT_2 (1UL << 2)
#define H7_PERIPH_101_BIT_3 (1UL << 3)
#define H7_PERIPH_101_BIT_4 (1UL << 4)
#define H7_PERIPH_101_BIT_5 (1UL << 5)
#define H7_PERIPH_101_BIT_6 (1UL << 6)
#define H7_PERIPH_101_BIT_7 (1UL << 7)
#define H7_PERIPH_101_BIT_8 (1UL << 8)
#define H7_PERIPH_101_BIT_9 (1UL << 9)
#define H7_PERIPH_101_BIT_10 (1UL << 10)
#define H7_PERIPH_101_BIT_11 (1UL << 11)
#define H7_PERIPH_101_BIT_12 (1UL << 12)
#define H7_PERIPH_101_BIT_13 (1UL << 13)
#define H7_PERIPH_101_BIT_14 (1UL << 14)
#define H7_PERIPH_101_BIT_15 (1UL << 15)
#define H7_PERIPH_101_BIT_16 (1UL << 16)
#define H7_PERIPH_101_BIT_17 (1UL << 17)
#define H7_PERIPH_101_BIT_18 (1UL << 18)
#define H7_PERIPH_101_BIT_19 (1UL << 19)
#define H7_PERIPH_101_BIT_20 (1UL << 20)
#define H7_PERIPH_101_BIT_21 (1UL << 21)
#define H7_PERIPH_101_BIT_22 (1UL << 22)
#define H7_PERIPH_101_BIT_23 (1UL << 23)
#define H7_PERIPH_101_BIT_24 (1UL << 24)
#define H7_PERIPH_101_BIT_25 (1UL << 25)
#define H7_PERIPH_101_BIT_26 (1UL << 26)
#define H7_PERIPH_101_BIT_27 (1UL << 27)
#define H7_PERIPH_101_BIT_28 (1UL << 28)
#define H7_PERIPH_101_BIT_29 (1UL << 29)
#define H7_PERIPH_101_BIT_30 (1UL << 30)
#define H7_PERIPH_101_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_102_TypeDef;
#define H7_PERIPH_102 ((H7_PERIPH_102_TypeDef *)(0x58000000UL + 102 * 0x400UL))

#define H7_PERIPH_102_BIT_0 (1UL << 0)
#define H7_PERIPH_102_BIT_1 (1UL << 1)
#define H7_PERIPH_102_BIT_2 (1UL << 2)
#define H7_PERIPH_102_BIT_3 (1UL << 3)
#define H7_PERIPH_102_BIT_4 (1UL << 4)
#define H7_PERIPH_102_BIT_5 (1UL << 5)
#define H7_PERIPH_102_BIT_6 (1UL << 6)
#define H7_PERIPH_102_BIT_7 (1UL << 7)
#define H7_PERIPH_102_BIT_8 (1UL << 8)
#define H7_PERIPH_102_BIT_9 (1UL << 9)
#define H7_PERIPH_102_BIT_10 (1UL << 10)
#define H7_PERIPH_102_BIT_11 (1UL << 11)
#define H7_PERIPH_102_BIT_12 (1UL << 12)
#define H7_PERIPH_102_BIT_13 (1UL << 13)
#define H7_PERIPH_102_BIT_14 (1UL << 14)
#define H7_PERIPH_102_BIT_15 (1UL << 15)
#define H7_PERIPH_102_BIT_16 (1UL << 16)
#define H7_PERIPH_102_BIT_17 (1UL << 17)
#define H7_PERIPH_102_BIT_18 (1UL << 18)
#define H7_PERIPH_102_BIT_19 (1UL << 19)
#define H7_PERIPH_102_BIT_20 (1UL << 20)
#define H7_PERIPH_102_BIT_21 (1UL << 21)
#define H7_PERIPH_102_BIT_22 (1UL << 22)
#define H7_PERIPH_102_BIT_23 (1UL << 23)
#define H7_PERIPH_102_BIT_24 (1UL << 24)
#define H7_PERIPH_102_BIT_25 (1UL << 25)
#define H7_PERIPH_102_BIT_26 (1UL << 26)
#define H7_PERIPH_102_BIT_27 (1UL << 27)
#define H7_PERIPH_102_BIT_28 (1UL << 28)
#define H7_PERIPH_102_BIT_29 (1UL << 29)
#define H7_PERIPH_102_BIT_30 (1UL << 30)
#define H7_PERIPH_102_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_103_TypeDef;
#define H7_PERIPH_103 ((H7_PERIPH_103_TypeDef *)(0x58000000UL + 103 * 0x400UL))

#define H7_PERIPH_103_BIT_0 (1UL << 0)
#define H7_PERIPH_103_BIT_1 (1UL << 1)
#define H7_PERIPH_103_BIT_2 (1UL << 2)
#define H7_PERIPH_103_BIT_3 (1UL << 3)
#define H7_PERIPH_103_BIT_4 (1UL << 4)
#define H7_PERIPH_103_BIT_5 (1UL << 5)
#define H7_PERIPH_103_BIT_6 (1UL << 6)
#define H7_PERIPH_103_BIT_7 (1UL << 7)
#define H7_PERIPH_103_BIT_8 (1UL << 8)
#define H7_PERIPH_103_BIT_9 (1UL << 9)
#define H7_PERIPH_103_BIT_10 (1UL << 10)
#define H7_PERIPH_103_BIT_11 (1UL << 11)
#define H7_PERIPH_103_BIT_12 (1UL << 12)
#define H7_PERIPH_103_BIT_13 (1UL << 13)
#define H7_PERIPH_103_BIT_14 (1UL << 14)
#define H7_PERIPH_103_BIT_15 (1UL << 15)
#define H7_PERIPH_103_BIT_16 (1UL << 16)
#define H7_PERIPH_103_BIT_17 (1UL << 17)
#define H7_PERIPH_103_BIT_18 (1UL << 18)
#define H7_PERIPH_103_BIT_19 (1UL << 19)
#define H7_PERIPH_103_BIT_20 (1UL << 20)
#define H7_PERIPH_103_BIT_21 (1UL << 21)
#define H7_PERIPH_103_BIT_22 (1UL << 22)
#define H7_PERIPH_103_BIT_23 (1UL << 23)
#define H7_PERIPH_103_BIT_24 (1UL << 24)
#define H7_PERIPH_103_BIT_25 (1UL << 25)
#define H7_PERIPH_103_BIT_26 (1UL << 26)
#define H7_PERIPH_103_BIT_27 (1UL << 27)
#define H7_PERIPH_103_BIT_28 (1UL << 28)
#define H7_PERIPH_103_BIT_29 (1UL << 29)
#define H7_PERIPH_103_BIT_30 (1UL << 30)
#define H7_PERIPH_103_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_104_TypeDef;
#define H7_PERIPH_104 ((H7_PERIPH_104_TypeDef *)(0x58000000UL + 104 * 0x400UL))

#define H7_PERIPH_104_BIT_0 (1UL << 0)
#define H7_PERIPH_104_BIT_1 (1UL << 1)
#define H7_PERIPH_104_BIT_2 (1UL << 2)
#define H7_PERIPH_104_BIT_3 (1UL << 3)
#define H7_PERIPH_104_BIT_4 (1UL << 4)
#define H7_PERIPH_104_BIT_5 (1UL << 5)
#define H7_PERIPH_104_BIT_6 (1UL << 6)
#define H7_PERIPH_104_BIT_7 (1UL << 7)
#define H7_PERIPH_104_BIT_8 (1UL << 8)
#define H7_PERIPH_104_BIT_9 (1UL << 9)
#define H7_PERIPH_104_BIT_10 (1UL << 10)
#define H7_PERIPH_104_BIT_11 (1UL << 11)
#define H7_PERIPH_104_BIT_12 (1UL << 12)
#define H7_PERIPH_104_BIT_13 (1UL << 13)
#define H7_PERIPH_104_BIT_14 (1UL << 14)
#define H7_PERIPH_104_BIT_15 (1UL << 15)
#define H7_PERIPH_104_BIT_16 (1UL << 16)
#define H7_PERIPH_104_BIT_17 (1UL << 17)
#define H7_PERIPH_104_BIT_18 (1UL << 18)
#define H7_PERIPH_104_BIT_19 (1UL << 19)
#define H7_PERIPH_104_BIT_20 (1UL << 20)
#define H7_PERIPH_104_BIT_21 (1UL << 21)
#define H7_PERIPH_104_BIT_22 (1UL << 22)
#define H7_PERIPH_104_BIT_23 (1UL << 23)
#define H7_PERIPH_104_BIT_24 (1UL << 24)
#define H7_PERIPH_104_BIT_25 (1UL << 25)
#define H7_PERIPH_104_BIT_26 (1UL << 26)
#define H7_PERIPH_104_BIT_27 (1UL << 27)
#define H7_PERIPH_104_BIT_28 (1UL << 28)
#define H7_PERIPH_104_BIT_29 (1UL << 29)
#define H7_PERIPH_104_BIT_30 (1UL << 30)
#define H7_PERIPH_104_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_105_TypeDef;
#define H7_PERIPH_105 ((H7_PERIPH_105_TypeDef *)(0x58000000UL + 105 * 0x400UL))

#define H7_PERIPH_105_BIT_0 (1UL << 0)
#define H7_PERIPH_105_BIT_1 (1UL << 1)
#define H7_PERIPH_105_BIT_2 (1UL << 2)
#define H7_PERIPH_105_BIT_3 (1UL << 3)
#define H7_PERIPH_105_BIT_4 (1UL << 4)
#define H7_PERIPH_105_BIT_5 (1UL << 5)
#define H7_PERIPH_105_BIT_6 (1UL << 6)
#define H7_PERIPH_105_BIT_7 (1UL << 7)
#define H7_PERIPH_105_BIT_8 (1UL << 8)
#define H7_PERIPH_105_BIT_9 (1UL << 9)
#define H7_PERIPH_105_BIT_10 (1UL << 10)
#define H7_PERIPH_105_BIT_11 (1UL << 11)
#define H7_PERIPH_105_BIT_12 (1UL << 12)
#define H7_PERIPH_105_BIT_13 (1UL << 13)
#define H7_PERIPH_105_BIT_14 (1UL << 14)
#define H7_PERIPH_105_BIT_15 (1UL << 15)
#define H7_PERIPH_105_BIT_16 (1UL << 16)
#define H7_PERIPH_105_BIT_17 (1UL << 17)
#define H7_PERIPH_105_BIT_18 (1UL << 18)
#define H7_PERIPH_105_BIT_19 (1UL << 19)
#define H7_PERIPH_105_BIT_20 (1UL << 20)
#define H7_PERIPH_105_BIT_21 (1UL << 21)
#define H7_PERIPH_105_BIT_22 (1UL << 22)
#define H7_PERIPH_105_BIT_23 (1UL << 23)
#define H7_PERIPH_105_BIT_24 (1UL << 24)
#define H7_PERIPH_105_BIT_25 (1UL << 25)
#define H7_PERIPH_105_BIT_26 (1UL << 26)
#define H7_PERIPH_105_BIT_27 (1UL << 27)
#define H7_PERIPH_105_BIT_28 (1UL << 28)
#define H7_PERIPH_105_BIT_29 (1UL << 29)
#define H7_PERIPH_105_BIT_30 (1UL << 30)
#define H7_PERIPH_105_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_106_TypeDef;
#define H7_PERIPH_106 ((H7_PERIPH_106_TypeDef *)(0x58000000UL + 106 * 0x400UL))

