RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_106_BIT_0 (1UL << 0)
#define H7_PERIPH_106_BIT_1 (1UL << 1)
#define H7_PERIPH_106_BIT_2 (1UL << 2)
#define H7_PERIPH_106_BIT_3 (1UL << 3)
#define H7_PERIPH_106_BIT_4 (1UL << 4)
#define H7_PERIPH_106_BIT_5 (1UL << 5)
#define H7_PERIPH_106_BIT_6 (1UL << 6)
#define H7_PERIPH_106_BIT_7 (1UL << 7)
#define H7_PERIPH_106_BIT_8 (1UL << 8)
#define H7_PERIPH_106_BIT_9 (1UL << 9)
#define H7_PERIPH_106_BIT_10 (1UL << 10)
#define H7_PERIPH_106_BIT_11 (1UL << 11)
#define H7_PERIPH_106_BIT_12 (1UL << 12)
#define H7_PERIPH_106_BIT_13 (1UL << 13)
#define H7_PERIPH_106_BIT_14 (1UL << 14)
#define H7_PERIPH_106_BIT_15 (1UL << 15)
#define H7_PERIPH_106_BIT_16 (1UL << 16)
#define H7_PERIPH_106_BIT_17 (1UL << 17)
#define H7_PERIPH_106_BIT_18 (1UL << 18)
#define H7_PERIPH_106_BIT_19 (1UL << 19)
#define H7_PERIPH_106_BIT_20 (1UL << 20)
#define H7_PERIPH_106_BIT_21 (1UL << 21)
#define H7_PERIPH_106_BIT_22 (1UL << 22)
#define H7_PERIPH_106_BIT_23 (1UL << 23)
#define H7_PERIPH_106_BIT_24 (1UL << 24)
#define H7_PERIPH_106_BIT_25 (1UL << 25)
#define H7_PERIPH_106_BIT_26 (1UL << 26)
#define H7_PERIPH_106_BIT_27 (1UL << 27)
#define H7_PERIPH_106_BIT_28 (1UL << 28)
#define H7_PERIPH_106_BIT_29 (1UL << 29)
#define H7_PERIPH_106_BIT_30 (1UL << 30)
#define H7_PERIPH_106_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_107_TypeDef;
#define H7_PERIPH_107 ((H7_PERIPH_107_TypeDef *)(0x58000000UL + 107 * 0x400UL))

#define H7_PERIPH_107_BIT_0 (1UL << 0)
#define H7_PERIPH_107_BIT_1 (1UL << 1)
#define H7_PERIPH_107_BIT_2 (1UL << 2)
#define H7_PERIPH_107_BIT_3 (1UL << 3)
#define H7_PERIPH_107_BIT_4 (1UL << 4)
#define H7_PERIPH_107_BIT_5 (1UL << 5)
#define H7_PERIPH_107_BIT_6 (1UL << 6)
#define H7_PERIPH_107_BIT_7 (1UL << 7)
#define H7_PERIPH_107_BIT_8 (1UL << 8)
#define H7_PERIPH_107_BIT_9 (1UL << 9)
#define H7_PERIPH_107_BIT_10 (1UL << 10)
#define H7_PERIPH_107_BIT_11 (1UL << 11)
#define H7_PERIPH_107_BIT_12 (1UL << 12)
#define H7_PERIPH_107_BIT_13 (1UL << 13)
#define H7_PERIPH_107_BIT_14 (1UL << 14)
#define H7_PERIPH_107_BIT_15 (1UL << 15)
#define H7_PERIPH_107_BIT_16 (1UL << 16)
#define H7_PERIPH_107_BIT_17 (1UL << 17)
#define H7_PERIPH_107_BIT_18 (1UL << 18)
#define H7_PERIPH_107_BIT_19 (1UL << 19)
#define H7_PERIPH_107_BIT_20 (1UL << 20)
#define H7_PERIPH_107_BIT_21 (1UL << 21)
#define H7_PERIPH_107_BIT_22 (1UL << 22)
#define H7_PERIPH_107_BIT_23 (1UL << 23)
#define H7_PERIPH_107_BIT_24 (1UL << 24)
#define H7_PERIPH_107_BIT_25 (1UL << 25)
#define H7_PERIPH_107_BIT_26 (1UL << 26)
#define H7_PERIPH_107_BIT_27 (1UL << 27)
#define H7_PERIPH_107_BIT_28 (1UL << 28)
#define H7_PERIPH_107_BIT_29 (1UL << 29)
#define H7_PERIPH_107_BIT_30 (1UL << 30)
#define H7_PERIPH_107_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_108_TypeDef;
#define H7_PERIPH_108 ((H7_PERIPH_108_TypeDef *)(0x58000000UL + 108 * 0x400UL))

#define H7_PERIPH_108_BIT_0 (1UL << 0)
#define H7_PERIPH_108_BIT_1 (1UL << 1)
#define H7_PERIPH_108_BIT_2 (1UL << 2)
#define H7_PERIPH_108_BIT_3 (1UL << 3)
#define H7_PERIPH_108_BIT_4 (1UL << 4)
#define H7_PERIPH_108_BIT_5 (1UL << 5)
#define H7_PERIPH_108_BIT_6 (1UL << 6)
#define H7_PERIPH_108_BIT_7 (1UL << 7)
#define H7_PERIPH_108_BIT_8 (1UL << 8)
#define H7_PERIPH_108_BIT_9 (1UL << 9)
#define H7_PERIPH_108_BIT_10 (1UL << 10)
#define H7_PERIPH_108_BIT_11 (1UL << 11)
#define H7_PERIPH_108_BIT_12 (1UL << 12)
#define H7_PERIPH_108_BIT_13 (1UL << 13)
#define H7_PERIPH_108_BIT_14 (1UL << 14)
#define H7_PERIPH_108_BIT_15 (1UL << 15)
#define H7_PERIPH_108_BIT_16 (1UL << 16)
#define H7_PERIPH_108_BIT_17 (1UL << 17)
#define H7_PERIPH_108_BIT_18 (1UL << 18)
#define H7_PERIPH_108_BIT_19 (1UL << 19)
#define H7_PERIPH_108_BIT_20 (1UL << 20)
#define H7_PERIPH_108_BIT_21 (1UL << 21)
#define H7_PERIPH_108_BIT_22 (1UL << 22)
#define H7_PERIPH_108_BIT_23 (1UL << 23)
#define H7_PERIPH_108_BIT_24 (1UL << 24)
#define H7_PERIPH_108_BIT_25 (1UL << 25)
#define H7_PERIPH_108_BIT_26 (1UL << 26)
#define H7_PERIPH_108_BIT_27 (1UL << 27)
#define H7_PERIPH_108_BIT_28 (1UL << 28)
#define H7_PERIPH_108_BIT_29 (1UL << 29)
#define H7_PERIPH_108_BIT_30 (1UL << 30)
#define H7_PERIPH_108_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_109_TypeDef;
#define H7_PERIPH_109 ((H7_PERIPH_109_TypeDef *)(0x58000000UL + 109 * 0x400UL))

#define H7_PERIPH_109_BIT_0 (1UL << 0)
#define H7_PERIPH_109_BIT_1 (1UL << 1)
#define H7_PERIPH_109_BIT_2 (1UL << 2)
#define H7_PERIPH_109_BIT_3 (1UL << 3)
#define H7_PERIPH_109_BIT_4 (1UL << 4)
#define H7_PERIPH_109_BIT_5 (1UL << 5)
#define H7_PERIPH_109_BIT_6 (1UL << 6)
#define H7_PERIPH_109_BIT_7 (1UL << 7)
#define H7_PERIPH_109_BIT_8 (1UL << 8)
#define H7_PERIPH_109_BIT_9 (1UL << 9)
#define H7_PERIPH_109_BIT_10 (1UL << 10)
#define H7_PERIPH_109_BIT_11 (1UL << 11)
#define H7_PERIPH_109_BIT_12 (1UL << 12)
#define H7_PERIPH_109_BIT_13 (1UL << 13)
#define H7_PERIPH_109_BIT_14 (1UL << 14)
#define H7_PERIPH_109_BIT_15 (1UL << 15)
#define H7_PERIPH_109_BIT_16 (1UL << 16)
#define H7_PERIPH_109_BIT_17 (1UL << 17)
#define H7_PERIPH_109_BIT_18 (1UL << 18)
#define H7_PERIPH_109_BIT_19 (1UL << 19)
#define H7_PERIPH_109_BIT_20 (1UL << 20)
#define H7_PERIPH_109_BIT_21 (1UL << 21)
#define H7_PERIPH_109_BIT_22 (1UL << 22)
#define H7_PERIPH_109_BIT_23 (1UL << 23)
#define H7_PERIPH_109_BIT_24 (1UL << 24)
#define H7_PERIPH_109_BIT_25 (1UL << 25)
#define H7_PERIPH_109_BIT_26 (1UL << 26)
#define H7_PERIPH_109_BIT_27 (1UL << 27)
#define H7_PERIPH_109_BIT_28 (1UL << 28)
#define H7_PERIPH_109_BIT_29 (1UL << 29)
#define H7_PERIPH_109_BIT_30 (1UL << 30)
#define H7_PERIPH_109_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_110_TypeDef;
#define H7_PERIPH_110 ((H7_PERIPH_110_TypeDef *)(0x58000000UL + 110 * 0x400UL))

#define H7_PERIPH_110_BIT_0 (1UL << 0)
#define H7_PERIPH_110_BIT_1 (1UL << 1)
#define H7_PERIPH_110_BIT_2 (1UL << 2)
#define H7_PERIPH_110_BIT_3 (1UL << 3)
#define H7_PERIPH_110_BIT_4 (1UL << 4)
#define H7_PERIPH_110_BIT_5 (1UL << 5)
#define H7_PERIPH_110_BIT_6 (1UL << 6)
#define H7_PERIPH_110_BIT_7 (1UL << 7)
#define H7_PERIPH_110_BIT_8 (1UL << 8)
#define H7_PERIPH_110_BIT_9 (1UL << 9)
#define H7_PERIPH_110_BIT_10 (1UL << 10)
#define H7_PERIPH_110_BIT_11 (1UL << 11)
#define H7_PERIPH_110_BIT_12 (1UL << 12)
#define H7_PERIPH_110_BIT_13 (1UL << 13)
#define H7_PERIPH_110_BIT_14 (1UL << 14)
#define H7_PERIPH_110_BIT_15 (1UL << 15)
#define H7_PERIPH_110_BIT_16 (1UL << 16)
#define H7_PERIPH_110_BIT_17 (1UL << 17)
#define H7_PERIPH_110_BIT_18 (1UL << 18)
#define H7_PERIPH_110_BIT_19 (1UL << 19)
#define H7_PERIPH_110_BIT_20 (1UL << 20)
#define H7_PERIPH_110_BIT_21 (1UL << 21)
#define H7_PERIPH_110_BIT_22 (1UL << 22)
#define H7_PERIPH_110_BIT_23 (1UL << 23)
#define H7_PERIPH_110_BIT_24 (1UL << 24)
#define H7_PERIPH_110_BIT_25 (1UL << 25)
#define H7_PERIPH_110_BIT_26 (1UL << 26)
#define H7_PERIPH_110_BIT_27 (1UL << 27)
#define H7_PERIPH_110_BIT_28 (1UL << 28)
#define H7_PERIPH_110_BIT_29 (1UL << 29)
#define H7_PERIPH_110_BIT_30 (1UL << 30)
#define H7_PERIPH_110_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_111_TypeDef;
#define H7_PERIPH_111 ((H7_PERIPH_111_TypeDef *)(0x58000000UL + 111 * 0x400UL))

