RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_116_BIT_0 (1UL << 0)
#define H7_PERIPH_116_BIT_1 (1UL << 1)
#define H7_PERIPH_116_BIT_2 (1UL << 2)
#define H7_PERIPH_116_BIT_3 (1UL << 3)
#define H7_PERIPH_116_BIT_4 (1UL << 4)
#define H7_PERIPH_116_BIT_5 (1UL << 5)
#define H7_PERIPH_116_BIT_6 (1UL << 6)
#define H7_PERIPH_116_BIT_7 (1UL << 7)
#define H7_PERIPH_116_BIT_8 (1UL << 8)
#define H7_PERIPH_116_BIT_9 (1UL << 9)
#define H7_PERIPH_116_BIT_10 (1UL << 10)
#define H7_PERIPH_116_BIT_11 (1UL << 11)
#define H7_PERIPH_116_BIT_12 (1UL << 12)
#define H7_PERIPH_116_BIT_13 (1UL << 13)
#define H7_PERIPH_116_BIT_14 (1UL << 14)
#define H7_PERIPH_116_BIT_15 (1UL << 15)
#define H7_PERIPH_116_BIT_16 (1UL << 16)
#define H7_PERIPH_116_BIT_17 (1UL << 17)
#define H7_PERIPH_116_BIT_18 (1UL << 18)
#define H7_PERIPH_116_BIT_19 (1UL << 19)
#define H7_PERIPH_116_BIT_20 (1UL << 20)
#define H7_PERIPH_116_BIT_21 (1UL << 21)
#define H7_PERIPH_116_BIT_22 (1UL << 22)
#define H7_PERIPH_116_BIT_23 (1UL << 23)
#define H7_PERIPH_116_BIT_24 (1UL << 24)
#define H7_PERIPH_116_BIT_25 (1UL << 25)
#define H7_PERIPH_116_BIT_26 (1UL << 26)
#define H7_PERIPH_116_BIT_27 (1UL << 27)
#define H7_PERIPH_116_BIT_28 (1UL << 28)
#define H7_PERIPH_116_BIT_29 (1UL << 29)
#define H7_PERIPH_116_BIT_30 (1UL << 30)
#define H7_PERIPH_116_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_117_TypeDef;
#define H7_PERIPH_117 ((H7_PERIPH_117_TypeDef *)(0x58000000UL + 117 * 0x400UL))

#define H7_PERIPH_117_BIT_0 (1UL << 0)
#define H7_PERIPH_117_BIT_1 (1UL << 1)
#define H7_PERIPH_117_BIT_2 (1UL << 2)
#define H7_PERIPH_117_BIT_3 (1UL << 3)
#define H7_PERIPH_117_BIT_4 (1UL << 4)
#define H7_PERIPH_117_BIT_5 (1UL << 5)
#define H7_PERIPH_117_BIT_6 (1UL << 6)
#define H7_PERIPH_117_BIT_7 (1UL << 7)
#define H7_PERIPH_117_BIT_8 (1UL << 8)
#define H7_PERIPH_117_BIT_9 (1UL << 9)
#define H7_PERIPH_117_BIT_10 (1UL << 10)
#define H7_PERIPH_117_BIT_11 (1UL << 11)
#define H7_PERIPH_117_BIT_12 (1UL << 12)
#define H7_PERIPH_117_BIT_13 (1UL << 13)
#define H7_PERIPH_117_BIT_14 (1UL << 14)
#define H7_PERIPH_117_BIT_15 (1UL << 15)
#define H7_PERIPH_117_BIT_16 (1UL << 16)
#define H7_PERIPH_117_BIT_17 (1UL << 17)
#define H7_PERIPH_117_BIT_18 (1UL << 18)
#define H7_PERIPH_117_BIT_19 (1UL << 19)
#define H7_PERIPH_117_BIT_20 (1UL << 20)
#define H7_PERIPH_117_BIT_21 (1UL << 21)
#define H7_PERIPH_117_BIT_22 (1UL << 22)
#define H7_PERIPH_117_BIT_23 (1UL << 23)
#define H7_PERIPH_117_BIT_24 (1UL << 24)
#define H7_PERIPH_117_BIT_25 (1UL << 25)
#define H7_PERIPH_117_BIT_26 (1UL << 26)
#define H7_PERIPH_117_BIT_27 (1UL << 27)
#define H7_PERIPH_117_BIT_28 (1UL << 28)
#define H7_PERIPH_117_BIT_29 (1UL << 29)
#define H7_PERIPH_117_BIT_30 (1UL << 30)
#define H7_PERIPH_117_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_118_TypeDef;
#define H7_PERIPH_118 ((H7_PERIPH_118_TypeDef *)(0x58000000UL + 118 * 0x400UL))

#define H7_PERIPH_118_BIT_0 (1UL << 0)
#define H7_PERIPH_118_BIT_1 (1UL << 1)
#define H7_PERIPH_118_BIT_2 (1UL << 2)
#define H7_PERIPH_118_BIT_3 (1UL << 3)
#define H7_PERIPH_118_BIT_4 (1UL << 4)
#define H7_PERIPH_118_BIT_5 (1UL << 5)
#define H7_PERIPH_118_BIT_6 (1UL << 6)
#define H7_PERIPH_118_BIT_7 (1UL << 7)
#define H7_PERIPH_118_BIT_8 (1UL << 8)
#define H7_PERIPH_118_BIT_9 (1UL << 9)
#define H7_PERIPH_118_BIT_10 (1UL << 10)
#define H7_PERIPH_118_BIT_11 (1UL << 11)
#define H7_PERIPH_118_BIT_12 (1UL << 12)
#define H7_PERIPH_118_BIT_13 (1UL << 13)
#define H7_PERIPH_118_BIT_14 (1UL << 14)
#define H7_PERIPH_118_BIT_15 (1UL << 15)
#define H7_PERIPH_118_BIT_16 (1UL << 16)
#define H7_PERIPH_118_BIT_17 (1UL << 17)
#define H7_PERIPH_118_BIT_18 (1UL << 18)
#define H7_PERIPH_118_BIT_19 (1UL << 19)
#define H7_PERIPH_118_BIT_20 (1UL << 20)
#define H7_PERIPH_118_BIT_21 (1UL << 21)
#define H7_PERIPH_118_BIT_22 (1UL << 22)
#define H7_PERIPH_118_BIT_23 (1UL << 23)
#define H7_PERIPH_118_BIT_24 (1UL << 24)
#define H7_PERIPH_118_BIT_25 (1UL << 25)
#define H7_PERIPH_118_BIT_26 (1UL << 26)
#define H7_PERIPH_118_BIT_27 (1UL << 27)
#define H7_PERIPH_118_BIT_28 (1UL << 28)
#define H7_PERIPH_118_BIT_29 (1UL << 29)
#define H7_PERIPH_118_BIT_30 (1UL << 30)
#define H7_PERIPH_118_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_119_TypeDef;
#define H7_PERIPH_119 ((H7_PERIPH_119_TypeDef *)(0x58000000UL + 119 * 0x400UL))

#define H7_PERIPH_119_BIT_0 (1UL << 0)
#define H7_PERIPH_119_BIT_1 (1UL << 1)
#define H7_PERIPH_119_BIT_2 (1UL << 2)
#define H7_PERIPH_119_BIT_3 (1UL << 3)
#define H7_PERIPH_119_BIT_4 (1UL << 4)
#define H7_PERIPH_119_BIT_5 (1UL << 5)
#define H7_PERIPH_119_BIT_6 (1UL << 6)
#define H7_PERIPH_119_BIT_7 (1UL << 7)
#define H7_PERIPH_119_BIT_8 (1UL << 8)
#define H7_PERIPH_119_BIT_9 (1UL << 9)
#define H7_PERIPH_119_BIT_10 (1UL << 10)
#define H7_PERIPH_119_BIT_11 (1UL << 11)
#define H7_PERIPH_119_BIT_12 (1UL << 12)
#define H7_PERIPH_119_BIT_13 (1UL << 13)
#define H7_PERIPH_119_BIT_14 (1UL << 14)
#define H7_PERIPH_119_BIT_15 (1UL << 15)
#define H7_PERIPH_119_BIT_16 (1UL << 16)
#define H7_PERIPH_119_BIT_17 (1UL << 17)
#define H7_PERIPH_119_BIT_18 (1UL << 18)
#define H7_PERIPH_119_BIT_19 (1UL << 19)
#define H7_PERIPH_119_BIT_20 (1UL << 20)
#define H7_PERIPH_119_BIT_21 (1UL << 21)
#define H7_PERIPH_119_BIT_22 (1UL << 22)
#define H7_PERIPH_119_BIT_23 (1UL << 23)
#define H7_PERIPH_119_BIT_24 (1UL << 24)
#define H7_PERIPH_119_BIT_25 (1UL << 25)
#define H7_PERIPH_119_BIT_26 (1UL << 26)
#define H7_PERIPH_119_BIT_27 (1UL << 27)
#define H7_PERIPH_119_BIT_28 (1UL << 28)
#define H7_PERIPH_119_BIT_29 (1UL << 29)
#define H7_PERIPH_119_BIT_30 (1UL << 30)
#define H7_PERIPH_119_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_120_TypeDef;
#define H7_PERIPH_120 ((H7_PERIPH_120_TypeDef *)(0x58000000UL + 120 * 0x400UL))

