RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_137_BIT_0 (1UL << 0)
#define H7_PERIPH_137_BIT_1 (1UL << 1)
#define H7_PERIPH_137_BIT_2 (1UL << 2)
#define H7_PERIPH_137_BIT_3 (1UL << 3)
#define H7_PERIPH_137_BIT_4 (1UL << 4)
#define H7_PERIPH_137_BIT_5 (1UL << 5)
#define H7_PERIPH_137_BIT_6 (1UL << 6)
#define H7_PERIPH_137_BIT_7 (1UL << 7)
#define H7_PERIPH_137_BIT_8 (1UL << 8)
#define H7_PERIPH_137_BIT_9 (1UL << 9)
#define H7_PERIPH_137_BIT_10 (1UL << 10)
#define H7_PERIPH_137_BIT_11 (1UL << 11)
#define H7_PERIPH_137_BIT_12 (1UL << 12)
#define H7_PERIPH_137_BIT_13 (1UL << 13)
#define H7_PERIPH_137_BIT_14 (1UL << 14)
#define H7_PERIPH_137_BIT_15 (1UL << 15)
#define H7_PERIPH_137_BIT_16 (1UL << 16)
#define H7_PERIPH_137_BIT_17 (1UL << 17)
#define H7_PERIPH_137_BIT_18 (1UL << 18)
#define H7_PERIPH_137_BIT_19 (1UL << 19)
#define H7_PERIPH_137_BIT_20 (1UL << 20)
#define H7_PERIPH_137_BIT_21 (1UL << 21)
#define H7_PERIPH_137_BIT_22 (1UL << 22)
#define H7_PERIPH_137_BIT_23 (1UL << 23)
#define H7_PERIPH_137_BIT_24 (1UL << 24)
#define H7_PERIPH_137_BIT_25 (1UL << 25)
#define H7_PERIPH_137_BIT_26 (1UL << 26)
#define H7_PERIPH_137_BIT_27 (1UL << 27)
#define H7_PERIPH_137_BIT_28 (1UL << 28)
#define H7_PERIPH_137_BIT_29 (1UL << 29)
#define H7_PERIPH_137_BIT_30 (1UL << 30)
#define H7_PERIPH_137_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_138_TypeDef;
#define H7_PERIPH_138 ((H7_PERIPH_138_TypeDef *)(0x58000000UL + 138 * 0x400UL))

#define H7_PERIPH_138_BIT_0 (1UL << 0)
#define H7_PERIPH_138_BIT_1 (1UL << 1)
#define H7_PERIPH_138_BIT_2 (1UL << 2)
#define H7_PERIPH_138_BIT_3 (1UL << 3)
#define H7_PERIPH_138_BIT_4 (1UL << 4)
#define H7_PERIPH_138_BIT_5 (1UL << 5)
#define H7_PERIPH_138_BIT_6 (1UL << 6)
#define H7_PERIPH_138_BIT_7 (1UL << 7)
#define H7_PERIPH_138_BIT_8 (1UL << 8)
#define H7_PERIPH_138_BIT_9 (1UL << 9)
#define H7_PERIPH_138_BIT_10 (1UL << 10)
#define H7_PERIPH_138_BIT_11 (1UL << 11)
#define H7_PERIPH_138_BIT_12 (1UL << 12)
#define H7_PERIPH_138_BIT_13 (1UL << 13)
#define H7_PERIPH_138_BIT_14 (1UL << 14)
#define H7_PERIPH_138_BIT_15 (1UL << 15)
#define H7_PERIPH_138_BIT_16 (1UL << 16)
#define H7_PERIPH_138_BIT_17 (1UL << 17)
#define H7_PERIPH_138_BIT_18 (1UL << 18)
#define H7_PERIPH_138_BIT_19 (1UL << 19)
#define H7_PERIPH_138_BIT_20 (1UL << 20)
#define H7_PERIPH_138_BIT_21 (1UL << 21)
#define H7_PERIPH_138_BIT_22 (1UL << 22)
#define H7_PERIPH_138_BIT_23 (1UL << 23)
#define H7_PERIPH_138_BIT_24 (1UL << 24)
#define H7_PERIPH_138_BIT_25 (1UL << 25)
#define H7_PERIPH_138_BIT_26 (1UL << 26)
#define H7_PERIPH_138_BIT_27 (1UL << 27)
#define H7_PERIPH_138_BIT_28 (1UL << 28)
#define H7_PERIPH_138_BIT_29 (1UL << 29)
#define H7_PERIPH_138_BIT_30 (1UL << 30)
#define H7_PERIPH_138_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_139_TypeDef;
#define H7_PERIPH_139 ((H7_PERIPH_139_TypeDef *)(0x58000000UL + 139 * 0x400UL))

#define H7_PERIPH_139_BIT_0 (1UL << 0)
#define H7_PERIPH_139_BIT_1 (1UL << 1)
#define H7_PERIPH_139_BIT_2 (1UL << 2)
#define H7_PERIPH_139_BIT_3 (1UL << 3)
#define H7_PERIPH_139_BIT_4 (1UL << 4)
#define H7_PERIPH_139_BIT_5 (1UL << 5)
#define H7_PERIPH_139_BIT_6 (1UL << 6)
#define H7_PERIPH_139_BIT_7 (1UL << 7)
#define H7_PERIPH_139_BIT_8 (1UL << 8)
#define H7_PERIPH_139_BIT_9 (1UL << 9)
#define H7_PERIPH_139_BIT_10 (1UL << 10)
#define H7_PERIPH_139_BIT_11 (1UL << 11)
#define H7_PERIPH_139_BIT_12 (1UL << 12)
#define H7_PERIPH_139_BIT_13 (1UL << 13)
#define H7_PERIPH_139_BIT_14 (1UL << 14)
#define H7_PERIPH_139_BIT_15 (1UL << 15)
#define H7_PERIPH_139_BIT_16 (1UL << 16)
#define H7_PERIPH_139_BIT_17 (1UL << 17)
#define H7_PERIPH_139_BIT_18 (1UL << 18)
#define H7_PERIPH_139_BIT_19 (1UL << 19)
#define H7_PERIPH_139_BIT_20 (1UL << 20)
#define H7_PERIPH_139_BIT_21 (1UL << 21)
#define H7_PERIPH_139_BIT_22 (1UL << 22)
#define H7_PERIPH_139_BIT_23 (1UL << 23)
#define H7_PERIPH_139_BIT_24 (1UL << 24)
#define H7_PERIPH_139_BIT_25 (1UL << 25)
#define H7_PERIPH_139_BIT_26 (1UL << 26)
#define H7_PERIPH_139_BIT_27 (1UL << 27)
#define H7_PERIPH_139_BIT_28 (1UL << 28)
#define H7_PERIPH_139_BIT_29 (1UL << 29)
#define H7_PERIPH_139_BIT_30 (1UL << 30)
#define H7_PERIPH_139_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_140_TypeDef;
#define H7_PERIPH_140 ((H7_PERIPH_140_TypeDef *)(0x58000000UL + 140 * 0x400UL))

#define H7_PERIPH_140_BIT_0 (1UL << 0)
#define H7_PERIPH_140_BIT_1 (1UL << 1)
#define H7_PERIPH_140_BIT_2 (1UL << 2)
#define H7_PERIPH_140_BIT_3 (1UL << 3)
#define H7_PERIPH_140_BIT_4 (1UL << 4)
#define H7_PERIPH_140_BIT_5 (1UL << 5)
#define H7_PERIPH_140_BIT_6 (1UL << 6)
#define H7_PERIPH_140_BIT_7 (1UL << 7)
#define H7_PERIPH_140_BIT_8 (1UL << 8)
#define H7_PERIPH_140_BIT_9 (1UL << 9)
#define H7_PERIPH_140_BIT_10 (1UL << 10)
#define H7_PERIPH_140_BIT_11 (1UL << 11)
#define H7_PERIPH_140_BIT_12 (1UL << 12)
#define H7_PERIPH_140_BIT_13 (1UL << 13)
#define H7_PERIPH_140_BIT_14 (1UL << 14)
#define H7_PERIPH_140_BIT_15 (1UL << 15)
#define H7_PERIPH_140_BIT_16 (1UL << 16)
#define H7_PERIPH_140_BIT_17 (1UL << 17)
#define H7_PERIPH_140_BIT_18 (1UL << 18)
#define H7_PERIPH_140_BIT_19 (1UL << 19)
#define H7_PERIPH_140_BIT_20 (1UL << 20)
#define H7_PERIPH_140_BIT_21 (1UL << 21)
#define H7_PERIPH_140_BIT_22 (1UL << 22)
#define H7_PERIPH_140_BIT_23 (1UL << 23)
#define H7_PERIPH_140_BIT_24 (1UL << 24)
#define H7_PERIPH_140_BIT_25 (1UL << 25)
#define H7_PERIPH_140_BIT_26 (1UL << 26)
#define H7_PERIPH_140_BIT_27 (1UL << 27)
#define H7_PERIPH_140_BIT_28 (1UL << 28)
#define H7_PERIPH_140_BIT_29 (1UL << 29)
#define H7_PERIPH_140_BIT_30 (1UL << 30)
#define H7_PERIPH_140_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_141_TypeDef;
#define H7_PERIPH_141 ((H7_PERIPH_141_TypeDef *)(0x58000000UL + 141 * 0x400UL))

#define H7_PERIPH_141_BIT_0 (1UL << 0)
#define H7_PERIPH_141_BIT_1 (1UL << 1)
#define H7_PERIPH_141_BIT_2 (1UL << 2)
#define H7_PERIPH_141_BIT_3 (1UL << 3)
#define H7_PERIPH_141_BIT_4 (1UL << 4)
#define H7_PERIPH_141_BIT_5 (1UL << 5)
#define H7_PERIPH_141_BIT_6 (1UL << 6)
#define H7_PERIPH_141_BIT_7 (1UL << 7)
#define H7_PERIPH_141_BIT_8 (1UL << 8)
#define H7_PERIPH_141_BIT_9 (1UL << 9)
#define H7_PERIPH_141_BIT_10 (1UL << 10)
#define H7_PERIPH_141_BIT_11 (1UL << 11)
#define H7_PERIPH_141_BIT_12 (1UL << 12)
#define H7_PERIPH_141_BIT_13 (1UL << 13)
#define H7_PERIPH_141_BIT_14 (1UL << 14)
#define H7_PERIPH_141_BIT_15 (1UL << 15)
#define H7_PERIPH_141_BIT_16 (1UL << 16)
#define H7_PERIPH_141_BIT_17 (1UL << 17)
#define H7_PERIPH_141_BIT_18 (1UL << 18)
#define H7_PERIPH_141_BIT_19 (1UL << 19)
#define H7_PERIPH_141_BIT_20 (1UL << 20)
#define H7_PERIPH_141_BIT_21 (1UL << 21)
#define H7_PERIPH_141_BIT_22 (1UL << 22)
#define H7_PERIPH_141_BIT_23 (1UL << 23)
#define H7_PERIPH_141_BIT_24 (1UL << 24)
#define H7_PERIPH_141_BIT_25 (1UL << 25)
#define H7_PERIPH_141_BIT_26 (1UL << 26)
#define H7_PERIPH_141_BIT_27 (1UL << 27)
#define H7_PERIPH_141_BIT_28 (1UL << 28)
#define H7_PERIPH_141_BIT_29 (1UL << 29)
#define H7_PERIPH_141_BIT_30 (1UL << 30)
#define H7_PERIPH_141_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_142_TypeDef;
#define H7_PERIPH_142 ((H7_PERIPH_142_TypeDef *)(0x58000000UL + 142 * 0x400UL))

