RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_142_BIT_0 (1UL << 0)
#define H7_PERIPH_142_BIT_1 (1UL << 1)
#define H7_PERIPH_142_BIT_2 (1UL << 2)
#define H7_PERIPH_142_BIT_3 (1UL << 3)
#define H7_PERIPH_142_BIT_4 (1UL << 4)
#define H7_PERIPH_142_BIT_5 (1UL << 5)
#define H7_PERIPH_142_BIT_6 (1UL << 6)
#define H7_PERIPH_142_BIT_7 (1UL << 7)
#define H7_PERIPH_142_BIT_8 (1UL << 8)
#define H7_PERIPH_142_BIT_9 (1UL << 9)
#define H7_PERIPH_142_BIT_10 (1UL << 10)
#define H7_PERIPH_142_BIT_11 (1UL << 11)
#define H7_PERIPH_142_BIT_12 (1UL << 12)
#define H7_PERIPH_142_BIT_13 (1UL << 13)
#define H7_PERIPH_142_BIT_14 (1UL << 14)
#define H7_PERIPH_142_BIT_15 (1UL << 15)
#define H7_PERIPH_142_BIT_16 (1UL << 16)
#define H7_PERIPH_142_BIT_17 (1UL << 17)
#define H7_PERIPH_142_BIT_18 (1UL << 18)
#define H7_PERIPH_142_BIT_19 (1UL << 19)
#define H7_PERIPH_142_BIT_20 (1UL << 20)
#define H7_PERIPH_142_BIT_21 (1UL << 21)
#define H7_PERIPH_142_BIT_22 (1UL << 22)
#define H7_PERIPH_142_BIT_23 (1UL << 23)
#define H7_PERIPH_142_BIT_24 (1UL << 24)
#define H7_PERIPH_142_BIT_25 (1UL << 25)
#define H7_PERIPH_142_BIT_26 (1UL << 26)
#define H7_PERIPH_142_BIT_27 (1UL << 27)
#define H7_PERIPH_142_BIT_28 (1UL << 28)
#define H7_PERIPH_142_BIT_29 (1UL << 29)
#define H7_PERIPH_142_BIT_30 (1UL << 30)
#define H7_PERIPH_142_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_143_TypeDef;
#define H7_PERIPH_143 ((H7_PERIPH_143_TypeDef *)(0x58000000UL + 143 * 0x400UL))

#define H7_PERIPH_143_BIT_0 (1UL << 0)
#define H7_PERIPH_143_BIT_1 (1UL << 1)
#define H7_PERIPH_143_BIT_2 (1UL << 2)
#define H7_PERIPH_143_BIT_3 (1UL << 3)
#define H7_PERIPH_143_BIT_4 (1UL << 4)
#define H7_PERIPH_143_BIT_5 (1UL << 5)
#define H7_PERIPH_143_BIT_6 (1UL << 6)
#define H7_PERIPH_143_BIT_7 (1UL << 7)
#define H7_PERIPH_143_BIT_8 (1UL << 8)
#define H7_PERIPH_143_BIT_9 (1UL << 9)
#define H7_PERIPH_143_BIT_10 (1UL << 10)
#define H7_PERIPH_143_BIT_11 (1UL << 11)
#define H7_PERIPH_143_BIT_12 (1UL << 12)
#define H7_PERIPH_143_BIT_13 (1UL << 13)
#define H7_PERIPH_143_BIT_14 (1UL << 14)
#define H7_PERIPH_143_BIT_15 (1UL << 15)
#define H7_PERIPH_143_BIT_16 (1UL << 16)
#define H7_PERIPH_143_BIT_17 (1UL << 17)
#define H7_PERIPH_143_BIT_18 (1UL << 18)
#define H7_PERIPH_143_BIT_19 (1UL << 19)
#define H7_PERIPH_143_BIT_20 (1UL << 20)
#define H7_PERIPH_143_BIT_21 (1UL << 21)
#define H7_PERIPH_143_BIT_22 (1UL << 22)
#define H7_PERIPH_143_BIT_23 (1UL << 23)
#define H7_PERIPH_143_BIT_24 (1UL << 24)
#define H7_PERIPH_143_BIT_25 (1UL << 25)
#define H7_PERIPH_143_BIT_26 (1UL << 26)
#define H7_PERIPH_143_BIT_27 (1UL << 27)
#define H7_PERIPH_143_BIT_28 (1UL << 28)
#define H7_PERIPH_143_BIT_29 (1UL << 29)
#define H7_PERIPH_143_BIT_30 (1UL << 30)
#define H7_PERIPH_143_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_144_TypeDef;
#define H7_PERIPH_144 ((H7_PERIPH_144_TypeDef *)(0x58000000UL + 144 * 0x400UL))

#define H7_PERIPH_144_BIT_0 (1UL << 0)
#define H7_PERIPH_144_BIT_1 (1UL << 1)
#define H7_PERIPH_144_BIT_2 (1UL << 2)
#define H7_PERIPH_144_BIT_3 (1UL << 3)
#define H7_PERIPH_144_BIT_4 (1UL << 4)
#define H7_PERIPH_144_BIT_5 (1UL << 5)
#define H7_PERIPH_144_BIT_6 (1UL << 6)
#define H7_PERIPH_144_BIT_7 (1UL << 7)
#define H7_PERIPH_144_BIT_8 (1UL << 8)
#define H7_PERIPH_144_BIT_9 (1UL << 9)
#define H7_PERIPH_144_BIT_10 (1UL << 10)
#define H7_PERIPH_144_BIT_11 (1UL << 11)
#define H7_PERIPH_144_BIT_12 (1UL << 12)
#define H7_PERIPH_144_BIT_13 (1UL << 13)
#define H7_PERIPH_144_BIT_14 (1UL << 14)
#define H7_PERIPH_144_BIT_15 (1UL << 15)
#define H7_PERIPH_144_BIT_16 (1UL << 16)
#define H7_PERIPH_144_BIT_17 (1UL << 17)
#define H7_PERIPH_144_BIT_18 (1UL << 18)
#define H7_PERIPH_144_BIT_19 (1UL << 19)
#define H7_PERIPH_144_BIT_20 (1UL << 20)
#define H7_PERIPH_144_BIT_21 (1UL << 21)
#define H7_PERIPH_144_BIT_22 (1UL << 22)
#define H7_PERIPH_144_BIT_23 (1UL << 23)
#define H7_PERIPH_144_BIT_24 (1UL << 24)
#define H7_PERIPH_144_BIT_25 (1UL << 25)
#define H7_PERIPH_144_BIT_26 (1UL << 26)
#define H7_PERIPH_144_BIT_27 (1UL << 27)
#define H7_PERIPH_144_BIT_28 (1UL << 28)
#define H7_PERIPH_144_BIT_29 (1UL << 29)
#define H7_PERIPH_144_BIT_30 (1UL << 30)
#define H7_PERIPH_144_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_145_TypeDef;
#define H7_PERIPH_145 ((H7_PERIPH_145_TypeDef *)(0x58000000UL + 145 * 0x400UL))

#define H7_PERIPH_145_BIT_0 (1UL << 0)
#define H7_PERIPH_145_BIT_1 (1UL << 1)
#define H7_PERIPH_145_BIT_2 (1UL << 2)
#define H7_PERIPH_145_BIT_3 (1UL << 3)
#define H7_PERIPH_145_BIT_4 (1UL << 4)
#define H7_PERIPH_145_BIT_5 (1UL << 5)
#define H7_PERIPH_145_BIT_6 (1UL << 6)
#define H7_PERIPH_145_BIT_7 (1UL << 7)
#define H7_PERIPH_145_BIT_8 (1UL << 8)
#define H7_PERIPH_145_BIT_9 (1UL << 9)
#define H7_PERIPH_145_BIT_10 (1UL << 10)
#define H7_PERIPH_145_BIT_11 (1UL << 11)
#define H7_PERIPH_145_BIT_12 (1UL << 12)
#define H7_PERIPH_145_BIT_13 (1UL << 13)
#define H7_PERIPH_145_BIT_14 (1UL << 14)
#define H7_PERIPH_145_BIT_15 (1UL << 15)
#define H7_PERIPH_145_BIT_16 (1UL << 16)
#define H7_PERIPH_145_BIT_17 (1UL << 17)
#define H7_PERIPH_145_BIT_18 (1UL << 18)
#define H7_PERIPH_145_BIT_19 (1UL << 19)
#define H7_PERIPH_145_BIT_20 (1UL << 20)
#define H7_PERIPH_145_BIT_21 (1UL << 21)
#define H7_PERIPH_145_BIT_22 (1UL << 22)
#define H7_PERIPH_145_BIT_23 (1UL << 23)
#define H7_PERIPH_145_BIT_24 (1UL << 24)
#define H7_PERIPH_145_BIT_25 (1UL << 25)
#define H7_PERIPH_145_BIT_26 (1UL << 26)
#define H7_PERIPH_145_BIT_27 (1UL << 27)
#define H7_PERIPH_145_BIT_28 (1UL << 28)
#define H7_PERIPH_145_BIT_29 (1UL << 29)
#define H7_PERIPH_145_BIT_30 (1UL << 30)
#define H7_PERIPH_145_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_146_TypeDef;
#define H7_PERIPH_146 ((H7_PERIPH_146_TypeDef *)(0x58000000UL + 146 * 0x400UL))

#define H7_PERIPH_146_BIT_0 (1UL << 0)
#define H7_PERIPH_146_BIT_1 (1UL << 1)
#define H7_PERIPH_146_BIT_2 (1UL << 2)
#define H7_PERIPH_146_BIT_3 (1UL << 3)
#define H7_PERIPH_146_BIT_4 (1UL << 4)
#define H7_PERIPH_146_BIT_5 (1UL << 5)
#define H7_PERIPH_146_BIT_6 (1UL << 6)
#define H7_PERIPH_146_BIT_7 (1UL << 7)
#define H7_PERIPH_146_BIT_8 (1UL << 8)
#define H7_PERIPH_146_BIT_9 (1UL << 9)
#define H7_PERIPH_146_BIT_10 (1UL << 10)
#define H7_PERIPH_146_BIT_11 (1UL << 11)
#define H7_PERIPH_146_BIT_12 (1UL << 12)
#define H7_PERIPH_146_BIT_13 (1UL << 13)
#define H7_PERIPH_146_BIT_14 (1UL << 14)
#define H7_PERIPH_146_BIT_15 (1UL << 15)
#define H7_PERIPH_146_BIT_16 (1UL << 16)
#define H7_PERIPH_146_BIT_17 (1UL << 17)
#define H7_PERIPH_146_BIT_18 (1UL << 18)
#define H7_PERIPH_146_BIT_19 (1UL << 19)
#define H7_PERIPH_146_BIT_20 (1UL << 20)
#define H7_PERIPH_146_BIT_21 (1UL << 21)
#define H7_PERIPH_146_BIT_22 (1UL << 22)
#define H7_PERIPH_146_BIT_23 (1UL << 23)
#define H7_PERIPH_146_BIT_24 (1UL << 24)
#define H7_PERIPH_146_BIT_25 (1UL << 25)
#define H7_PERIPH_146_BIT_26 (1UL << 26)
#define H7_PERIPH_146_BIT_27 (1UL << 27)
#define H7_PERIPH_146_BIT_28 (1UL << 28)
#define H7_PERIPH_146_BIT_29 (1UL << 29)
#define H7_PERIPH_146_BIT_30 (1UL << 30)
#define H7_PERIPH_146_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_147_TypeDef;
#define H7_PERIPH_147 ((H7_PERIPH_147_TypeDef *)(0x58000000UL + 147 * 0x400UL))

#define H7_PERIPH_147_BIT_0 (1UL << 0)
#define H7_PERIPH_147_BIT_1 (1UL << 1)
#define H7_PERIPH_147_BIT_2 (1UL << 2)
#define H7_PERIPH_147_BIT_3 (1UL << 3)
#define H7_PERIPH_147_BIT_4 (1UL << 4)
#define H7_PERIPH_147_BIT_5 (1UL << 5)
#define H7_PERIPH_147_BIT_6 (1UL << 6)
#define H7_PERIPH_147_BIT_7 (1UL << 7)
#define H7_PERIPH_147_BIT_8 (1UL << 8)
#define H7_PERIPH_147_BIT_9 (1UL << 9)
#define H7_PERIPH_147_BIT_10 (1UL << 10)
#define H7_PERIPH_147_BIT_11 (1UL << 11)
#define H7_PERIPH_147_BIT_12 (1UL << 12)
#define H7_PERIPH_147_BIT_13 (1UL << 13)
#define H7_PERIPH_147_BIT_14 (1UL << 14)
#define H7_PERIPH_147_BIT_15 (1UL << 15)
#define H7_PERIPH_147_BIT_16 (1UL << 16)
#define H7_PERIPH_147_BIT_17 (1UL << 17)
#define H7_PERIPH_147_BIT_18 (1UL << 18)
#define H7_PERIPH_147_BIT_19 (1UL << 19)
#define H7_PERIPH_147_BIT_20 (1UL << 20)
#define H7_PERIPH_147_BIT_21 (1UL << 21)
#define H7_PERIPH_147_BIT_22 (1UL << 22)
#define H7_PERIPH_147_BIT_23 (1UL << 23)
#define H7_PERIPH_147_BIT_24 (1UL << 24)
#define H7_PERIPH_147_BIT_25 (1UL << 25)
#define H7_PERIPH_147_BIT_26 (1UL << 26)
#define H7_PERIPH_147_BIT_27 (1UL << 27)
#define H7_PERIPH_147_BIT_28 (1UL << 28)
#define H7_PERIPH_147_BIT_29 (1UL << 29)
#define H7_PERIPH_147_BIT_30 (1UL << 30)
#define H7_PERIPH_147_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_148_TypeDef;
#define H7_PERIPH_148 ((H7_PERIPH_148_TypeDef *)(0x58000000UL + 148 * 0x400UL))

#define H7_PERIPH_148_BIT_0 (1UL << 0)
#define H7_PERIPH_148_BIT_1 (1UL << 1)
#define H7_PERIPH_148_BIT_2 (1UL << 2)
#define H7_PERIPH_148_BIT_3 (1UL << 3)
#define H7_PERIPH_148_BIT_4 (1UL << 4)
#define H7_PERIPH_148_BIT_5 (1UL << 5)
#define H7_PERIPH_148_BIT_6 (1UL << 6)
#define H7_PERIPH_148_BIT_7 (1UL << 7)
#define H7_PERIPH_148_BIT_8 (1UL << 8)
#define H7_PERIPH_148_BIT_9 (1UL << 9)
#define H7_PERIPH_148_BIT_10 (1UL << 10)
#define H7_PERIPH_148_BIT_11 (1UL << 11)
#define H7_PERIPH_148_BIT_12 (1UL << 12)
#define H7_PERIPH_148_BIT_13 (1UL << 13)
#define H7_PERIPH_148_BIT_14 (1UL << 14)
#define H7_PERIPH_148_BIT_15 (1UL << 15)
#define H7_PERIPH_148_BIT_16 (1UL << 16)
#define H7_PERIPH_148_BIT_17 (1UL << 17)
#define H7_PERIPH_148_BIT_18 (1UL << 18)
#define H7_PERIPH_148_BIT_19 (1UL << 19)
#define H7_PERIPH_148_BIT_20 (1UL << 20)
#define H7_PERIPH_148_BIT_21 (1UL << 21)
#define H7_PERIPH_148_BIT_22 (1UL << 22)
#define H7_PERIPH_148_BIT_23 (1UL << 23)
#define H7_PERIPH_148_BIT_24 (1UL << 24)
#define H7_PERIPH_148_BIT_25 (1UL << 25)
#define H7_PERIPH_148_BIT_26 (1UL << 26)
#define H7_PERIPH_148_BIT_27 (1UL << 27)
#define H7_PERIPH_148_BIT_28 (1UL << 28)
#define H7_PERIPH_148_BIT_29 (1UL << 29)
#define H7_PERIPH_148_BIT_30 (1UL << 30)
#define H7_PERIPH_148_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_149_TypeDef;
#define H7_PERIPH_149 ((H7_PERIPH_149_TypeDef *)(0x58000000UL + 149 * 0x400UL))

#define H7_PERIPH_149_BIT_0 (1UL << 0)
#define H7_PERIPH_149_BIT_1 (1UL << 1)
#define H7_PERIPH_149_BIT_2 (1UL << 2)
#define H7_PERIPH_149_BIT_3 (1UL << 3)
#define H7_PERIPH_149_BIT_4 (1UL << 4)
#define H7_PERIPH_149_BIT_5 (1UL << 5)
#define H7_PERIPH_149_BIT_6 (1UL << 6)
#define H7_PERIPH_149_BIT_7 (1UL << 7)
#define H7_PERIPH_149_BIT_8 (1UL << 8)
#define H7_PERIPH_149_BIT_9 (1UL << 9)
#define H7_PERIPH_149_BIT_10 (1UL << 10)
#define H7_PERIPH_149_BIT_11 (1UL << 11)
#define H7_PERIPH_149_BIT_12 (1UL << 12)
#define H7_PERIPH_149_BIT_13 (1UL << 13)
#define H7_PERIPH_149_BIT_14 (1UL << 14)
#define H7_PERIPH_149_BIT_15 (1UL << 15)
#define H7_PERIPH_149_BIT_16 (1UL << 16)
#define H7_PERIPH_149_BIT_17 (1UL << 17)
#define H7_PERIPH_149_BIT_18 (1UL << 18)
#define H7_PERIPH_149_BIT_19 (1UL << 19)
#define H7_PERIPH_149_BIT_20 (1UL << 20)
#define H7_PERIPH_149_BIT_21 (1UL << 21)
#define H7_PERIPH_149_BIT_22 (1UL << 22)
#define H7_PERIPH_149_BIT_23 (1UL << 23)
#define H7_PERIPH_149_BIT_24 (1UL << 24)
#define H7_PERIPH_149_BIT_25 (1UL << 25)
#define H7_PERIPH_149_BIT_26 (1UL << 26)
#define H7_PERIPH_149_BIT_27 (1UL << 27)
#define H7_PERIPH_149_BIT_28 (1UL << 28)
#define H7_PERIPH_149_BIT_29 (1UL << 29)
#define H7_PERIPH_149_BIT_30 (1UL << 30)
#define H7_PERIPH_149_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_150_TypeDef;
#define H7_PERIPH_150 ((H7_PERIPH_150_TypeDef *)(0x58000000UL + 150 * 0x400UL))

#define H7_PERIPH_150_BIT_0 (1UL << 0)
#define H7_PERIPH_150_BIT_1 (1UL << 1)
#define H7_PERIPH_150_BIT_2 (1UL << 2)
#define H7_PERIPH_150_BIT_3 (1UL << 3)
#define H7_PERIPH_150_BIT_4 (1UL << 4)
#define H7_PERIPH_150_BIT_5 (1UL << 5)
#define H7_PERIPH_150_BIT_6 (1UL << 6)
#define H7_PERIPH_150_BIT_7 (1UL << 7)
#define H7_PERIPH_150_BIT_8 (1UL << 8)
#define H7_PERIPH_150_BIT_9 (1UL << 9)
#define H7_PERIPH_150_BIT_10 (1UL << 10)
#define H7_PERIPH_150_BIT_11 (1UL << 11)
#define H7_PERIPH_150_BIT_12 (1UL << 12)
#define H7_PERIPH_150_BIT_13 (1UL << 13)
#define H7_PERIPH_150_BIT_14 (1UL << 14)
#define H7_PERIPH_150_BIT_15 (1UL << 15)
#define H7_PERIPH_150_BIT_16 (1UL << 16)
#define H7_PERIPH_150_BIT_17 (1UL << 17)
#define H7_PERIPH_150_BIT_18 (1UL << 18)
#define H7_PERIPH_150_BIT_19 (1UL << 19)
#define H7_PERIPH_150_BIT_20 (1UL << 20)
#define H7_PERIPH_150_BIT_21 (1UL << 21)
#define H7_PERIPH_150_BIT_22 (1UL << 22)
#define H7_PERIPH_150_BIT_23 (1UL << 23)
#define H7_PERIPH_150_BIT_24 (1UL << 24)
#define H7_PERIPH_150_BIT_25 (1UL << 25)
#define H7_PERIPH_150_BIT_26 (1UL << 26)
#define H7_PERIPH_150_BIT_27 (1UL << 27)
#define H7_PERIPH_150_BIT_28 (1UL << 28)
#define H7_PERIPH_150_BIT_29 (1UL << 29)
#define H7_PERIPH_150_BIT_30 (1UL << 30)
#define H7_PERIPH_150_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_151_TypeDef;
#define H7_PERIPH_151 ((H7_PERIPH_151_TypeDef *)(0x58000000UL + 151 * 0x400UL))

#define H7_PERIPH_151_BIT_0 (1UL << 0)
#define H7_PERIPH_151_BIT_1 (1UL << 1)
#define H7_PERIPH_151_BIT_2 (1UL << 2)
#define H7_PERIPH_151_BIT_3 (1UL << 3)
#define H7_PERIPH_151_BIT_4 (1UL << 4)
#define H7_PERIPH_151_BIT_5 (1UL << 5)
#define H7_PERIPH_151_BIT_6 (1UL << 6)
#define H7_PERIPH_151_BIT_7 (1UL << 7)
#define H7_PERIPH_151_BIT_8 (1UL << 8)
#define H7_PERIPH_151_BIT_9 (1UL << 9)
#define H7_PERIPH_151_BIT_10 (1UL << 10)
#define H7_PERIPH_151_BIT_11 (1UL << 11)
#define H7_PERIPH_151_BIT_12 (1UL << 12)
#define H7_PERIPH_151_BIT_13 (1UL << 13)
#define H7_PERIPH_151_BIT_14 (1UL << 14)
#define H7_PERIPH_151_BIT_15 (1UL << 15)
#define H7_PERIPH_151_BIT_16 (1UL << 16)
#define H7_PERIPH_151_BIT_17 (1UL << 17)
#define H7_PERIPH_151_BIT_18 (1UL << 18)
#define H7_PERIPH_151_BIT_19 (1UL << 19)
#define H7_PERIPH_151_BIT_20 (1UL << 20)
#define H7_PERIPH_151_BIT_21 (1UL << 21)
#define H7_PERIPH_151_BIT_22 (1UL << 22)
#define H7_PERIPH_151_BIT_23 (1UL << 23)
#define H7_PERIPH_151_BIT_24 (1UL << 24)
#define H7_PERIPH_151_BIT_25 (1UL << 25)
#define H7_PERIPH_151_BIT_26 (1UL << 26)
#define H7_PERIPH_151_BIT_27 (1UL << 27)
#define H7_PERIPH_151_BIT_28 (1UL << 28)
#define H7_PERIPH_151_BIT_29 (1UL << 29)
#define H7_PERIPH_151_BIT_30 (1UL << 30)
#define H7_PERIPH_151_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_152_TypeDef;
#define H7_PERIPH_152 ((H7_PERIPH_152_TypeDef *)(0x58000000UL + 152 * 0x400UL))

