RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_152_BIT_0 (1UL << 0)
#define H7_PERIPH_152_BIT_1 (1UL << 1)
#define H7_PERIPH_152_BIT_2 (1UL << 2)
#define H7_PERIPH_152_BIT_3 (1UL << 3)
#define H7_PERIPH_152_BIT_4 (1UL << 4)
#define H7_PERIPH_152_BIT_5 (1UL << 5)
#define H7_PERIPH_152_BIT_6 (1UL << 6)
#define H7_PERIPH_152_BIT_7 (1UL << 7)
#define H7_PERIPH_152_BIT_8 (1UL << 8)
#define H7_PERIPH_152_BIT_9 (1UL << 9)
#define H7_PERIPH_152_BIT_10 (1UL << 10)
#define H7_PERIPH_152_BIT_11 (1UL << 11)
#define H7_PERIPH_152_BIT_12 (1UL << 12)
#define H7_PERIPH_152_BIT_13 (1UL << 13)
#define H7_PERIPH_152_BIT_14 (1UL << 14)
#define H7_PERIPH_152_BIT_15 (1UL << 15)
#define H7_PERIPH_152_BIT_16 (1UL << 16)
#define H7_PERIPH_152_BIT_17 (1UL << 17)
#define H7_PERIPH_152_BIT_18 (1UL << 18)
#define H7_PERIPH_152_BIT_19 (1UL << 19)
#define H7_PERIPH_152_BIT_20 (1UL << 20)
#define H7_PERIPH_152_BIT_21 (1UL << 21)
#define H7_PERIPH_152_BIT_22 (1UL << 22)
#define H7_PERIPH_152_BIT_23 (1UL << 23)
#define H7_PERIPH_152_BIT_24 (1UL << 24)
#define H7_PERIPH_152_BIT_25 (1UL << 25)
#define H7_PERIPH_152_BIT_26 (1UL << 26)
#define H7_PERIPH_152_BIT_27 (1UL << 27)
#define H7_PERIPH_152_BIT_28 (1UL << 28)
#define H7_PERIPH_152_BIT_29 (1UL << 29)
#define H7_PERIPH_152_BIT_30 (1UL << 30)
#define H7_PERIPH_152_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_153_TypeDef;
#define H7_PERIPH_153 ((H7_PERIPH_153_TypeDef *)(0x58000000UL + 153 * 0x400UL))

#define H7_PERIPH_153_BIT_0 (1UL << 0)
#define H7_PERIPH_153_BIT_1 (1UL << 1)
#define H7_PERIPH_153_BIT_2 (1UL << 2)
#define H7_PERIPH_153_BIT_3 (1UL << 3)
#define H7_PERIPH_153_BIT_4 (1UL << 4)
#define H7_PERIPH_153_BIT_5 (1UL << 5)
#define H7_PERIPH_153_BIT_6 (1UL << 6)
#define H7_PERIPH_153_BIT_7 (1UL << 7)
#define H7_PERIPH_153_BIT_8 (1UL << 8)
#define H7_PERIPH_153_BIT_9 (1UL << 9)
#define H7_PERIPH_153_BIT_10 (1UL << 10)
#define H7_PERIPH_153_BIT_11 (1UL << 11)
#define H7_PERIPH_153_BIT_12 (1UL << 12)
#define H7_PERIPH_153_BIT_13 (1UL << 13)
#define H7_PERIPH_153_BIT_14 (1UL << 14)
#define H7_PERIPH_153_BIT_15 (1UL << 15)
#define H7_PERIPH_153_BIT_16 (1UL << 16)
#define H7_PERIPH_153_BIT_17 (1UL << 17)
#define H7_PERIPH_153_BIT_18 (1UL << 18)
#define H7_PERIPH_153_BIT_19 (1UL << 19)
#define H7_PERIPH_153_BIT_20 (1UL << 20)
#define H7_PERIPH_153_BIT_21 (1UL << 21)
#define H7_PERIPH_153_BIT_22 (1UL << 22)
#define H7_PERIPH_153_BIT_23 (1UL << 23)
#define H7_PERIPH_153_BIT_24 (1UL << 24)
#define H7_PERIPH_153_BIT_25 (1UL << 25)
#define H7_PERIPH_153_BIT_26 (1UL << 26)
#define H7_PERIPH_153_BIT_27 (1UL << 27)
#define H7_PERIPH_153_BIT_28 (1UL << 28)
#define H7_PERIPH_153_BIT_29 (1UL << 29)
#define H7_PERIPH_153_BIT_30 (1UL << 30)
#define H7_PERIPH_153_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_154_TypeDef;
#define H7_PERIPH_154 ((H7_PERIPH_154_TypeDef *)(0x58000000UL + 154 * 0x400UL))

#define H7_PERIPH_154_BIT_0 (1UL << 0)
#define H7_PERIPH_154_BIT_1 (1UL << 1)
#define H7_PERIPH_154_BIT_2 (1UL << 2)
#define H7_PERIPH_154_BIT_3 (1UL << 3)
#define H7_PERIPH_154_BIT_4 (1UL << 4)
#define H7_PERIPH_154_BIT_5 (1UL << 5)
#define H7_PERIPH_154_BIT_6 (1UL << 6)
#define H7_PERIPH_154_BIT_7 (1UL << 7)
#define H7_PERIPH_154_BIT_8 (1UL << 8)
#define H7_PERIPH_154_BIT_9 (1UL << 9)
#define H7_PERIPH_154_BIT_10 (1UL << 10)
#define H7_PERIPH_154_BIT_11 (1UL << 11)
#define H7_PERIPH_154_BIT_12 (1UL << 12)
#define H7_PERIPH_154_BIT_13 (1UL << 13)
#define H7_PERIPH_154_BIT_14 (1UL << 14)
#define H7_PERIPH_154_BIT_15 (1UL << 15)
#define H7_PERIPH_154_BIT_16 (1UL << 16)
#define H7_PERIPH_154_BIT_17 (1UL << 17)
#define H7_PERIPH_154_BIT_18 (1UL << 18)
#define H7_PERIPH_154_BIT_19 (1UL << 19)
#define H7_PERIPH_154_BIT_20 (1UL << 20)
#define H7_PERIPH_154_BIT_21 (1UL << 21)
#define H7_PERIPH_154_BIT_22 (1UL << 22)
#define H7_PERIPH_154_BIT_23 (1UL << 23)
#define H7_PERIPH_154_BIT_24 (1UL << 24)
#define H7_PERIPH_154_BIT_25 (1UL << 25)
#define H7_PERIPH_154_BIT_26 (1UL << 26)
#define H7_PERIPH_154_BIT_27 (1UL << 27)
#define H7_PERIPH_154_BIT_28 (1UL << 28)
#define H7_PERIPH_154_BIT_29 (1UL << 29)
#define H7_PERIPH_154_BIT_30 (1UL << 30)
#define H7_PERIPH_154_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_155_TypeDef;
#define H7_PERIPH_155 ((H7_PERIPH_155_TypeDef *)(0x58000000UL + 155 * 0x400UL))

#define H7_PERIPH_155_BIT_0 (1UL << 0)
#define H7_PERIPH_155_BIT_1 (1UL << 1)
#define H7_PERIPH_155_BIT_2 (1UL << 2)
#define H7_PERIPH_155_BIT_3 (1UL << 3)
#define H7_PERIPH_155_BIT_4 (1UL << 4)
#define H7_PERIPH_155_BIT_5 (1UL << 5)
#define H7_PERIPH_155_BIT_6 (1UL << 6)
#define H7_PERIPH_155_BIT_7 (1UL << 7)
#define H7_PERIPH_155_BIT_8 (1UL << 8)
#define H7_PERIPH_155_BIT_9 (1UL << 9)
#define H7_PERIPH_155_BIT_10 (1UL << 10)
#define H7_PERIPH_155_BIT_11 (1UL << 11)
#define H7_PERIPH_155_BIT_12 (1UL << 12)
#define H7_PERIPH_155_BIT_13 (1UL << 13)
#define H7_PERIPH_155_BIT_14 (1UL << 14)
#define H7_PERIPH_155_BIT_15 (1UL << 15)
#define H7_PERIPH_155_BIT_16 (1UL << 16)
#define H7_PERIPH_155_BIT_17 (1UL << 17)
#define H7_PERIPH_155_BIT_18 (1UL << 18)
#define H7_PERIPH_155_BIT_19 (1UL << 19)
#define H7_PERIPH_155_BIT_20 (1UL << 20)
#define H7_PERIPH_155_BIT_21 (1UL << 21)
#define H7_PERIPH_155_BIT_22 (1UL << 22)
#define H7_PERIPH_155_BIT_23 (1UL << 23)
#define H7_PERIPH_155_BIT_24 (1UL << 24)
#define H7_PERIPH_155_BIT_25 (1UL << 25)
#define H7_PERIPH_155_BIT_26 (1UL << 26)
#define H7_PERIPH_155_BIT_27 (1UL << 27)
#define H7_PERIPH_155_BIT_28 (1UL << 28)
#define H7_PERIPH_155_BIT_29 (1UL << 29)
#define H7_PERIPH_155_BIT_30 (1UL << 30)
#define H7_PERIPH_155_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_156_TypeDef;
#define H7_PERIPH_156 ((H7_PERIPH_156_TypeDef *)(0x58000000UL + 156 * 0x400UL))

#define H7_PERIPH_156_BIT_0 (1UL << 0)
#define H7_PERIPH_156_BIT_1 (1UL << 1)
#define H7_PERIPH_156_BIT_2 (1UL << 2)
#define H7_PERIPH_156_BIT_3 (1UL << 3)
#define H7_PERIPH_156_BIT_4 (1UL << 4)
#define H7_PERIPH_156_BIT_5 (1UL << 5)
#define H7_PERIPH_156_BIT_6 (1UL << 6)
#define H7_PERIPH_156_BIT_7 (1UL << 7)
#define H7_PERIPH_156_BIT_8 (1UL << 8)
#define H7_PERIPH_156_BIT_9 (1UL << 9)
#define H7_PERIPH_156_BIT_10 (1UL << 10)
#define H7_PERIPH_156_BIT_11 (1UL << 11)
#define H7_PERIPH_156_BIT_12 (1UL << 12)
#define H7_PERIPH_156_BIT_13 (1UL << 13)
#define H7_PERIPH_156_BIT_14 (1UL << 14)
#define H7_PERIPH_156_BIT_15 (1UL << 15)
#define H7_PERIPH_156_BIT_16 (1UL << 16)
#define H7_PERIPH_156_BIT_17 (1UL << 17)
#define H7_PERIPH_156_BIT_18 (1UL << 18)
#define H7_PERIPH_156_BIT_19 (1UL << 19)
#define H7_PERIPH_156_BIT_20 (1UL << 20)
#define H7_PERIPH_156_BIT_21 (1UL << 21)
#define H7_PERIPH_156_BIT_22 (1UL << 22)
#define H7_PERIPH_156_BIT_23 (1UL << 23)
#define H7_PERIPH_156_BIT_24 (1UL << 24)
#define H7_PERIPH_156_BIT_25 (1UL << 25)
#define H7_PERIPH_156_BIT_26 (1UL << 26)
#define H7_PERIPH_156_BIT_27 (1UL << 27)
#define H7_PERIPH_156_BIT_28 (1UL << 28)
#define H7_PERIPH_156_BIT_29 (1UL << 29)
#define H7_PERIPH_156_BIT_30 (1UL << 30)
#define H7_PERIPH_156_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_157_TypeDef;
#define H7_PERIPH_157 ((H7_PERIPH_157_TypeDef *)(0x58000000UL + 157 * 0x400UL))

#define H7_PERIPH_157_BIT_0 (1UL << 0)
#define H7_PERIPH_157_BIT_1 (1UL << 1)
#define H7_PERIPH_157_BIT_2 (1UL << 2)
#define H7_PERIPH_157_BIT_3 (1UL << 3)
#define H7_PERIPH_157_BIT_4 (1UL << 4)
#define H7_PERIPH_157_BIT_5 (1UL << 5)
#define H7_PERIPH_157_BIT_6 (1UL << 6)
#define H7_PERIPH_157_BIT_7 (1UL << 7)
#define H7_PERIPH_157_BIT_8 (1UL << 8)
#define H7_PERIPH_157_BIT_9 (1UL << 9)
#define H7_PERIPH_157_BIT_10 (1UL << 10)
#define H7_PERIPH_157_BIT_11 (1UL << 11)
#define H7_PERIPH_157_BIT_12 (1UL << 12)
#define H7_PERIPH_157_BIT_13 (1UL << 13)
#define H7_PERIPH_157_BIT_14 (1UL << 14)
#define H7_PERIPH_157_BIT_15 (1UL << 15)
#define H7_PERIPH_157_BIT_16 (1UL << 16)
#define H7_PERIPH_157_BIT_17 (1UL << 17)
#define H7_PERIPH_157_BIT_18 (1UL << 18)
#define H7_PERIPH_157_BIT_19 (1UL << 19)
#define H7_PERIPH_157_BIT_20 (1UL << 20)
#define H7_PERIPH_157_BIT_21 (1UL << 21)
#define H7_PERIPH_157_BIT_22 (1UL << 22)
#define H7_PERIPH_157_BIT_23 (1UL << 23)
#define H7_PERIPH_157_BIT_24 (1UL << 24)
#define H7_PERIPH_157_BIT_25 (1UL << 25)
#define H7_PERIPH_157_BIT_26 (1UL << 26)
#define H7_PERIPH_157_BIT_27 (1UL << 27)
#define H7_PERIPH_157_BIT_28 (1UL << 28)
#define H7_PERIPH_157_BIT_29 (1UL << 29)
#define H7_PERIPH_157_BIT_30 (1UL << 30)
#define H7_PERIPH_157_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_158_TypeDef;
#define H7_PERIPH_158 ((H7_PERIPH_158_TypeDef *)(0x58000000UL + 158 * 0x400UL))

#define H7_PERIPH_158_BIT_0 (1UL << 0)
#define H7_PERIPH_158_BIT_1 (1UL << 1)
#define H7_PERIPH_158_BIT_2 (1UL << 2)
#define H7_PERIPH_158_BIT_3 (1UL << 3)
#define H7_PERIPH_158_BIT_4 (1UL << 4)
#define H7_PERIPH_158_BIT_5 (1UL << 5)
#define H7_PERIPH_158_BIT_6 (1UL << 6)
#define H7_PERIPH_158_BIT_7 (1UL << 7)
#define H7_PERIPH_158_BIT_8 (1UL << 8)
#define H7_PERIPH_158_BIT_9 (1UL << 9)
#define H7_PERIPH_158_BIT_10 (1UL << 10)
#define H7_PERIPH_158_BIT_11 (1UL << 11)
#define H7_PERIPH_158_BIT_12 (1UL << 12)
#define H7_PERIPH_158_BIT_13 (1UL << 13)
#define H7_PERIPH_158_BIT_14 (1UL << 14)
#define H7_PERIPH_158_BIT_15 (1UL << 15)
#define H7_PERIPH_158_BIT_16 (1UL << 16)
#define H7_PERIPH_158_BIT_17 (1UL << 17)
#define H7_PERIPH_158_BIT_18 (1UL << 18)
#define H7_PERIPH_158_BIT_19 (1UL << 19)
#define H7_PERIPH_158_BIT_20 (1UL << 20)
#define H7_PERIPH_158_BIT_21 (1UL << 21)
#define H7_PERIPH_158_BIT_22 (1UL << 22)
#define H7_PERIPH_158_BIT_23 (1UL << 23)
#define H7_PERIPH_158_BIT_24 (1UL << 24)
#define H7_PERIPH_158_BIT_25 (1UL << 25)
#define H7_PERIPH_158_BIT_26 (1UL << 26)
#define H7_PERIPH_158_BIT_27 (1UL << 27)
#define H7_PERIPH_158_BIT_28 (1UL << 28)
#define H7_PERIPH_158_BIT_29 (1UL << 29)
#define H7_PERIPH_158_BIT_30 (1UL << 30)
#define H7_PERIPH_158_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_159_TypeDef;
#define H7_PERIPH_159 ((H7_PERIPH_159_TypeDef *)(0x58000000UL + 159 * 0x400UL))

#define H7_PERIPH_159_BIT_0 (1UL << 0)
#define H7_PERIPH_159_BIT_1 (1UL << 1)
#define H7_PERIPH_159_BIT_2 (1UL << 2)
#define H7_PERIPH_159_BIT_3 (1UL << 3)
#define H7_PERIPH_159_BIT_4 (1UL << 4)
#define H7_PERIPH_159_BIT_5 (1UL << 5)
#define H7_PERIPH_159_BIT_6 (1UL << 6)
#define H7_PERIPH_159_BIT_7 (1UL << 7)
#define H7_PERIPH_159_BIT_8 (1UL << 8)
#define H7_PERIPH_159_BIT_9 (1UL << 9)
#define H7_PERIPH_159_BIT_10 (1UL << 10)
#define H7_PERIPH_159_BIT_11 (1UL << 11)
#define H7_PERIPH_159_BIT_12 (1UL << 12)
#define H7_PERIPH_159_BIT_13 (1UL << 13)
#define H7_PERIPH_159_BIT_14 (1UL << 14)
#define H7_PERIPH_159_BIT_15 (1UL << 15)
#define H7_PERIPH_159_BIT_16 (1UL << 16)
#define H7_PERIPH_159_BIT_17 (1UL << 17)
#define H7_PERIPH_159_BIT_18 (1UL << 18)
#define H7_PERIPH_159_BIT_19 (1UL << 19)
#define H7_PERIPH_159_BIT_20 (1UL << 20)
#define H7_PERIPH_159_BIT_21 (1UL << 21)
#define H7_PERIPH_159_BIT_22 (1UL << 22)
#define H7_PERIPH_159_BIT_23 (1UL << 23)
#define H7_PERIPH_159_BIT_24 (1UL << 24)
#define H7_PERIPH_159_BIT_25 (1UL << 25)
#define H7_PERIPH_159_BIT_26 (1UL << 26)
#define H7_PERIPH_159_BIT_27 (1UL << 27)
#define H7_PERIPH_159_BIT_28 (1UL << 28)
#define H7_PERIPH_159_BIT_29 (1UL << 29)
#define H7_PERIPH_159_BIT_30 (1UL << 30)
#define H7_PERIPH_159_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_160_TypeDef;
#define H7_PERIPH_160 ((H7_PERIPH_160_TypeDef *)(0x58000000UL + 160 * 0x400UL))

#define H7_PERIPH_160_BIT_0 (1UL << 0)
#define H7_PERIPH_160_BIT_1 (1UL << 1)
#define H7_PERIPH_160_BIT_2 (1UL << 2)
#define H7_PERIPH_160_BIT_3 (1UL << 3)
#define H7_PERIPH_160_BIT_4 (1UL << 4)
#define H7_PERIPH_160_BIT_5 (1UL << 5)
#define H7_PERIPH_160_BIT_6 (1UL << 6)
#define H7_PERIPH_160_BIT_7 (1UL << 7)
#define H7_PERIPH_160_BIT_8 (1UL << 8)
#define H7_PERIPH_160_BIT_9 (1UL << 9)
#define H7_PERIPH_160_BIT_10 (1UL << 10)
#define H7_PERIPH_160_BIT_11 (1UL << 11)
#define H7_PERIPH_160_BIT_12 (1UL << 12)
#define H7_PERIPH_160_BIT_13 (1UL << 13)
#define H7_PERIPH_160_BIT_14 (1UL << 14)
#define H7_PERIPH_160_BIT_15 (1UL << 15)
#define H7_PERIPH_160_BIT_16 (1UL << 16)
#define H7_PERIPH_160_BIT_17 (1UL << 17)
#define H7_PERIPH_160_BIT_18 (1UL << 18)
#define H7_PERIPH_160_BIT_19 (1UL << 19)
#define H7_PERIPH_160_BIT_20 (1UL << 20)
#define H7_PERIPH_160_BIT_21 (1UL << 21)
#define H7_PERIPH_160_BIT_22 (1UL << 22)
#define H7_PERIPH_160_BIT_23 (1UL << 23)
#define H7_PERIPH_160_BIT_24 (1UL << 24)
#define H7_PERIPH_160_BIT_25 (1UL << 25)
#define H7_PERIPH_160_BIT_26 (1UL << 26)
#define H7_PERIPH_160_BIT_27 (1UL << 27)
#define H7_PERIPH_160_BIT_28 (1UL << 28)
#define H7_PERIPH_160_BIT_29 (1UL << 29)
#define H7_PERIPH_160_BIT_30 (1UL << 30)
#define H7_PERIPH_160_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_161_TypeDef;
#define H7_PERIPH_161 ((H7_PERIPH_161_TypeDef *)(0x58000000UL + 161 * 0x400UL))

#define H7_PERIPH_161_BIT_0 (1UL << 0)
#define H7_PERIPH_161_BIT_1 (1UL << 1)
#define H7_PERIPH_161_BIT_2 (1UL << 2)
#define H7_PERIPH_161_BIT_3 (1UL << 3)
#define H7_PERIPH_161_BIT_4 (1UL << 4)
#define H7_PERIPH_161_BIT_5 (1UL << 5)
#define H7_PERIPH_161_BIT_6 (1UL << 6)
#define H7_PERIPH_161_BIT_7 (1UL << 7)
#define H7_PERIPH_161_BIT_8 (1UL << 8)
#define H7_PERIPH_161_BIT_9 (1UL << 9)
#define H7_PERIPH_161_BIT_10 (1UL << 10)
#define H7_PERIPH_161_BIT_11 (1UL << 11)
#define H7_PERIPH_161_BIT_12 (1UL << 12)
#define H7_PERIPH_161_BIT_13 (1UL << 13)
#define H7_PERIPH_161_BIT_14 (1UL << 14)
#define H7_PERIPH_161_BIT_15 (1UL << 15)
#define H7_PERIPH_161_BIT_16 (1UL << 16)
#define H7_PERIPH_161_BIT_17 (1UL << 17)
#define H7_PERIPH_161_BIT_18 (1UL << 18)
#define H7_PERIPH_161_BIT_19 (1UL << 19)
#define H7_PERIPH_161_BIT_20 (1UL << 20)
#define H7_PERIPH_161_BIT_21 (1UL << 21)
#define H7_PERIPH_161_BIT_22 (1UL << 22)
#define H7_PERIPH_161_BIT_23 (1UL << 23)
#define H7_PERIPH_161_BIT_24 (1UL << 24)
#define H7_PERIPH_161_BIT_25 (1UL << 25)
#define H7_PERIPH_161_BIT_26 (1UL << 26)
#define H7_PERIPH_161_BIT_27 (1UL << 27)
#define H7_PERIPH_161_BIT_28 (1UL << 28)
#define H7_PERIPH_161_BIT_29 (1UL << 29)
#define H7_PERIPH_161_BIT_30 (1UL << 30)
#define H7_PERIPH_161_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_162_TypeDef;
#define H7_PERIPH_162 ((H7_PERIPH_162_TypeDef *)(0x58000000UL + 162 * 0x400UL))

#define H7_PERIPH_162_BIT_0 (1UL << 0)
#define H7_PERIPH_162_BIT_1 (1UL << 1)
#define H7_PERIPH_162_BIT_2 (1UL << 2)
#define H7_PERIPH_162_BIT_3 (1UL << 3)
#define H7_PERIPH_162_BIT_4 (1UL << 4)
#define H7_PERIPH_162_BIT_5 (1UL << 5)
#define H7_PERIPH_162_BIT_6 (1UL << 6)
#define H7_PERIPH_162_BIT_7 (1UL << 7)
#define H7_PERIPH_162_BIT_8 (1UL << 8)
#define H7_PERIPH_162_BIT_9 (1UL << 9)
#define H7_PERIPH_162_BIT_10 (1UL << 10)
#define H7_PERIPH_162_BIT_11 (1UL << 11)
#define H7_PERIPH_162_BIT_12 (1UL << 12)
#define H7_PERIPH_162_BIT_13 (1UL << 13)
#define H7_PERIPH_162_BIT_14 (1UL << 14)
#define H7_PERIPH_162_BIT_15 (1UL << 15)
#define H7_PERIPH_162_BIT_16 (1UL << 16)
#define H7_PERIPH_162_BIT_17 (1UL << 17)
#define H7_PERIPH_162_BIT_18 (1UL << 18)
#define H7_PERIPH_162_BIT_19 (1UL << 19)
#define H7_PERIPH_162_BIT_20 (1UL << 20)
#define H7_PERIPH_162_BIT_21 (1UL << 21)
#define H7_PERIPH_162_BIT_22 (1UL << 22)
#define H7_PERIPH_162_BIT_23 (1UL << 23)
#define H7_PERIPH_162_BIT_24 (1UL << 24)
#define H7_PERIPH_162_BIT_25 (1UL << 25)
#define H7_PERIPH_162_BIT_26 (1UL << 26)
#define H7_PERIPH_162_BIT_27 (1UL << 27)
#define H7_PERIPH_162_BIT_28 (1UL << 28)
#define H7_PERIPH_162_BIT_29 (1UL << 29)
#define H7_PERIPH_162_BIT_30 (1UL << 30)
#define H7_PERIPH_162_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_163_TypeDef;
#define H7_PERIPH_163 ((H7_PERIPH_163_TypeDef *)(0x58000000UL + 163 * 0x400UL))

