RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_163_BIT_0 (1UL << 0)
#define H7_PERIPH_163_BIT_1 (1UL << 1)
#define H7_PERIPH_163_BIT_2 (1UL << 2)
#define H7_PERIPH_163_BIT_3 (1UL << 3)
#define H7_PERIPH_163_BIT_4 (1UL << 4)
#define H7_PERIPH_163_BIT_5 (1UL << 5)
#define H7_PERIPH_163_BIT_6 (1UL << 6)
#define H7_PERIPH_163_BIT_7 (1UL << 7)
#define H7_PERIPH_163_BIT_8 (1UL << 8)
#define H7_PERIPH_163_BIT_9 (1UL << 9)
#define H7_PERIPH_163_BIT_10 (1UL << 10)
#define H7_PERIPH_163_BIT_11 (1UL << 11)
#define H7_PERIPH_163_BIT_12 (1UL << 12)
#define H7_PERIPH_163_BIT_13 (1UL << 13)
#define H7_PERIPH_163_BIT_14 (1UL << 14)
#define H7_PERIPH_163_BIT_15 (1UL << 15)
#define H7_PERIPH_163_BIT_16 (1UL << 16)
#define H7_PERIPH_163_BIT_17 (1UL << 17)
#define H7_PERIPH_163_BIT_18 (1UL << 18)
#define H7_PERIPH_163_BIT_19 (1UL << 19)
#define H7_PERIPH_163_BIT_20 (1UL << 20)
#define H7_PERIPH_163_BIT_21 (1UL << 21)
#define H7_PERIPH_163_BIT_22 (1UL << 22)
#define H7_PERIPH_163_BIT_23 (1UL << 23)
#define H7_PERIPH_163_BIT_24 (1UL << 24)
#define H7_PERIPH_163_BIT_25 (1UL << 25)
#define H7_PERIPH_163_BIT_26 (1UL << 26)
#define H7_PERIPH_163_BIT_27 (1UL << 27)
#define H7_PERIPH_163_BIT_28 (1UL << 28)
#define H7_PERIPH_163_BIT_29 (1UL << 29)
#define H7_PERIPH_163_BIT_30 (1UL << 30)
#define H7_PERIPH_163_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_164_TypeDef;
#define H7_PERIPH_164 ((H7_PERIPH_164_TypeDef *)(0x58000000UL + 164 * 0x400UL))

#define H7_PERIPH_164_BIT_0 (1UL << 0)
#define H7_PERIPH_164_BIT_1 (1UL << 1)
#define H7_PERIPH_164_BIT_2 (1UL << 2)
#define H7_PERIPH_164_BIT_3 (1UL << 3)
#define H7_PERIPH_164_BIT_4 (1UL << 4)
#define H7_PERIPH_164_BIT_5 (1UL << 5)
#define H7_PERIPH_164_BIT_6 (1UL << 6)
#define H7_PERIPH_164_BIT_7 (1UL << 7)
#define H7_PERIPH_164_BIT_8 (1UL << 8)
#define H7_PERIPH_164_BIT_9 (1UL << 9)
#define H7_PERIPH_164_BIT_10 (1UL << 10)
#define H7_PERIPH_164_BIT_11 (1UL << 11)
#define H7_PERIPH_164_BIT_12 (1UL << 12)
#define H7_PERIPH_164_BIT_13 (1UL << 13)
#define H7_PERIPH_164_BIT_14 (1UL << 14)
#define H7_PERIPH_164_BIT_15 (1UL << 15)
#define H7_PERIPH_164_BIT_16 (1UL << 16)
#define H7_PERIPH_164_BIT_17 (1UL << 17)
#define H7_PERIPH_164_BIT_18 (1UL << 18)
#define H7_PERIPH_164_BIT_19 (1UL << 19)
#define H7_PERIPH_164_BIT_20 (1UL << 20)
#define H7_PERIPH_164_BIT_21 (1UL << 21)
#define H7_PERIPH_164_BIT_22 (1UL << 22)
#define H7_PERIPH_164_BIT_23 (1UL << 23)
#define H7_PERIPH_164_BIT_24 (1UL << 24)
#define H7_PERIPH_164_BIT_25 (1UL << 25)
#define H7_PERIPH_164_BIT_26 (1UL << 26)
#define H7_PERIPH_164_BIT_27 (1UL << 27)
#define H7_PERIPH_164_BIT_28 (1UL << 28)
#define H7_PERIPH_164_BIT_29 (1UL << 29)
#define H7_PERIPH_164_BIT_30 (1UL << 30)
#define H7_PERIPH_164_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_165_TypeDef;
#define H7_PERIPH_165 ((H7_PERIPH_165_TypeDef *)(0x58000000UL + 165 * 0x400UL))

#define H7_PERIPH_165_BIT_0 (1UL << 0)
#define H7_PERIPH_165_BIT_1 (1UL << 1)
#define H7_PERIPH_165_BIT_2 (1UL << 2)
#define H7_PERIPH_165_BIT_3 (1UL << 3)
#define H7_PERIPH_165_BIT_4 (1UL << 4)
#define H7_PERIPH_165_BIT_5 (1UL << 5)
#define H7_PERIPH_165_BIT_6 (1UL << 6)
#define H7_PERIPH_165_BIT_7 (1UL << 7)
#define H7_PERIPH_165_BIT_8 (1UL << 8)
#define H7_PERIPH_165_BIT_9 (1UL << 9)
#define H7_PERIPH_165_BIT_10 (1UL << 10)
#define H7_PERIPH_165_BIT_11 (1UL << 11)
#define H7_PERIPH_165_BIT_12 (1UL << 12)
#define H7_PERIPH_165_BIT_13 (1UL << 13)
#define H7_PERIPH_165_BIT_14 (1UL << 14)
#define H7_PERIPH_165_BIT_15 (1UL << 15)
#define H7_PERIPH_165_BIT_16 (1UL << 16)
#define H7_PERIPH_165_BIT_17 (1UL << 17)
#define H7_PERIPH_165_BIT_18 (1UL << 18)
#define H7_PERIPH_165_BIT_19 (1UL << 19)
#define H7_PERIPH_165_BIT_20 (1UL << 20)
#define H7_PERIPH_165_BIT_21 (1UL << 21)
#define H7_PERIPH_165_BIT_22 (1UL << 22)
#define H7_PERIPH_165_BIT_23 (1UL << 23)
#define H7_PERIPH_165_BIT_24 (1UL << 24)
#define H7_PERIPH_165_BIT_25 (1UL << 25)
#define H7_PERIPH_165_BIT_26 (1UL << 26)
#define H7_PERIPH_165_BIT_27 (1UL << 27)
#define H7_PERIPH_165_BIT_28 (1UL << 28)
#define H7_PERIPH_165_BIT_29 (1UL << 29)
#define H7_PERIPH_165_BIT_30 (1UL << 30)
#define H7_PERIPH_165_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_166_TypeDef;
#define H7_PERIPH_166 ((H7_PERIPH_166_TypeDef *)(0x58000000UL + 166 * 0x400UL))

#define H7_PERIPH_166_BIT_0 (1UL << 0)
#define H7_PERIPH_166_BIT_1 (1UL << 1)
#define H7_PERIPH_166_BIT_2 (1UL << 2)
#define H7_PERIPH_166_BIT_3 (1UL << 3)
#define H7_PERIPH_166_BIT_4 (1UL << 4)
#define H7_PERIPH_166_BIT_5 (1UL << 5)
#define H7_PERIPH_166_BIT_6 (1UL << 6)
#define H7_PERIPH_166_BIT_7 (1UL << 7)
#define H7_PERIPH_166_BIT_8 (1UL << 8)
#define H7_PERIPH_166_BIT_9 (1UL << 9)
#define H7_PERIPH_166_BIT_10 (1UL << 10)
#define H7_PERIPH_166_BIT_11 (1UL << 11)
#define H7_PERIPH_166_BIT_12 (1UL << 12)
#define H7_PERIPH_166_BIT_13 (1UL << 13)
#define H7_PERIPH_166_BIT_14 (1UL << 14)
#define H7_PERIPH_166_BIT_15 (1UL << 15)
#define H7_PERIPH_166_BIT_16 (1UL << 16)
#define H7_PERIPH_166_BIT_17 (1UL << 17)
#define H7_PERIPH_166_BIT_18 (1UL << 18)
#define H7_PERIPH_166_BIT_19 (1UL << 19)
#define H7_PERIPH_166_BIT_20 (1UL << 20)
#define H7_PERIPH_166_BIT_21 (1UL << 21)
#define H7_PERIPH_166_BIT_22 (1UL << 22)
#define H7_PERIPH_166_BIT_23 (1UL << 23)
#define H7_PERIPH_166_BIT_24 (1UL << 24)
#define H7_PERIPH_166_BIT_25 (1UL << 25)
#define H7_PERIPH_166_BIT_26 (1UL << 26)
#define H7_PERIPH_166_BIT_27 (1UL << 27)
#define H7_PERIPH_166_BIT_28 (1UL << 28)
#define H7_PERIPH_166_BIT_29 (1UL << 29)
#define H7_PERIPH_166_BIT_30 (1UL << 30)
#define H7_PERIPH_166_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_167_TypeDef;
#define H7_PERIPH_167 ((H7_PERIPH_167_TypeDef *)(0x58000000UL + 167 * 0x400UL))

#define H7_PERIPH_167_BIT_0 (1UL << 0)
#define H7_PERIPH_167_BIT_1 (1UL << 1)
#define H7_PERIPH_167_BIT_2 (1UL << 2)
#define H7_PERIPH_167_BIT_3 (1UL << 3)
#define H7_PERIPH_167_BIT_4 (1UL << 4)
#define H7_PERIPH_167_BIT_5 (1UL << 5)
#define H7_PERIPH_167_BIT_6 (1UL << 6)
#define H7_PERIPH_167_BIT_7 (1UL << 7)
#define H7_PERIPH_167_BIT_8 (1UL << 8)
#define H7_PERIPH_167_BIT_9 (1UL << 9)
#define H7_PERIPH_167_BIT_10 (1UL << 10)
#define H7_PERIPH_167_BIT_11 (1UL << 11)
#define H7_PERIPH_167_BIT_12 (1UL << 12)
#define H7_PERIPH_167_BIT_13 (1UL << 13)
#define H7_PERIPH_167_BIT_14 (1UL << 14)
#define H7_PERIPH_167_BIT_15 (1UL << 15)
#define H7_PERIPH_167_BIT_16 (1UL << 16)
#define H7_PERIPH_167_BIT_17 (1UL << 17)
#define H7_PERIPH_167_BIT_18 (1UL << 18)
#define H7_PERIPH_167_BIT_19 (1UL << 19)
#define H7_PERIPH_167_BIT_20 (1UL << 20)
#define H7_PERIPH_167_BIT_21 (1UL << 21)
#define H7_PERIPH_167_BIT_22 (1UL << 22)
#define H7_PERIPH_167_BIT_23 (1UL << 23)
#define H7_PERIPH_167_BIT_24 (1UL << 24)
#define H7_PERIPH_167_BIT_25 (1UL << 25)
#define H7_PERIPH_167_BIT_26 (1UL << 26)
#define H7_PERIPH_167_BIT_27 (1UL << 27)
#define H7_PERIPH_167_BIT_28 (1UL << 28)
#define H7_PERIPH_167_BIT_29 (1UL << 29)
#define H7_PERIPH_167_BIT_30 (1UL << 30)
#define H7_PERIPH_167_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_168_TypeDef;
#define H7_PERIPH_168 ((H7_PERIPH_168_TypeDef *)(0x58000000UL + 168 * 0x400UL))

#define H7_PERIPH_168_BIT_0 (1UL << 0)
#define H7_PERIPH_168_BIT_1 (1UL << 1)
#define H7_PERIPH_168_BIT_2 (1UL << 2)
#define H7_PERIPH_168_BIT_3 (1UL << 3)
#define H7_PERIPH_168_BIT_4 (1UL << 4)
#define H7_PERIPH_168_BIT_5 (1UL << 5)
#define H7_PERIPH_168_BIT_6 (1UL << 6)
#define H7_PERIPH_168_BIT_7 (1UL << 7)
#define H7_PERIPH_168_BIT_8 (1UL << 8)
#define H7_PERIPH_168_BIT_9 (1UL << 9)
#define H7_PERIPH_168_BIT_10 (1UL << 10)
#define H7_PERIPH_168_BIT_11 (1UL << 11)
#define H7_PERIPH_168_BIT_12 (1UL << 12)
#define H7_PERIPH_168_BIT_13 (1UL << 13)
#define H7_PERIPH_168_BIT_14 (1UL << 14)
#define H7_PERIPH_168_BIT_15 (1UL << 15)
#define H7_PERIPH_168_BIT_16 (1UL << 16)
#define H7_PERIPH_168_BIT_17 (1UL << 17)
#define H7_PERIPH_168_BIT_18 (1UL << 18)
#define H7_PERIPH_168_BIT_19 (1UL << 19)
#define H7_PERIPH_168_BIT_20 (1UL << 20)
#define H7_PERIPH_168_BIT_21 (1UL << 21)
#define H7_PERIPH_168_BIT_22 (1UL << 22)
#define H7_PERIPH_168_BIT_23 (1UL << 23)
#define H7_PERIPH_168_BIT_24 (1UL << 24)
#define H7_PERIPH_168_BIT_25 (1UL << 25)
#define H7_PERIPH_168_BIT_26 (1UL << 26)
#define H7_PERIPH_168_BIT_27 (1UL << 27)
#define H7_PERIPH_168_BIT_28 (1UL << 28)
#define H7_PERIPH_168_BIT_29 (1UL << 29)
#define H7_PERIPH_168_BIT_30 (1UL << 30)
#define H7_PERIPH_168_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_169_TypeDef;
#define H7_PERIPH_169 ((H7_PERIPH_169_TypeDef *)(0x58000000UL + 169 * 0x400UL))

#define H7_PERIPH_169_BIT_0 (1UL << 0)
#define H7_PERIPH_169_BIT_1 (1UL << 1)
#define H7_PERIPH_169_BIT_2 (1UL << 2)
#define H7_PERIPH_169_BIT_3 (1UL << 3)
#define H7_PERIPH_169_BIT_4 (1UL << 4)
#define H7_PERIPH_169_BIT_5 (1UL << 5)
#define H7_PERIPH_169_BIT_6 (1UL << 6)
#define H7_PERIPH_169_BIT_7 (1UL << 7)
#define H7_PERIPH_169_BIT_8 (1UL << 8)
#define H7_PERIPH_169_BIT_9 (1UL << 9)
#define H7_PERIPH_169_BIT_10 (1UL << 10)
#define H7_PERIPH_169_BIT_11 (1UL << 11)
#define H7_PERIPH_169_BIT_12 (1UL << 12)
#define H7_PERIPH_169_BIT_13 (1UL << 13)
#define H7_PERIPH_169_BIT_14 (1UL << 14)
#define H7_PERIPH_169_BIT_15 (1UL << 15)
#define H7_PERIPH_169_BIT_16 (1UL << 16)
#define H7_PERIPH_169_BIT_17 (1UL << 17)
#define H7_PERIPH_169_BIT_18 (1UL << 18)
#define H7_PERIPH_169_BIT_19 (1UL << 19)
#define H7_PERIPH_169_BIT_20 (1UL << 20)
#define H7_PERIPH_169_BIT_21 (1UL << 21)
#define H7_PERIPH_169_BIT_22 (1UL << 22)
#define H7_PERIPH_169_BIT_23 (1UL << 23)
#define H7_PERIPH_169_BIT_24 (1UL << 24)
#define H7_PERIPH_169_BIT_25 (1UL << 25)
#define H7_PERIPH_169_BIT_26 (1UL << 26)
#define H7_PERIPH_169_BIT_27 (1UL << 27)
#define H7_PERIPH_169_BIT_28 (1UL << 28)
#define H7_PERIPH_169_BIT_29 (1UL << 29)
#define H7_PERIPH_169_BIT_30 (1UL << 30)
#define H7_PERIPH_169_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_170_TypeDef;
#define H7_PERIPH_170 ((H7_PERIPH_170_TypeDef *)(0x58000000UL + 170 * 0x400UL))

#define H7_PERIPH_170_BIT_0 (1UL << 0)
#define H7_PERIPH_170_BIT_1 (1UL << 1)
#define H7_PERIPH_170_BIT_2 (1UL << 2)
#define H7_PERIPH_170_BIT_3 (1UL << 3)
#define H7_PERIPH_170_BIT_4 (1UL << 4)
#define H7_PERIPH_170_BIT_5 (1UL << 5)
#define H7_PERIPH_170_BIT_6 (1UL << 6)
#define H7_PERIPH_170_BIT_7 (1UL << 7)
#define H7_PERIPH_170_BIT_8 (1UL << 8)
#define H7_PERIPH_170_BIT_9 (1UL << 9)
#define H7_PERIPH_170_BIT_10 (1UL << 10)
#define H7_PERIPH_170_BIT_11 (1UL << 11)
#define H7_PERIPH_170_BIT_12 (1UL << 12)
#define H7_PERIPH_170_BIT_13 (1UL << 13)
#define H7_PERIPH_170_BIT_14 (1UL << 14)
#define H7_PERIPH_170_BIT_15 (1UL << 15)
#define H7_PERIPH_170_BIT_16 (1UL << 16)
#define H7_PERIPH_170_BIT_17 (1UL << 17)
#define H7_PERIPH_170_BIT_18 (1UL << 18)
#define H7_PERIPH_170_BIT_19 (1UL << 19)
#define H7_PERIPH_170_BIT_20 (1UL << 20)
#define H7_PERIPH_170_BIT_21 (1UL << 21)
#define H7_PERIPH_170_BIT_22 (1UL << 22)
#define H7_PERIPH_170_BIT_23 (1UL << 23)
#define H7_PERIPH_170_BIT_24 (1UL << 24)
#define H7_PERIPH_170_BIT_25 (1UL << 25)
#define H7_PERIPH_170_BIT_26 (1UL << 26)
#define H7_PERIPH_170_BIT_27 (1UL << 27)
#define H7_PERIPH_170_BIT_28 (1UL << 28)
#define H7_PERIPH_170_BIT_29 (1UL << 29)
#define H7_PERIPH_170_BIT_30 (1UL << 30)
#define H7_PERIPH_170_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_171_TypeDef;
#define H7_PERIPH_171 ((H7_PERIPH_171_TypeDef *)(0x58000000UL + 171 * 0x400UL))

#define H7_PERIPH_171_BIT_0 (1UL << 0)
#define H7_PERIPH_171_BIT_1 (1UL << 1)
#define H7_PERIPH_171_BIT_2 (1UL << 2)
#define H7_PERIPH_171_BIT_3 (1UL << 3)
#define H7_PERIPH_171_BIT_4 (1UL << 4)
#define H7_PERIPH_171_BIT_5 (1UL << 5)
#define H7_PERIPH_171_BIT_6 (1UL << 6)
#define H7_PERIPH_171_BIT_7 (1UL << 7)
#define H7_PERIPH_171_BIT_8 (1UL << 8)
#define H7_PERIPH_171_BIT_9 (1UL << 9)
#define H7_PERIPH_171_BIT_10 (1UL << 10)
#define H7_PERIPH_171_BIT_11 (1UL << 11)
#define H7_PERIPH_171_BIT_12 (1UL << 12)
#define H7_PERIPH_171_BIT_13 (1UL << 13)
#define H7_PERIPH_171_BIT_14 (1UL << 14)
#define H7_PERIPH_171_BIT_15 (1UL << 15)
#define H7_PERIPH_171_BIT_16 (1UL << 16)
#define H7_PERIPH_171_BIT_17 (1UL << 17)
#define H7_PERIPH_171_BIT_18 (1UL << 18)
#define H7_PERIPH_171_BIT_19 (1UL << 19)
#define H7_PERIPH_171_BIT_20 (1UL << 20)
#define H7_PERIPH_171_BIT_21 (1UL << 21)
#define H7_PERIPH_171_BIT_22 (1UL << 22)
#define H7_PERIPH_171_BIT_23 (1UL << 23)
#define H7_PERIPH_171_BIT_24 (1UL << 24)
#define H7_PERIPH_171_BIT_25 (1UL << 25)
#define H7_PERIPH_171_BIT_26 (1UL << 26)
#define H7_PERIPH_171_BIT_27 (1UL << 27)
#define H7_PERIPH_171_BIT_28 (1UL << 28)
#define H7_PERIPH_171_BIT_29 (1UL << 29)
#define H7_PERIPH_171_BIT_30 (1UL << 30)
#define H7_PERIPH_171_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_172_TypeDef;
#define H7_PERIPH_172 ((H7_PERIPH_172_TypeDef *)(0x58000000UL + 172 * 0x400UL))

#define H7_PERIPH_172_BIT_0 (1UL << 0)
#define H7_PERIPH_172_BIT_1 (1UL << 1)
#define H7_PERIPH_172_BIT_2 (1UL << 2)
#define H7_PERIPH_172_BIT_3 (1UL << 3)
#define H7_PERIPH_172_BIT_4 (1UL << 4)
#define H7_PERIPH_172_BIT_5 (1UL << 5)
#define H7_PERIPH_172_BIT_6 (1UL << 6)
#define H7_PERIPH_172_BIT_7 (1UL << 7)
#define H7_PERIPH_172_BIT_8 (1UL << 8)
#define H7_PERIPH_172_BIT_9 (1UL << 9)
#define H7_PERIPH_172_BIT_10 (1UL << 10)
#define H7_PERIPH_172_BIT_11 (1UL << 11)
#define H7_PERIPH_172_BIT_12 (1UL << 12)
#define H7_PERIPH_172_BIT_13 (1UL << 13)
#define H7_PERIPH_172_BIT_14 (1UL << 14)
#define H7_PERIPH_172_BIT_15 (1UL << 15)
#define H7_PERIPH_172_BIT_16 (1UL << 16)
#define H7_PERIPH_172_BIT_17 (1UL << 17)
#define H7_PERIPH_172_BIT_18 (1UL << 18)
#define H7_PERIPH_172_BIT_19 (1UL << 19)
#define H7_PERIPH_172_BIT_20 (1UL << 20)
#define H7_PERIPH_172_BIT_21 (1UL << 21)
#define H7_PERIPH_172_BIT_22 (1UL << 22)
#define H7_PERIPH_172_BIT_23 (1UL << 23)
#define H7_PERIPH_172_BIT_24 (1UL << 24)
#define H7_PERIPH_172_BIT_25 (1UL << 25)
#define H7_PERIPH_172_BIT_26 (1UL << 26)
#define H7_PERIPH_172_BIT_27 (1UL << 27)
#define H7_PERIPH_172_BIT_28 (1UL << 28)
#define H7_PERIPH_172_BIT_29 (1UL << 29)
#define H7_PERIPH_172_BIT_30 (1UL << 30)
#define H7_PERIPH_172_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_173_TypeDef;
#define H7_PERIPH_173 ((H7_PERIPH_173_TypeDef *)(0x58000000UL + 173 * 0x400UL))

