RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_173_BIT_0 (1UL << 0)
#define H7_PERIPH_173_BIT_1 (1UL << 1)
#define H7_PERIPH_173_BIT_2 (1UL << 2)
#define H7_PERIPH_173_BIT_3 (1UL << 3)
#define H7_PERIPH_173_BIT_4 (1UL << 4)
#define H7_PERIPH_173_BIT_5 (1UL << 5)
#define H7_PERIPH_173_BIT_6 (1UL << 6)
#define H7_PERIPH_173_BIT_7 (1UL << 7)
#define H7_PERIPH_173_BIT_8 (1UL << 8)
#define H7_PERIPH_173_BIT_9 (1UL << 9)
#define H7_PERIPH_173_BIT_10 (1UL << 10)
#define H7_PERIPH_173_BIT_11 (1UL << 11)
#define H7_PERIPH_173_BIT_12 (1UL << 12)
#define H7_PERIPH_173_BIT_13 (1UL << 13)
#define H7_PERIPH_173_BIT_14 (1UL << 14)
#define H7_PERIPH_173_BIT_15 (1UL << 15)
#define H7_PERIPH_173_BIT_16 (1UL << 16)
#define H7_PERIPH_173_BIT_17 (1UL << 17)
#define H7_PERIPH_173_BIT_18 (1UL << 18)
#define H7_PERIPH_173_BIT_19 (1UL << 19)
#define H7_PERIPH_173_BIT_20 (1UL << 20)
#define H7_PERIPH_173_BIT_21 (1UL << 21)
#define H7_PERIPH_173_BIT_22 (1UL << 22)
#define H7_PERIPH_173_BIT_23 (1UL << 23)
#define H7_PERIPH_173_BIT_24 (1UL << 24)
#define H7_PERIPH_173_BIT_25 (1UL << 25)
#define H7_PERIPH_173_BIT_26 (1UL << 26)
#define H7_PERIPH_173_BIT_27 (1UL << 27)
#define H7_PERIPH_173_BIT_28 (1UL << 28)
#define H7_PERIPH_173_BIT_29 (1UL << 29)
#define H7_PERIPH_173_BIT_30 (1UL << 30)
#define H7_PERIPH_173_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_174_TypeDef;
#define H7_PERIPH_174 ((H7_PERIPH_174_TypeDef *)(0x58000000UL + 174 * 0x400UL))

#define H7_PERIPH_174_BIT_0 (1UL << 0)
#define H7_PERIPH_174_BIT_1 (1UL << 1)
#define H7_PERIPH_174_BIT_2 (1UL << 2)
#define H7_PERIPH_174_BIT_3 (1UL << 3)
#define H7_PERIPH_174_BIT_4 (1UL << 4)
#define H7_PERIPH_174_BIT_5 (1UL << 5)
#define H7_PERIPH_174_BIT_6 (1UL << 6)
#define H7_PERIPH_174_BIT_7 (1UL << 7)
#define H7_PERIPH_174_BIT_8 (1UL << 8)
#define H7_PERIPH_174_BIT_9 (1UL << 9)
#define H7_PERIPH_174_BIT_10 (1UL << 10)
#define H7_PERIPH_174_BIT_11 (1UL << 11)
#define H7_PERIPH_174_BIT_12 (1UL << 12)
#define H7_PERIPH_174_BIT_13 (1UL << 13)
#define H7_PERIPH_174_BIT_14 (1UL << 14)
#define H7_PERIPH_174_BIT_15 (1UL << 15)
#define H7_PERIPH_174_BIT_16 (1UL << 16)
#define H7_PERIPH_174_BIT_17 (1UL << 17)
#define H7_PERIPH_174_BIT_18 (1UL << 18)
#define H7_PERIPH_174_BIT_19 (1UL << 19)
#define H7_PERIPH_174_BIT_20 (1UL << 20)
#define H7_PERIPH_174_BIT_21 (1UL << 21)
#define H7_PERIPH_174_BIT_22 (1UL << 22)
#define H7_PERIPH_174_BIT_23 (1UL << 23)
#define H7_PERIPH_174_BIT_24 (1UL << 24)
#define H7_PERIPH_174_BIT_25 (1UL << 25)
#define H7_PERIPH_174_BIT_26 (1UL << 26)
#define H7_PERIPH_174_BIT_27 (1UL << 27)
#define H7_PERIPH_174_BIT_28 (1UL << 28)
#define H7_PERIPH_174_BIT_29 (1UL << 29)
#define H7_PERIPH_174_BIT_30 (1UL << 30)
#define H7_PERIPH_174_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_175_TypeDef;
#define H7_PERIPH_175 ((H7_PERIPH_175_TypeDef *)(0x58000000UL + 175 * 0x400UL))

#define H7_PERIPH_175_BIT_0 (1UL << 0)
#define H7_PERIPH_175_BIT_1 (1UL << 1)
#define H7_PERIPH_175_BIT_2 (1UL << 2)
#define H7_PERIPH_175_BIT_3 (1UL << 3)
#define H7_PERIPH_175_BIT_4 (1UL << 4)
#define H7_PERIPH_175_BIT_5 (1UL << 5)
#define H7_PERIPH_175_BIT_6 (1UL << 6)
#define H7_PERIPH_175_BIT_7 (1UL << 7)
#define H7_PERIPH_175_BIT_8 (1UL << 8)
#define H7_PERIPH_175_BIT_9 (1UL << 9)
#define H7_PERIPH_175_BIT_10 (1UL << 10)
#define H7_PERIPH_175_BIT_11 (1UL << 11)
#define H7_PERIPH_175_BIT_12 (1UL << 12)
#define H7_PERIPH_175_BIT_13 (1UL << 13)
#define H7_PERIPH_175_BIT_14 (1UL << 14)
#define H7_PERIPH_175_BIT_15 (1UL << 15)
#define H7_PERIPH_175_BIT_16 (1UL << 16)
#define H7_PERIPH_175_BIT_17 (1UL << 17)
#define H7_PERIPH_175_BIT_18 (1UL << 18)
#define H7_PERIPH_175_BIT_19 (1UL << 19)
#define H7_PERIPH_175_BIT_20 (1UL << 20)
#define H7_PERIPH_175_BIT_21 (1UL << 21)
#define H7_PERIPH_175_BIT_22 (1UL << 22)
#define H7_PERIPH_175_BIT_23 (1UL << 23)
#define H7_PERIPH_175_BIT_24 (1UL << 24)
#define H7_PERIPH_175_BIT_25 (1UL << 25)
#define H7_PERIPH_175_BIT_26 (1UL << 26)
#define H7_PERIPH_175_BIT_27 (1UL << 27)
#define H7_PERIPH_175_BIT_28 (1UL << 28)
#define H7_PERIPH_175_BIT_29 (1UL << 29)
#define H7_PERIPH_175_BIT_30 (1UL << 30)
#define H7_PERIPH_175_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_176_TypeDef;
#define H7_PERIPH_176 ((H7_PERIPH_176_TypeDef *)(0x58000000UL + 176 * 0x400UL))

#define H7_PERIPH_176_BIT_0 (1UL << 0)
#define H7_PERIPH_176_BIT_1 (1UL << 1)
#define H7_PERIPH_176_BIT_2 (1UL << 2)
#define H7_PERIPH_176_BIT_3 (1UL << 3)
#define H7_PERIPH_176_BIT_4 (1UL << 4)
#define H7_PERIPH_176_BIT_5 (1UL << 5)
#define H7_PERIPH_176_BIT_6 (1UL << 6)
#define H7_PERIPH_176_BIT_7 (1UL << 7)
#define H7_PERIPH_176_BIT_8 (1UL << 8)
#define H7_PERIPH_176_BIT_9 (1UL << 9)
#define H7_PERIPH_176_BIT_10 (1UL << 10)
#define H7_PERIPH_176_BIT_11 (1UL << 11)
#define H7_PERIPH_176_BIT_12 (1UL << 12)
#define H7_PERIPH_176_BIT_13 (1UL << 13)
#define H7_PERIPH_176_BIT_14 (1UL << 14)
#define H7_PERIPH_176_BIT_15 (1UL << 15)
#define H7_PERIPH_176_BIT_16 (1UL << 16)
#define H7_PERIPH_176_BIT_17 (1UL << 17)
#define H7_PERIPH_176_BIT_18 (1UL << 18)
#define H7_PERIPH_176_BIT_19 (1UL << 19)
#define H7_PERIPH_176_BIT_20 (1UL << 20)
#define H7_PERIPH_176_BIT_21 (1UL << 21)
#define H7_PERIPH_176_BIT_22 (1UL << 22)
#define H7_PERIPH_176_BIT_23 (1UL << 23)
#define H7_PERIPH_176_BIT_24 (1UL << 24)
#define H7_PERIPH_176_BIT_25 (1UL << 25)
#define H7_PERIPH_176_BIT_26 (1UL << 26)
#define H7_PERIPH_176_BIT_27 (1UL << 27)
#define H7_PERIPH_176_BIT_28 (1UL << 28)
#define H7_PERIPH_176_BIT_29 (1UL << 29)
#define H7_PERIPH_176_BIT_30 (1UL << 30)
#define H7_PERIPH_176_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_177_TypeDef;
#define H7_PERIPH_177 ((H7_PERIPH_177_TypeDef *)(0x58000000UL + 177 * 0x400UL))

#define H7_PERIPH_177_BIT_0 (1UL << 0)
#define H7_PERIPH_177_BIT_1 (1UL << 1)
#define H7_PERIPH_177_BIT_2 (1UL << 2)
#define H7_PERIPH_177_BIT_3 (1UL << 3)
#define H7_PERIPH_177_BIT_4 (1UL << 4)
#define H7_PERIPH_177_BIT_5 (1UL << 5)
#define H7_PERIPH_177_BIT_6 (1UL << 6)
#define H7_PERIPH_177_BIT_7 (1UL << 7)
#define H7_PERIPH_177_BIT_8 (1UL << 8)
#define H7_PERIPH_177_BIT_9 (1UL << 9)
#define H7_PERIPH_177_BIT_10 (1UL << 10)
#define H7_PERIPH_177_BIT_11 (1UL << 11)
#define H7_PERIPH_177_BIT_12 (1UL << 12)
#define H7_PERIPH_177_BIT_13 (1UL << 13)
#define H7_PERIPH_177_BIT_14 (1UL << 14)
#define H7_PERIPH_177_BIT_15 (1UL << 15)
#define H7_PERIPH_177_BIT_16 (1UL << 16)
#define H7_PERIPH_177_BIT_17 (1UL << 17)
#define H7_PERIPH_177_BIT_18 (1UL << 18)
#define H7_PERIPH_177_BIT_19 (1UL << 19)
#define H7_PERIPH_177_BIT_20 (1UL << 20)
#define H7_PERIPH_177_BIT_21 (1UL << 21)
#define H7_PERIPH_177_BIT_22 (1UL << 22)
#define H7_PERIPH_177_BIT_23 (1UL << 23)
#define H7_PERIPH_177_BIT_24 (1UL << 24)
#define H7_PERIPH_177_BIT_25 (1UL << 25)
#define H7_PERIPH_177_BIT_26 (1UL << 26)
#define H7_PERIPH_177_BIT_27 (1UL << 27)
#define H7_PERIPH_177_BIT_28 (1UL << 28)
#define H7_PERIPH_177_BIT_29 (1UL << 29)
#define H7_PERIPH_177_BIT_30 (1UL << 30)
#define H7_PERIPH_177_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_178_TypeDef;
#define H7_PERIPH_178 ((H7_PERIPH_178_TypeDef *)(0x58000000UL + 178 * 0x400UL))

#define H7_PERIPH_178_BIT_0 (1UL << 0)
#define H7_PERIPH_178_BIT_1 (1UL << 1)
#define H7_PERIPH_178_BIT_2 (1UL << 2)
#define H7_PERIPH_178_BIT_3 (1UL << 3)
#define H7_PERIPH_178_BIT_4 (1UL << 4)
#define H7_PERIPH_178_BIT_5 (1UL << 5)
#define H7_PERIPH_178_BIT_6 (1UL << 6)
#define H7_PERIPH_178_BIT_7 (1UL << 7)
#define H7_PERIPH_178_BIT_8 (1UL << 8)
#define H7_PERIPH_178_BIT_9 (1UL << 9)
#define H7_PERIPH_178_BIT_10 (1UL << 10)
#define H7_PERIPH_178_BIT_11 (1UL << 11)
#define H7_PERIPH_178_BIT_12 (1UL << 12)
#define H7_PERIPH_178_BIT_13 (1UL << 13)
#define H7_PERIPH_178_BIT_14 (1UL << 14)
#define H7_PERIPH_178_BIT_15 (1UL << 15)
#define H7_PERIPH_178_BIT_16 (1UL << 16)
#define H7_PERIPH_178_BIT_17 (1UL << 17)
#define H7_PERIPH_178_BIT_18 (1UL << 18)
#define H7_PERIPH_178_BIT_19 (1UL << 19)
#define H7_PERIPH_178_BIT_20 (1UL << 20)
#define H7_PERIPH_178_BIT_21 (1UL << 21)
#define H7_PERIPH_178_BIT_22 (1UL << 22)
#define H7_PERIPH_178_BIT_23 (1UL << 23)
#define H7_PERIPH_178_BIT_24 (1UL << 24)
#define H7_PERIPH_178_BIT_25 (1UL << 25)
#define H7_PERIPH_178_BIT_26 (1UL << 26)
#define H7_PERIPH_178_BIT_27 (1UL << 27)
#define H7_PERIPH_178_BIT_28 (1UL << 28)
#define H7_PERIPH_178_BIT_29 (1UL << 29)
#define H7_PERIPH_178_BIT_30 (1UL << 30)
#define H7_PERIPH_178_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_179_TypeDef;
#define H7_PERIPH_179 ((H7_PERIPH_179_TypeDef *)(0x58000000UL + 179 * 0x400UL))

#define H7_PERIPH_179_BIT_0 (1UL << 0)
#define H7_PERIPH_179_BIT_1 (1UL << 1)
#define H7_PERIPH_179_BIT_2 (1UL << 2)
#define H7_PERIPH_179_BIT_3 (1UL << 3)
#define H7_PERIPH_179_BIT_4 (1UL << 4)
#define H7_PERIPH_179_BIT_5 (1UL << 5)
#define H7_PERIPH_179_BIT_6 (1UL << 6)
#define H7_PERIPH_179_BIT_7 (1UL << 7)
#define H7_PERIPH_179_BIT_8 (1UL << 8)
#define H7_PERIPH_179_BIT_9 (1UL << 9)
#define H7_PERIPH_179_BIT_10 (1UL << 10)
#define H7_PERIPH_179_BIT_11 (1UL << 11)
#define H7_PERIPH_179_BIT_12 (1UL << 12)
#define H7_PERIPH_179_BIT_13 (1UL << 13)
#define H7_PERIPH_179_BIT_14 (1UL << 14)
#define H7_PERIPH_179_BIT_15 (1UL << 15)
#define H7_PERIPH_179_BIT_16 (1UL << 16)
#define H7_PERIPH_179_BIT_17 (1UL << 17)
#define H7_PERIPH_179_BIT_18 (1UL << 18)
#define H7_PERIPH_179_BIT_19 (1UL << 19)
#define H7_PERIPH_179_BIT_20 (1UL << 20)
#define H7_PERIPH_179_BIT_21 (1UL << 21)
#define H7_PERIPH_179_BIT_22 (1UL << 22)
#define H7_PERIPH_179_BIT_23 (1UL << 23)
#define H7_PERIPH_179_BIT_24 (1UL << 24)
#define H7_PERIPH_179_BIT_25 (1UL << 25)
#define H7_PERIPH_179_BIT_26 (1UL << 26)
#define H7_PERIPH_179_BIT_27 (1UL << 27)
#define H7_PERIPH_179_BIT_28 (1UL << 28)
#define H7_PERIPH_179_BIT_29 (1UL << 29)
#define H7_PERIPH_179_BIT_30 (1UL << 30)
#define H7_PERIPH_179_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_180_TypeDef;
#define H7_PERIPH_180 ((H7_PERIPH_180_TypeDef *)(0x58000000UL + 180 * 0x400UL))

