RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_180_BIT_0 (1UL << 0)
#define H7_PERIPH_180_BIT_1 (1UL << 1)
#define H7_PERIPH_180_BIT_2 (1UL << 2)
#define H7_PERIPH_180_BIT_3 (1UL << 3)
#define H7_PERIPH_180_BIT_4 (1UL << 4)
#define H7_PERIPH_180_BIT_5 (1UL << 5)
#define H7_PERIPH_180_BIT_6 (1UL << 6)
#define H7_PERIPH_180_BIT_7 (1UL << 7)
#define H7_PERIPH_180_BIT_8 (1UL << 8)
#define H7_PERIPH_180_BIT_9 (1UL << 9)
#define H7_PERIPH_180_BIT_10 (1UL << 10)
#define H7_PERIPH_180_BIT_11 (1UL << 11)
#define H7_PERIPH_180_BIT_12 (1UL << 12)
#define H7_PERIPH_180_BIT_13 (1UL << 13)
#define H7_PERIPH_180_BIT_14 (1UL << 14)
#define H7_PERIPH_180_BIT_15 (1UL << 15)
#define H7_PERIPH_180_BIT_16 (1UL << 16)
#define H7_PERIPH_180_BIT_17 (1UL << 17)
#define H7_PERIPH_180_BIT_18 (1UL << 18)
#define H7_PERIPH_180_BIT_19 (1UL << 19)
#define H7_PERIPH_180_BIT_20 (1UL << 20)
#define H7_PERIPH_180_BIT_21 (1UL << 21)
#define H7_PERIPH_180_BIT_22 (1UL << 22)
#define H7_PERIPH_180_BIT_23 (1UL << 23)
#define H7_PERIPH_180_BIT_24 (1UL << 24)
#define H7_PERIPH_180_BIT_25 (1UL << 25)
#define H7_PERIPH_180_BIT_26 (1UL << 26)
#define H7_PERIPH_180_BIT_27 (1UL << 27)
#define H7_PERIPH_180_BIT_28 (1UL << 28)
#define H7_PERIPH_180_BIT_29 (1UL << 29)
#define H7_PERIPH_180_BIT_30 (1UL << 30)
#define H7_PERIPH_180_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_181_TypeDef;
#define H7_PERIPH_181 ((H7_PERIPH_181_TypeDef *)(0x58000000UL + 181 * 0x400UL))

#define H7_PERIPH_181_BIT_0 (1UL << 0)
#define H7_PERIPH_181_BIT_1 (1UL << 1)
#define H7_PERIPH_181_BIT_2 (1UL << 2)
#define H7_PERIPH_181_BIT_3 (1UL << 3)
#define H7_PERIPH_181_BIT_4 (1UL << 4)
#define H7_PERIPH_181_BIT_5 (1UL << 5)
#define H7_PERIPH_181_BIT_6 (1UL << 6)
#define H7_PERIPH_181_BIT_7 (1UL << 7)
#define H7_PERIPH_181_BIT_8 (1UL << 8)
#define H7_PERIPH_181_BIT_9 (1UL << 9)
#define H7_PERIPH_181_BIT_10 (1UL << 10)
#define H7_PERIPH_181_BIT_11 (1UL << 11)
#define H7_PERIPH_181_BIT_12 (1UL << 12)
#define H7_PERIPH_181_BIT_13 (1UL << 13)
#define H7_PERIPH_181_BIT_14 (1UL << 14)
#define H7_PERIPH_181_BIT_15 (1UL << 15)
#define H7_PERIPH_181_BIT_16 (1UL << 16)
#define H7_PERIPH_181_BIT_17 (1UL << 17)
#define H7_PERIPH_181_BIT_18 (1UL << 18)
#define H7_PERIPH_181_BIT_19 (1UL << 19)
#define H7_PERIPH_181_BIT_20 (1UL << 20)
#define H7_PERIPH_181_BIT_21 (1UL << 21)
#define H7_PERIPH_181_BIT_22 (1UL << 22)
#define H7_PERIPH_181_BIT_23 (1UL << 23)
#define H7_PERIPH_181_BIT_24 (1UL << 24)
#define H7_PERIPH_181_BIT_25 (1UL << 25)
#define H7_PERIPH_181_BIT_26 (1UL << 26)
#define H7_PERIPH_181_BIT_27 (1UL << 27)
#define H7_PERIPH_181_BIT_28 (1UL << 28)
#define H7_PERIPH_181_BIT_29 (1UL << 29)
#define H7_PERIPH_181_BIT_30 (1UL << 30)
#define H7_PERIPH_181_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_182_TypeDef;
#define H7_PERIPH_182 ((H7_PERIPH_182_TypeDef *)(0x58000000UL + 182 * 0x400UL))

#define H7_PERIPH_182_BIT_0 (1UL << 0)
#define H7_PERIPH_182_BIT_1 (1UL << 1)
#define H7_PERIPH_182_BIT_2 (1UL << 2)
#define H7_PERIPH_182_BIT_3 (1UL << 3)
#define H7_PERIPH_182_BIT_4 (1UL << 4)
#define H7_PERIPH_182_BIT_5 (1UL << 5)
#define H7_PERIPH_182_BIT_6 (1UL << 6)
#define H7_PERIPH_182_BIT_7 (1UL << 7)
#define H7_PERIPH_182_BIT_8 (1UL << 8)
#define H7_PERIPH_182_BIT_9 (1UL << 9)
#define H7_PERIPH_182_BIT_10 (1UL << 10)
#define H7_PERIPH_182_BIT_11 (1UL << 11)
#define H7_PERIPH_182_BIT_12 (1UL << 12)
#define H7_PERIPH_182_BIT_13 (1UL << 13)
#define H7_PERIPH_182_BIT_14 (1UL << 14)
#define H7_PERIPH_182_BIT_15 (1UL << 15)
#define H7_PERIPH_182_BIT_16 (1UL << 16)
#define H7_PERIPH_182_BIT_17 (1UL << 17)
#define H7_PERIPH_182_BIT_18 (1UL << 18)
#define H7_PERIPH_182_BIT_19 (1UL << 19)
#define H7_PERIPH_182_BIT_20 (1UL << 20)
#define H7_PERIPH_182_BIT_21 (1UL << 21)
#define H7_PERIPH_182_BIT_22 (1UL << 22)
#define H7_PERIPH_182_BIT_23 (1UL << 23)
#define H7_PERIPH_182_BIT_24 (1UL << 24)
#define H7_PERIPH_182_BIT_25 (1UL << 25)
#define H7_PERIPH_182_BIT_26 (1UL << 26)
#define H7_PERIPH_182_BIT_27 (1UL << 27)
#define H7_PERIPH_182_BIT_28 (1UL << 28)
#define H7_PERIPH_182_BIT_29 (1UL << 29)
#define H7_PERIPH_182_BIT_30 (1UL << 30)
#define H7_PERIPH_182_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_183_TypeDef;
#define H7_PERIPH_183 ((H7_PERIPH_183_TypeDef *)(0x58000000UL + 183 * 0x400UL))

#define H7_PERIPH_183_BIT_0 (1UL << 0)
#define H7_PERIPH_183_BIT_1 (1UL << 1)
#define H7_PERIPH_183_BIT_2 (1UL << 2)
#define H7_PERIPH_183_BIT_3 (1UL << 3)
#define H7_PERIPH_183_BIT_4 (1UL << 4)
#define H7_PERIPH_183_BIT_5 (1UL << 5)
#define H7_PERIPH_183_BIT_6 (1UL << 6)
#define H7_PERIPH_183_BIT_7 (1UL << 7)
#define H7_PERIPH_183_BIT_8 (1UL << 8)
#define H7_PERIPH_183_BIT_9 (1UL << 9)
#define H7_PERIPH_183_BIT_10 (1UL << 10)
#define H7_PERIPH_183_BIT_11 (1UL << 11)
#define H7_PERIPH_183_BIT_12 (1UL << 12)
#define H7_PERIPH_183_BIT_13 (1UL << 13)
#define H7_PERIPH_183_BIT_14 (1UL << 14)
#define H7_PERIPH_183_BIT_15 (1UL << 15)
#define H7_PERIPH_183_BIT_16 (1UL << 16)
#define H7_PERIPH_183_BIT_17 (1UL << 17)
#define H7_PERIPH_183_BIT_18 (1UL << 18)
#define H7_PERIPH_183_BIT_19 (1UL << 19)
#define H7_PERIPH_183_BIT_20 (1UL << 20)
#define H7_PERIPH_183_BIT_21 (1UL << 21)
#define H7_PERIPH_183_BIT_22 (1UL << 22)
#define H7_PERIPH_183_BIT_23 (1UL << 23)
#define H7_PERIPH_183_BIT_24 (1UL << 24)
#define H7_PERIPH_183_BIT_25 (1UL << 25)
#define H7_PERIPH_183_BIT_26 (1UL << 26)
#define H7_PERIPH_183_BIT_27 (1UL << 27)
#define H7_PERIPH_183_BIT_28 (1UL << 28)
#define H7_PERIPH_183_BIT_29 (1UL << 29)
#define H7_PERIPH_183_BIT_30 (1UL << 30)
#define H7_PERIPH_183_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_184_TypeDef;
#define H7_PERIPH_184 ((H7_PERIPH_184_TypeDef *)(0x58000000UL + 184 * 0x400UL))

#define H7_PERIPH_184_BIT_0 (1UL << 0)
#define H7_PERIPH_184_BIT_1 (1UL << 1)
#define H7_PERIPH_184_BIT_2 (1UL << 2)
#define H7_PERIPH_184_BIT_3 (1UL << 3)
#define H7_PERIPH_184_BIT_4 (1UL << 4)
#define H7_PERIPH_184_BIT_5 (1UL << 5)
#define H7_PERIPH_184_BIT_6 (1UL << 6)
#define H7_PERIPH_184_BIT_7 (1UL << 7)
#define H7_PERIPH_184_BIT_8 (1UL << 8)
#define H7_PERIPH_184_BIT_9 (1UL << 9)
#define H7_PERIPH_184_BIT_10 (1UL << 10)
#define H7_PERIPH_184_BIT_11 (1UL << 11)
#define H7_PERIPH_184_BIT_12 (1UL << 12)
#define H7_PERIPH_184_BIT_13 (1UL << 13)
#define H7_PERIPH_184_BIT_14 (1UL << 14)
#define H7_PERIPH_184_BIT_15 (1UL << 15)
#define H7_PERIPH_184_BIT_16 (1UL << 16)
#define H7_PERIPH_184_BIT_17 (1UL << 17)
#define H7_PERIPH_184_BIT_18 (1UL << 18)
#define H7_PERIPH_184_BIT_19 (1UL << 19)
#define H7_PERIPH_184_BIT_20 (1UL << 20)
#define H7_PERIPH_184_BIT_21 (1UL << 21)
#define H7_PERIPH_184_BIT_22 (1UL << 22)
#define H7_PERIPH_184_BIT_23 (1UL << 23)
#define H7_PERIPH_184_BIT_24 (1UL << 24)
#define H7_PERIPH_184_BIT_25 (1UL << 25)
#define H7_PERIPH_184_BIT_26 (1UL << 26)
#define H7_PERIPH_184_BIT_27 (1UL << 27)
#define H7_PERIPH_184_BIT_28 (1UL << 28)
#define H7_PERIPH_184_BIT_29 (1UL << 29)
#define H7_PERIPH_184_BIT_30 (1UL << 30)
#define H7_PERIPH_184_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_185_TypeDef;
#define H7_PERIPH_185 ((H7_PERIPH_185_TypeDef *)(0x58000000UL + 185 * 0x400UL))

#define H7_PERIPH_185_BIT_0 (1UL << 0)
#define H7_PERIPH_185_BIT_1 (1UL << 1)
#define H7_PERIPH_185_BIT_2 (1UL << 2)
#define H7_PERIPH_185_BIT_3 (1UL << 3)
#define H7_PERIPH_185_BIT_4 (1UL << 4)
#define H7_PERIPH_185_BIT_5 (1UL << 5)
#define H7_PERIPH_185_BIT_6 (1UL << 6)
#define H7_PERIPH_185_BIT_7 (1UL << 7)
#define H7_PERIPH_185_BIT_8 (1UL << 8)
#define H7_PERIPH_185_BIT_9 (1UL << 9)
#define H7_PERIPH_185_BIT_10 (1UL << 10)
#define H7_PERIPH_185_BIT_11 (1UL << 11)
#define H7_PERIPH_185_BIT_12 (1UL << 12)
#define H7_PERIPH_185_BIT_13 (1UL << 13)
#define H7_PERIPH_185_BIT_14 (1UL << 14)
#define H7_PERIPH_185_BIT_15 (1UL << 15)
#define H7_PERIPH_185_BIT_16 (1UL << 16)
#define H7_PERIPH_185_BIT_17 (1UL << 17)
#define H7_PERIPH_185_BIT_18 (1UL << 18)
#define H7_PERIPH_185_BIT_19 (1UL << 19)
#define H7_PERIPH_185_BIT_20 (1UL << 20)
#define H7_PERIPH_185_BIT_21 (1UL << 21)
#define H7_PERIPH_185_BIT_22 (1UL << 22)
#define H7_PERIPH_185_BIT_23 (1UL << 23)
#define H7_PERIPH_185_BIT_24 (1UL << 24)
#define H7_PERIPH_185_BIT_25 (1UL << 25)
#define H7_PERIPH_185_BIT_26 (1UL << 26)
#define H7_PERIPH_185_BIT_27 (1UL << 27)
#define H7_PERIPH_185_BIT_28 (1UL << 28)
#define H7_PERIPH_185_BIT_29 (1UL << 29)
#define H7_PERIPH_185_BIT_30 (1UL << 30)
#define H7_PERIPH_185_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_186_TypeDef;
#define H7_PERIPH_186 ((H7_PERIPH_186_TypeDef *)(0x58000000UL + 186 * 0x400UL))

#define H7_PERIPH_186_BIT_0 (1UL << 0)
#define H7_PERIPH_186_BIT_1 (1UL << 1)
#define H7_PERIPH_186_BIT_2 (1UL << 2)
#define H7_PERIPH_186_BIT_3 (1UL << 3)
#define H7_PERIPH_186_BIT_4 (1UL << 4)
#define H7_PERIPH_186_BIT_5 (1UL << 5)
#define H7_PERIPH_186_BIT_6 (1UL << 6)
#define H7_PERIPH_186_BIT_7 (1UL << 7)
#define H7_PERIPH_186_BIT_8 (1UL << 8)
#define H7_PERIPH_186_BIT_9 (1UL << 9)
#define H7_PERIPH_186_BIT_10 (1UL << 10)
#define H7_PERIPH_186_BIT_11 (1UL << 11)
#define H7_PERIPH_186_BIT_12 (1UL << 12)
#define H7_PERIPH_186_BIT_13 (1UL << 13)
#define H7_PERIPH_186_BIT_14 (1UL << 14)
#define H7_PERIPH_186_BIT_15 (1UL << 15)
#define H7_PERIPH_186_BIT_16 (1UL << 16)
#define H7_PERIPH_186_BIT_17 (1UL << 17)
#define H7_PERIPH_186_BIT_18 (1UL << 18)
#define H7_PERIPH_186_BIT_19 (1UL << 19)
#define H7_PERIPH_186_BIT_20 (1UL << 20)
#define H7_PERIPH_186_BIT_21 (1UL << 21)
#define H7_PERIPH_186_BIT_22 (1UL << 22)
#define H7_PERIPH_186_BIT_23 (1UL << 23)
#define H7_PERIPH_186_BIT_24 (1UL << 24)
#define H7_PERIPH_186_BIT_25 (1UL << 25)
#define H7_PERIPH_186_BIT_26 (1UL << 26)
#define H7_PERIPH_186_BIT_27 (1UL << 27)
#define H7_PERIPH_186_BIT_28 (1UL << 28)
#define H7_PERIPH_186_BIT_29 (1UL << 29)
#define H7_PERIPH_186_BIT_30 (1UL << 30)
#define H7_PERIPH_186_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_187_TypeDef;
#define H7_PERIPH_187 ((H7_PERIPH_187_TypeDef *)(0x58000000UL + 187 * 0x400UL))

