RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_187_BIT_0 (1UL << 0)
#define H7_PERIPH_187_BIT_1 (1UL << 1)
#define H7_PERIPH_187_BIT_2 (1UL << 2)
#define H7_PERIPH_187_BIT_3 (1UL << 3)
#define H7_PERIPH_187_BIT_4 (1UL << 4)
#define H7_PERIPH_187_BIT_5 (1UL << 5)
#define H7_PERIPH_187_BIT_6 (1UL << 6)
#define H7_PERIPH_187_BIT_7 (1UL << 7)
#define H7_PERIPH_187_BIT_8 (1UL << 8)
#define H7_PERIPH_187_BIT_9 (1UL << 9)
#define H7_PERIPH_187_BIT_10 (1UL << 10)
#define H7_PERIPH_187_BIT_11 (1UL << 11)
#define H7_PERIPH_187_BIT_12 (1UL << 12)
#define H7_PERIPH_187_BIT_13 (1UL << 13)
#define H7_PERIPH_187_BIT_14 (1UL << 14)
#define H7_PERIPH_187_BIT_15 (1UL << 15)
#define H7_PERIPH_187_BIT_16 (1UL << 16)
#define H7_PERIPH_187_BIT_17 (1UL << 17)
#define H7_PERIPH_187_BIT_18 (1UL << 18)
#define H7_PERIPH_187_BIT_19 (1UL << 19)
#define H7_PERIPH_187_BIT_20 (1UL << 20)
#define H7_PERIPH_187_BIT_21 (1UL << 21)
#define H7_PERIPH_187_BIT_22 (1UL << 22)
#define H7_PERIPH_187_BIT_23 (1UL << 23)
#define H7_PERIPH_187_BIT_24 (1UL << 24)
#define H7_PERIPH_187_BIT_25 (1UL << 25)
#define H7_PERIPH_187_BIT_26 (1UL << 26)
#define H7_PERIPH_187_BIT_27 (1UL << 27)
#define H7_PERIPH_187_BIT_28 (1UL << 28)
#define H7_PERIPH_187_BIT_29 (1UL << 29)
#define H7_PERIPH_187_BIT_30 (1UL << 30)
#define H7_PERIPH_187_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_188_TypeDef;
#define H7_PERIPH_188 ((H7_PERIPH_188_TypeDef *)(0x58000000UL + 188 * 0x400UL))

#define H7_PERIPH_188_BIT_0 (1UL << 0)
#define H7_PERIPH_188_BIT_1 (1UL << 1)
#define H7_PERIPH_188_BIT_2 (1UL << 2)
#define H7_PERIPH_188_BIT_3 (1UL << 3)
#define H7_PERIPH_188_BIT_4 (1UL << 4)
#define H7_PERIPH_188_BIT_5 (1UL << 5)
#define H7_PERIPH_188_BIT_6 (1UL << 6)
#define H7_PERIPH_188_BIT_7 (1UL << 7)
#define H7_PERIPH_188_BIT_8 (1UL << 8)
#define H7_PERIPH_188_BIT_9 (1UL << 9)
#define H7_PERIPH_188_BIT_10 (1UL << 10)
#define H7_PERIPH_188_BIT_11 (1UL << 11)
#define H7_PERIPH_188_BIT_12 (1UL << 12)
#define H7_PERIPH_188_BIT_13 (1UL << 13)
#define H7_PERIPH_188_BIT_14 (1UL << 14)
#define H7_PERIPH_188_BIT_15 (1UL << 15)
#define H7_PERIPH_188_BIT_16 (1UL << 16)
#define H7_PERIPH_188_BIT_17 (1UL << 17)
#define H7_PERIPH_188_BIT_18 (1UL << 18)
#define H7_PERIPH_188_BIT_19 (1UL << 19)
#define H7_PERIPH_188_BIT_20 (1UL << 20)
#define H7_PERIPH_188_BIT_21 (1UL << 21)
#define H7_PERIPH_188_BIT_22 (1UL << 22)
#define H7_PERIPH_188_BIT_23 (1UL << 23)
#define H7_PERIPH_188_BIT_24 (1UL << 24)
#define H7_PERIPH_188_BIT_25 (1UL << 25)
#define H7_PERIPH_188_BIT_26 (1UL << 26)
#define H7_PERIPH_188_BIT_27 (1UL << 27)
#define H7_PERIPH_188_BIT_28 (1UL << 28)
#define H7_PERIPH_188_BIT_29 (1UL << 29)
#define H7_PERIPH_188_BIT_30 (1UL << 30)
#define H7_PERIPH_188_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_189_TypeDef;
#define H7_PERIPH_189 ((H7_PERIPH_189_TypeDef *)(0x58000000UL + 189 * 0x400UL))

#define H7_PERIPH_189_BIT_0 (1UL << 0)
#define H7_PERIPH_189_BIT_1 (1UL << 1)
#define H7_PERIPH_189_BIT_2 (1UL << 2)
#define H7_PERIPH_189_BIT_3 (1UL << 3)
#define H7_PERIPH_189_BIT_4 (1UL << 4)
#define H7_PERIPH_189_BIT_5 (1UL << 5)
#define H7_PERIPH_189_BIT_6 (1UL << 6)
#define H7_PERIPH_189_BIT_7 (1UL << 7)
#define H7_PERIPH_189_BIT_8 (1UL << 8)
#define H7_PERIPH_189_BIT_9 (1UL << 9)
#define H7_PERIPH_189_BIT_10 (1UL << 10)
#define H7_PERIPH_189_BIT_11 (1UL << 11)
#define H7_PERIPH_189_BIT_12 (1UL << 12)
#define H7_PERIPH_189_BIT_13 (1UL << 13)
#define H7_PERIPH_189_BIT_14 (1UL << 14)
#define H7_PERIPH_189_BIT_15 (1UL << 15)
#define H7_PERIPH_189_BIT_16 (1UL << 16)
#define H7_PERIPH_189_BIT_17 (1UL << 17)
#define H7_PERIPH_189_BIT_18 (1UL << 18)
#define H7_PERIPH_189_BIT_19 (1UL << 19)
#define H7_PERIPH_189_BIT_20 (1UL << 20)
#define H7_PERIPH_189_BIT_21 (1UL << 21)
#define H7_PERIPH_189_BIT_22 (1UL << 22)
#define H7_PERIPH_189_BIT_23 (1UL << 23)
#define H7_PERIPH_189_BIT_24 (1UL << 24)
#define H7_PERIPH_189_BIT_25 (1UL << 25)
#define H7_PERIPH_189_BIT_26 (1UL << 26)
#define H7_PERIPH_189_BIT_27 (1UL << 27)
#define H7_PERIPH_189_BIT_28 (1UL << 28)
#define H7_PERIPH_189_BIT_29 (1UL << 29)
#define H7_PERIPH_189_BIT_30 (1UL << 30)
#define H7_PERIPH_189_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_190_TypeDef;
#define H7_PERIPH_190 ((H7_PERIPH_190_TypeDef *)(0x58000000UL + 190 * 0x400UL))

#define H7_PERIPH_190_BIT_0 (1UL << 0)
#define H7_PERIPH_190_BIT_1 (1UL << 1)
#define H7_PERIPH_190_BIT_2 (1UL << 2)
#define H7_PERIPH_190_BIT_3 (1UL << 3)
#define H7_PERIPH_190_BIT_4 (1UL << 4)
#define H7_PERIPH_190_BIT_5 (1UL << 5)
#define H7_PERIPH_190_BIT_6 (1UL << 6)
#define H7_PERIPH_190_BIT_7 (1UL << 7)
#define H7_PERIPH_190_BIT_8 (1UL << 8)
#define H7_PERIPH_190_BIT_9 (1UL << 9)
#define H7_PERIPH_190_BIT_10 (1UL << 10)
#define H7_PERIPH_190_BIT_11 (1UL << 11)
#define H7_PERIPH_190_BIT_12 (1UL << 12)
#define H7_PERIPH_190_BIT_13 (1UL << 13)
#define H7_PERIPH_190_BIT_14 (1UL << 14)
#define H7_PERIPH_190_BIT_15 (1UL << 15)
#define H7_PERIPH_190_BIT_16 (1UL << 16)
#define H7_PERIPH_190_BIT_17 (1UL << 17)
#define H7_PERIPH_190_BIT_18 (1UL << 18)
#define H7_PERIPH_190_BIT_19 (1UL << 19)
#define H7_PERIPH_190_BIT_20 (1UL << 20)
#define H7_PERIPH_190_BIT_21 (1UL << 21)
#define H7_PERIPH_190_BIT_22 (1UL << 22)
#define H7_PERIPH_190_BIT_23 (1UL << 23)
#define H7_PERIPH_190_BIT_24 (1UL << 24)
#define H7_PERIPH_190_BIT_25 (1UL << 25)
#define H7_PERIPH_190_BIT_26 (1UL << 26)
#define H7_PERIPH_190_BIT_27 (1UL << 27)
#define H7_PERIPH_190_BIT_28 (1UL << 28)
#define H7_PERIPH_190_BIT_29 (1UL << 29)
#define H7_PERIPH_190_BIT_30 (1UL << 30)
#define H7_PERIPH_190_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_191_TypeDef;
#define H7_PERIPH_191 ((H7_PERIPH_191_TypeDef *)(0x58000000UL + 191 * 0x400UL))

#define H7_PERIPH_191_BIT_0 (1UL << 0)
#define H7_PERIPH_191_BIT_1 (1UL << 1)
#define H7_PERIPH_191_BIT_2 (1UL << 2)
#define H7_PERIPH_191_BIT_3 (1UL << 3)
#define H7_PERIPH_191_BIT_4 (1UL << 4)
#define H7_PERIPH_191_BIT_5 (1UL << 5)
#define H7_PERIPH_191_BIT_6 (1UL << 6)
#define H7_PERIPH_191_BIT_7 (1UL << 7)
#define H7_PERIPH_191_BIT_8 (1UL << 8)
#define H7_PERIPH_191_BIT_9 (1UL << 9)
#define H7_PERIPH_191_BIT_10 (1UL << 10)
#define H7_PERIPH_191_BIT_11 (1UL << 11)
#define H7_PERIPH_191_BIT_12 (1UL << 12)
#define H7_PERIPH_191_BIT_13 (1UL << 13)
#define H7_PERIPH_191_BIT_14 (1UL << 14)
#define H7_PERIPH_191_BIT_15 (1UL << 15)
#define H7_PERIPH_191_BIT_16 (1UL << 16)
#define H7_PERIPH_191_BIT_17 (1UL << 17)
#define H7_PERIPH_191_BIT_18 (1UL << 18)
#define H7_PERIPH_191_BIT_19 (1UL << 19)
#define H7_PERIPH_191_BIT_20 (1UL << 20)
#define H7_PERIPH_191_BIT_21 (1UL << 21)
#define H7_PERIPH_191_BIT_22 (1UL << 22)
#define H7_PERIPH_191_BIT_23 (1UL << 23)
#define H7_PERIPH_191_BIT_24 (1UL << 24)
#define H7_PERIPH_191_BIT_25 (1UL << 25)
#define H7_PERIPH_191_BIT_26 (1UL << 26)
#define H7_PERIPH_191_BIT_27 (1UL << 27)
#define H7_PERIPH_191_BIT_28 (1UL << 28)
#define H7_PERIPH_191_BIT_29 (1UL << 29)
#define H7_PERIPH_191_BIT_30 (1UL << 30)
#define H7_PERIPH_191_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_192_TypeDef;
#define H7_PERIPH_192 ((H7_PERIPH_192_TypeDef *)(0x58000000UL + 192 * 0x400UL))

#define H7_PERIPH_192_BIT_0 (1UL << 0)
#define H7_PERIPH_192_BIT_1 (1UL << 1)
#define H7_PERIPH_192_BIT_2 (1UL << 2)
#define H7_PERIPH_192_BIT_3 (1UL << 3)
#define H7_PERIPH_192_BIT_4 (1UL << 4)
#define H7_PERIPH_192_BIT_5 (1UL << 5)
#define H7_PERIPH_192_BIT_6 (1UL << 6)
#define H7_PERIPH_192_BIT_7 (1UL << 7)
#define H7_PERIPH_192_BIT_8 (1UL << 8)
#define H7_PERIPH_192_BIT_9 (1UL << 9)
#define H7_PERIPH_192_BIT_10 (1UL << 10)
#define H7_PERIPH_192_BIT_11 (1UL << 11)
#define H7_PERIPH_192_BIT_12 (1UL << 12)
#define H7_PERIPH_192_BIT_13 (1UL << 13)
#define H7_PERIPH_192_BIT_14 (1UL << 14)
#define H7_PERIPH_192_BIT_15 (1UL << 15)
#define H7_PERIPH_192_BIT_16 (1UL << 16)
#define H7_PERIPH_192_BIT_17 (1UL << 17)
#define H7_PERIPH_192_BIT_18 (1UL << 18)
#define H7_PERIPH_192_BIT_19 (1UL << 19)
#define H7_PERIPH_192_BIT_20 (1UL << 20)
#define H7_PERIPH_192_BIT_21 (1UL << 21)
#define H7_PERIPH_192_BIT_22 (1UL << 22)
#define H7_PERIPH_192_BIT_23 (1UL << 23)
#define H7_PERIPH_192_BIT_24 (1UL << 24)
#define H7_PERIPH_192_BIT_25 (1UL << 25)
#define H7_PERIPH_192_BIT_26 (1UL << 26)
#define H7_PERIPH_192_BIT_27 (1UL << 27)
#define H7_PERIPH_192_BIT_28 (1UL << 28)
#define H7_PERIPH_192_BIT_29 (1UL << 29)
#define H7_PERIPH_192_BIT_30 (1UL << 30)
#define H7_PERIPH_192_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_193_TypeDef;
#define H7_PERIPH_193 ((H7_PERIPH_193_TypeDef *)(0x58000000UL + 193 * 0x400UL))

#define H7_PERIPH_193_BIT_0 (1UL << 0)
#define H7_PERIPH_193_BIT_1 (1UL << 1)
#define H7_PERIPH_193_BIT_2 (1UL << 2)
#define H7_PERIPH_193_BIT_3 (1UL << 3)
#define H7_PERIPH_193_BIT_4 (1UL << 4)
#define H7_PERIPH_193_BIT_5 (1UL << 5)
#define H7_PERIPH_193_BIT_6 (1UL << 6)
#define H7_PERIPH_193_BIT_7 (1UL << 7)
#define H7_PERIPH_193_BIT_8 (1UL << 8)
#define H7_PERIPH_193_BIT_9 (1UL << 9)
#define H7_PERIPH_193_BIT_10 (1UL << 10)
#define H7_PERIPH_193_BIT_11 (1UL << 11)
#define H7_PERIPH_193_BIT_12 (1UL << 12)
#define H7_PERIPH_193_BIT_13 (1UL << 13)
#define H7_PERIPH_193_BIT_14 (1UL << 14)
#define H7_PERIPH_193_BIT_15 (1UL << 15)
#define H7_PERIPH_193_BIT_16 (1UL << 16)
#define H7_PERIPH_193_BIT_17 (1UL << 17)
#define H7_PERIPH_193_BIT_18 (1UL << 18)
#define H7_PERIPH_193_BIT_19 (1UL << 19)
#define H7_PERIPH_193_BIT_20 (1UL << 20)
#define H7_PERIPH_193_BIT_21 (1UL << 21)
#define H7_PERIPH_193_BIT_22 (1UL << 22)
#define H7_PERIPH_193_BIT_23 (1UL << 23)
#define H7_PERIPH_193_BIT_24 (1UL << 24)
#define H7_PERIPH_193_BIT_25 (1UL << 25)
#define H7_PERIPH_193_BIT_26 (1UL << 26)
#define H7_PERIPH_193_BIT_27 (1UL << 27)
#define H7_PERIPH_193_BIT_28 (1UL << 28)
#define H7_PERIPH_193_BIT_29 (1UL << 29)
#define H7_PERIPH_193_BIT_30 (1UL << 30)
#define H7_PERIPH_193_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_194_TypeDef;
#define H7_PERIPH_194 ((H7_PERIPH_194_TypeDef *)(0x58000000UL + 194 * 0x400UL))

#define H7_PERIPH_194_BIT_0 (1UL << 0)
#define H7_PERIPH_194_BIT_1 (1UL << 1)
#define H7_PERIPH_194_BIT_2 (1UL << 2)
#define H7_PERIPH_194_BIT_3 (1UL << 3)
#define H7_PERIPH_194_BIT_4 (1UL << 4)
#define H7_PERIPH_194_BIT_5 (1UL << 5)
#define H7_PERIPH_194_BIT_6 (1UL << 6)
#define H7_PERIPH_194_BIT_7 (1UL << 7)
#define H7_PERIPH_194_BIT_8 (1UL << 8)
#define H7_PERIPH_194_BIT_9 (1UL << 9)
#define H7_PERIPH_194_BIT_10 (1UL << 10)
#define H7_PERIPH_194_BIT_11 (1UL << 11)
#define H7_PERIPH_194_BIT_12 (1UL << 12)
#define H7_PERIPH_194_BIT_13 (1UL << 13)
#define H7_PERIPH_194_BIT_14 (1UL << 14)
#define H7_PERIPH_194_BIT_15 (1UL << 15)
#define H7_PERIPH_194_BIT_16 (1UL << 16)
#define H7_PERIPH_194_BIT_17 (1UL << 17)
#define H7_PERIPH_194_BIT_18 (1UL << 18)
#define H7_PERIPH_194_BIT_19 (1UL << 19)
#define H7_PERIPH_194_BIT_20 (1UL << 20)
#define H7_PERIPH_194_BIT_21 (1UL << 21)
#define H7_PERIPH_194_BIT_22 (1UL << 22)
#define H7_PERIPH_194_BIT_23 (1UL << 23)
#define H7_PERIPH_194_BIT_24 (1UL << 24)
#define H7_PERIPH_194_BIT_25 (1UL << 25)
#define H7_PERIPH_194_BIT_26 (1UL << 26)
#define H7_PERIPH_194_BIT_27 (1UL << 27)
#define H7_PERIPH_194_BIT_28 (1UL << 28)
#define H7_PERIPH_194_BIT_29 (1UL << 29)
#define H7_PERIPH_194_BIT_30 (1UL << 30)
#define H7_PERIPH_194_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_195_TypeDef;
#define H7_PERIPH_195 ((H7_PERIPH_195_TypeDef *)(0x58000000UL + 195 * 0x400UL))

#define H7_PERIPH_195_BIT_0 (1UL << 0)
#define H7_PERIPH_195_BIT_1 (1UL << 1)
#define H7_PERIPH_195_BIT_2 (1UL << 2)
#define H7_PERIPH_195_BIT_3 (1UL << 3)
#define H7_PERIPH_195_BIT_4 (1UL << 4)
#define H7_PERIPH_195_BIT_5 (1UL << 5)
#define H7_PERIPH_195_BIT_6 (1UL << 6)
#define H7_PERIPH_195_BIT_7 (1UL << 7)
#define H7_PERIPH_195_BIT_8 (1UL << 8)
#define H7_PERIPH_195_BIT_9 (1UL << 9)
#define H7_PERIPH_195_BIT_10 (1UL << 10)
#define H7_PERIPH_195_BIT_11 (1UL << 11)
#define H7_PERIPH_195_BIT_12 (1UL << 12)
#define H7_PERIPH_195_BIT_13 (1UL << 13)
#define H7_PERIPH_195_BIT_14 (1UL << 14)
#define H7_PERIPH_195_BIT_15 (1UL << 15)
#define H7_PERIPH_195_BIT_16 (1UL << 16)
#define H7_PERIPH_195_BIT_17 (1UL << 17)
#define H7_PERIPH_195_BIT_18 (1UL << 18)
#define H7_PERIPH_195_BIT_19 (1UL << 19)
#define H7_PERIPH_195_BIT_20 (1UL << 20)
#define H7_PERIPH_195_BIT_21 (1UL << 21)
#define H7_PERIPH_195_BIT_22 (1UL << 22)
#define H7_PERIPH_195_BIT_23 (1UL << 23)
#define H7_PERIPH_195_BIT_24 (1UL << 24)
#define H7_PERIPH_195_BIT_25 (1UL << 25)
#define H7_PERIPH_195_BIT_26 (1UL << 26)
#define H7_PERIPH_195_BIT_27 (1UL << 27)
#define H7_PERIPH_195_BIT_28 (1UL << 28)
#define H7_PERIPH_195_BIT_29 (1UL << 29)
#define H7_PERIPH_195_BIT_30 (1UL << 30)
#define H7_PERIPH_195_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_196_TypeDef;
#define H7_PERIPH_196 ((H7_PERIPH_196_TypeDef *)(0x58000000UL + 196 * 0x400UL))

#define H7_PERIPH_196_BIT_0 (1UL << 0)
#define H7_PERIPH_196_BIT_1 (1UL << 1)
#define H7_PERIPH_196_BIT_2 (1UL << 2)
#define H7_PERIPH_196_BIT_3 (1UL << 3)
#define H7_PERIPH_196_BIT_4 (1UL << 4)
#define H7_PERIPH_196_BIT_5 (1UL << 5)
#define H7_PERIPH_196_BIT_6 (1UL << 6)
#define H7_PERIPH_196_BIT_7 (1UL << 7)
#define H7_PERIPH_196_BIT_8 (1UL << 8)
#define H7_PERIPH_196_BIT_9 (1UL << 9)
#define H7_PERIPH_196_BIT_10 (1UL << 10)
#define H7_PERIPH_196_BIT_11 (1UL << 11)
#define H7_PERIPH_196_BIT_12 (1UL << 12)
#define H7_PERIPH_196_BIT_13 (1UL << 13)
#define H7_PERIPH_196_BIT_14 (1UL << 14)
#define H7_PERIPH_196_BIT_15 (1UL << 15)
#define H7_PERIPH_196_BIT_16 (1UL << 16)
#define H7_PERIPH_196_BIT_17 (1UL << 17)
#define H7_PERIPH_196_BIT_18 (1UL << 18)
#define H7_PERIPH_196_BIT_19 (1UL << 19)
#define H7_PERIPH_196_BIT_20 (1UL << 20)
#define H7_PERIPH_196_BIT_21 (1UL << 21)
#define H7_PERIPH_196_BIT_22 (1UL << 22)
#define H7_PERIPH_196_BIT_23 (1UL << 23)
#define H7_PERIPH_196_BIT_24 (1UL << 24)
#define H7_PERIPH_196_BIT_25 (1UL << 25)
#define H7_PERIPH_196_BIT_26 (1UL << 26)
#define H7_PERIPH_196_BIT_27 (1UL << 27)
#define H7_PERIPH_196_BIT_28 (1UL << 28)
#define H7_PERIPH_196_BIT_29 (1UL << 29)
#define H7_PERIPH_196_BIT_30 (1UL << 30)
#define H7_PERIPH_196_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_197_TypeDef;
#define H7_PERIPH_197 ((H7_PERIPH_197_TypeDef *)(0x58000000UL + 197 * 0x400UL))

