RohithSai4518/Embeded_Systems/include/registers/reg_stm32h7xx.h
#define H7_PERIPH_197_BIT_0 (1UL << 0)
#define H7_PERIPH_197_BIT_1 (1UL << 1)
#define H7_PERIPH_197_BIT_2 (1UL << 2)
#define H7_PERIPH_197_BIT_3 (1UL << 3)
#define H7_PERIPH_197_BIT_4 (1UL << 4)
#define H7_PERIPH_197_BIT_5 (1UL << 5)
#define H7_PERIPH_197_BIT_6 (1UL << 6)
#define H7_PERIPH_197_BIT_7 (1UL << 7)
#define H7_PERIPH_197_BIT_8 (1UL << 8)
#define H7_PERIPH_197_BIT_9 (1UL << 9)
#define H7_PERIPH_197_BIT_10 (1UL << 10)
#define H7_PERIPH_197_BIT_11 (1UL << 11)
#define H7_PERIPH_197_BIT_12 (1UL << 12)
#define H7_PERIPH_197_BIT_13 (1UL << 13)
#define H7_PERIPH_197_BIT_14 (1UL << 14)
#define H7_PERIPH_197_BIT_15 (1UL << 15)
#define H7_PERIPH_197_BIT_16 (1UL << 16)
#define H7_PERIPH_197_BIT_17 (1UL << 17)
#define H7_PERIPH_197_BIT_18 (1UL << 18)
#define H7_PERIPH_197_BIT_19 (1UL << 19)
#define H7_PERIPH_197_BIT_20 (1UL << 20)
#define H7_PERIPH_197_BIT_21 (1UL << 21)
#define H7_PERIPH_197_BIT_22 (1UL << 22)
#define H7_PERIPH_197_BIT_23 (1UL << 23)
#define H7_PERIPH_197_BIT_24 (1UL << 24)
#define H7_PERIPH_197_BIT_25 (1UL << 25)
#define H7_PERIPH_197_BIT_26 (1UL << 26)
#define H7_PERIPH_197_BIT_27 (1UL << 27)
#define H7_PERIPH_197_BIT_28 (1UL << 28)
#define H7_PERIPH_197_BIT_29 (1UL << 29)
#define H7_PERIPH_197_BIT_30 (1UL << 30)
#define H7_PERIPH_197_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_198_TypeDef;
#define H7_PERIPH_198 ((H7_PERIPH_198_TypeDef *)(0x58000000UL + 198 * 0x400UL))

#define H7_PERIPH_198_BIT_0 (1UL << 0)
#define H7_PERIPH_198_BIT_1 (1UL << 1)
#define H7_PERIPH_198_BIT_2 (1UL << 2)
#define H7_PERIPH_198_BIT_3 (1UL << 3)
#define H7_PERIPH_198_BIT_4 (1UL << 4)
#define H7_PERIPH_198_BIT_5 (1UL << 5)
#define H7_PERIPH_198_BIT_6 (1UL << 6)
#define H7_PERIPH_198_BIT_7 (1UL << 7)
#define H7_PERIPH_198_BIT_8 (1UL << 8)
#define H7_PERIPH_198_BIT_9 (1UL << 9)
#define H7_PERIPH_198_BIT_10 (1UL << 10)
#define H7_PERIPH_198_BIT_11 (1UL << 11)
#define H7_PERIPH_198_BIT_12 (1UL << 12)
#define H7_PERIPH_198_BIT_13 (1UL << 13)
#define H7_PERIPH_198_BIT_14 (1UL << 14)
#define H7_PERIPH_198_BIT_15 (1UL << 15)
#define H7_PERIPH_198_BIT_16 (1UL << 16)
#define H7_PERIPH_198_BIT_17 (1UL << 17)
#define H7_PERIPH_198_BIT_18 (1UL << 18)
#define H7_PERIPH_198_BIT_19 (1UL << 19)
#define H7_PERIPH_198_BIT_20 (1UL << 20)
#define H7_PERIPH_198_BIT_21 (1UL << 21)
#define H7_PERIPH_198_BIT_22 (1UL << 22)
#define H7_PERIPH_198_BIT_23 (1UL << 23)
#define H7_PERIPH_198_BIT_24 (1UL << 24)
#define H7_PERIPH_198_BIT_25 (1UL << 25)
#define H7_PERIPH_198_BIT_26 (1UL << 26)
#define H7_PERIPH_198_BIT_27 (1UL << 27)
#define H7_PERIPH_198_BIT_28 (1UL << 28)
#define H7_PERIPH_198_BIT_29 (1UL << 29)
#define H7_PERIPH_198_BIT_30 (1UL << 30)
#define H7_PERIPH_198_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t CR, ISR, ICR, IER, CFGR1, CFGR2, DR, SR, DLR, CCR, TCR, RDR, WDR, SMCR, DIER, EGR, CCMR1, CCMR2, CCER, CNT, PSC, ARR; } H7_PERIPH_199_TypeDef;
#define H7_PERIPH_199 ((H7_PERIPH_199_TypeDef *)(0x58000000UL + 199 * 0x400UL))

#define H7_PERIPH_199_BIT_0 (1UL << 0)
#define H7_PERIPH_199_BIT_1 (1UL << 1)
#define H7_PERIPH_199_BIT_2 (1UL << 2)
#define H7_PERIPH_199_BIT_3 (1UL << 3)
#define H7_PERIPH_199_BIT_4 (1UL << 4)
#define H7_PERIPH_199_BIT_5 (1UL << 5)
#define H7_PERIPH_199_BIT_6 (1UL << 6)
#define H7_PERIPH_199_BIT_7 (1UL << 7)
#define H7_PERIPH_199_BIT_8 (1UL << 8)
#define H7_PERIPH_199_BIT_9 (1UL << 9)
#define H7_PERIPH_199_BIT_10 (1UL << 10)
#define H7_PERIPH_199_BIT_11 (1UL << 11)
#define H7_PERIPH_199_BIT_12 (1UL << 12)
#define H7_PERIPH_199_BIT_13 (1UL << 13)
#define H7_PERIPH_199_BIT_14 (1UL << 14)
#define H7_PERIPH_199_BIT_15 (1UL << 15)
#define H7_PERIPH_199_BIT_16 (1UL << 16)
#define H7_PERIPH_199_BIT_17 (1UL << 17)
#define H7_PERIPH_199_BIT_18 (1UL << 18)
#define H7_PERIPH_199_BIT_19 (1UL << 19)
#define H7_PERIPH_199_BIT_20 (1UL << 20)
#define H7_PERIPH_199_BIT_21 (1UL << 21)
#define H7_PERIPH_199_BIT_22 (1UL << 22)
#define H7_PERIPH_199_BIT_23 (1UL << 23)
#define H7_PERIPH_199_BIT_24 (1UL << 24)
#define H7_PERIPH_199_BIT_25 (1UL << 25)
#define H7_PERIPH_199_BIT_26 (1UL << 26)
#define H7_PERIPH_199_BIT_27 (1UL << 27)
#define H7_PERIPH_199_BIT_28 (1UL << 28)
#define H7_PERIPH_199_BIT_29 (1UL << 29)
#define H7_PERIPH_199_BIT_30 (1UL << 30)
#define H7_PERIPH_199_BIT_31 (1UL << 31)
#ifdef __cplusplus
}
#endif
#endif
